[{"title": "Industrial output rises to 3.5% in July on strong manufacturing growth", "sub_heading": "Manufacturing drives recovery; mining sector contracts sharply by 7.2% during the month", "publisher": "By BL New Delhi Bureau\nUpdated - August 28, 2025 at 04:28 PM. | New Delhi, August 28", "story": "Factory output based on the Index of Industrial Production (IIP) grew 3.5 per cent in July as against 1.5 per cent in June, the government reported on Thursday.\nHere are highlights:\n-         The growth rates of the three sectors — Mining, Manufacturing and Electricity — for July 2025 are (-) 7.2 per cent, 5.4 per cent and 0.6 per cent respectively\nREAD MORE", "timestamp": "2025-08-28T18:10:16.287051"}, {"title": "Stock Market Highlights 28 August 2025: Sensex tanks 706 points, Nifty falls to 24,500 as steep 50% US tariffs dent investor sentiment", "sub_heading": "Sensex, Nifty, Share Prices Highlights: Benchmark indices tumbled on Thursday, with the Sensex cracking 706 points, as the additional 25 per cent tariff imposed by US President Donald Trump on India for its purchases of Russian oil came into effect. Besides this, persistent foreign fund outflows also dented investors’ sentiment. The additional 25 per cent tariff imposed by the US on India came into effect on Wednesday, bringing the total amount of levies imposed on New Delhi to 50 per cent. The 30-share BSE Sensex tanked 705.97 points or 0.87 per cent to settle at 80,080.57. During the day, it dropped 773.52 points or 0.95 per cent to 80,013.02. The 50-share NSE Nifty dived 211.15 points or 0.85 per cent to 24,500.90. From the Sensex firms, HCL Tech, Infosys, Power Grid, Tata Consultancy Services, HDFC Bank, Hindustan Unilever, Bharti Airtel and ICICI Bank were among the major laggards. However, Titan, Larsen & Toubro, Maruti and Axis Bank were among the gainers.", "publisher": "By Team BLKS Badri Narayanan\nUpdated - August 28, 2025 at 04:12 PM.", "story": "Stock Market today | Share Market Highlights - Find here all the highlights related to Sensex, Nifty, BSE, NSE, share prices and Indian stock markets for 28 Aug 2025 \nAugust 28, 2025 16:07\nClosing bell: Reeling from the sudden imposition of 25% extra US tariffs, benchmark indices ended lower today, says Vaibhav Vidwani, Research Analyst at Bonanza\nView from Vaibhav Vidwani, Research Analyst at Bonanza:\n“Today, Indian stock markets ended lower, with the Nifty 50 falling 0.85% to 24,500 and the Sensex declining 0.87% to 80,080, marking a negative close after a day of widespread selling pressure. The principal reason for today’s downturn was the sudden imposition of an additional 25% tariff by the US on Indian exports—taking the total to 50%—which rattled investor sentiment and led to sharp early losses across indices. Looking forward, the sentiment is expected to remain cautious with markets likely to remain rangebound as participants wait for more clarity on the India–US trade standoff and the global interest rate outlook. Any signs of resolution in tariffs or positive developments in global markets could lend support, but further FII outflows and pressure on bank stocks may cap near-term gains.”\nAugust 28, 2025 16:05\nClosing bell: Kansai Nerolac Paints has opened a sales depot at Nanded, Maharashtra\nAugust 28, 2025 16:05\nClosing bell: Rupee rises 6 paise to close at 87.63 against US dollar\nThe rupee rose by 6 paise to close at 87.63 (provisional) against the US dollar on Thursday aided by a weaker greenback and a decline in crude oil prices.\nHowever, concerns over additional US tariffs on Indian products, which kicked in on Wednesday, and a decline in domestic equity markets capped gains in the local unit, according to forex traders.\nThe US government has imposed a total of 50 per cent tariffs on Indian exports to America, barring a few sectors.\nRupee rises 6 paise to close at 87.63 against US dollar\nThe rupee rose by 6 paise to close at 87.63 (provisional) against the US dollar on Thursday aided by a weaker greenback and a decline in crude oil prices.\nAugust 28, 2025 15:51\nCurrency update: Rupee rises 6 paise to close at 87.63 (provisional) against US dollar.\nAugust 28, 2025 15:47\nStock market live: Sensex ended 705.97 pts or 0.87% lower at 80,080.57; Nifty 50 fell 211.15 pts or 0.85% to 24,500.90\nSensex ended 705.97 pts or 0.87 per cent lower at 80,080.57 (close to intraday low of 80,013.02). Nifty 50 fell 211.15 pts or 0.85 per cent to 24,500.90 after hitting a low of 24,481.60. Most sectors, including Auto, IT, FMCG, and Metals, ended in negative range as investors turned to profit booking from recent gains. Consumer Durables staged resilience.\nAugust 28, 2025 15:37\nStock markets live today: Mastercard and Infosys collaborate to scale cross-border payments\nAugust 28, 2025 15:36\nStock market live today: Dr Agarwal’s Eye Hospitals to merge with parent Dr Agarwal’s Health Care\nListed healthcare services provider Dr Agarwal’s Eye Hospital (AEHL) is merging with its listed parent Dr Agarwal’s Health Care Ltd (AHCL) by way of a merger by way of absorption as a going concern.\nThe Boards of Directors of AHCL and AEHL at their respective board meetings held on August 27 approved the scheme of amalgamation of the two independently listed companies under the Dr Agarwal’s Group. The merger is subject to the requisite approvals from respective shareholders of AHCL and AEHL and the applicable regulatory approvals.\nDr Agarwal’s Eye Hospitals to merge with parent Dr Agarwal’s Health Care\nDr Agarwal’s Eye Hospital (AEHL) merging with Dr Agarwal’s Health Care Ltd (AHCL) to create a stronger entity.\nAugust 28, 2025 15:35\nStock market live: Mumbai-based SFC Environmental Technologies files DRHP for IPO\nMumbai-based environmental technology company involved in wastewater treatment and solid waste treatment company; SFC Environmental Technologies has filed its Draft Red Herring Prospectus (DRHP) with capital markets regulator, Securities and Exchange Board of India (SEBI) for its Initial Public Offering (IPO).\nThe offer, with a face value of ₹2, is a mix of fresh issue of shares up to ₹150 crore and an offer-for-sale up to 12,307,500 shares by promoters and other selling shareholders. The promoters selling shares are Sandeep Sudhakar Asolkar and Saketchandrasingh Pratapsingh Dhandoriya. Other selling shareholders are Sarvesh Kumar Garg, Sandeep Sambhaji Parab, Rajesh Kesavan Nambisan, Veera Venkata Satyanarayana Yannamani, Jaya Chandrakant Gogri, Jayshree Harit Shah, Hardik Suresh Matalia, Parag Bipinchandra Shah and Kumaraguru Madurakavi.\nThe offer also includes a subscription reservation by eligible employees, and a discount is being offered to eligible employees bidding in the employee reservation portion.\nAugust 28, 2025 15:20\nShare market live updates: Patel Engineering Ltd raises ₹90 crore from Non-Convertible Debenture issue of private placement\nPatel Engineering Ltd has raised ₹90 crore from Non-Convertible Debenture issue of private placement.\nThe fundraise will be utilised to support working capital requirements for ongoing EPC projects, repayment/prepayment of debt, and mobilization for new projects. This strategic step reflects Patel Engineering’s commitment to maintaining a resilient balance sheet while scaling operations across its growing infrastructure portfolio.\nAugust 28, 2025 15:19\nStock market live updates: Jio Financial Services Limited (JFSL) held its second Annual General Meeting post listing today\nThe meeting was addressed by Mr. K.V. Kamath, Chairman, JFSL; and Mr. Hitesh Sethia, MD & CEO, JFSL.\nExcerpts from the address of Mr. K.V. Kamath, Chairman, JFSL\nIndia is on the threshold of an extraordinary decade. With a young population, rising income levels, policy-led reforms, a strong infrastructure push, and digital adoption at scale, our economy is well-placed to sustain a GDP growth of around 6.5-7%, making it the fastest growing major economy in the world.\nOne of the most remarkable achievements in recent years has been the creation of a robust digital public infrastructure. These platforms are helping bridge the rural–urban divide, bringing millions of first-time users into the fold of the formal economy, and enabling a new age digital ecosystem that is inclusive and equitable.\nFY25 was a pivotal year for our Company. During this period, we scaled our existing businesses, successfully operationalized new ventures, secured key regulatory approvals for new businesses to come, and implemented a sophisticated data intelligence engine, which will form the backbone of our personalised and intelligent financial services offerings for customers.\nExcerpts from the address of Mr. Hitesh Sethia, MD & CEO, JFSL\nOur businesses such as the NBFC, the asset management JV with BlackRock, the payments bank, the payment solutions vertical, and the insurance broking arm are off to a robust start and continue to scale up…even as we firm up our go-to-market plans for our other proposed ventures, including the JVs with BlackRock for wealth management and broking, as well as our recently announced partnership with Allianz for insurance.\nWe have ambitious plans of becoming a leading, full-stack financial services institution with significant market share. The Company is in a strategic build-out phase at the moment, with diverse businesses which are either being scaled up or newly incubated.\nOur business model is uniquely structured to fund its expansion directly from the return on our shareholders’ capital, even as the core capital base itself provides us sufficient cushion. This approach allows us to grow sustainably, with disciplined allocation of resources. At this juncture of our growth journey, conventional valuation metrics may not fully capture the intrinsic value of our model.\nA key monitorable for us is the steady increase in income from business operations (~40% of consolidated total net income in Q1 FY26, up from ~12% in Q1FY 25), which highlights the growing strength of our core activities, and will be a key driver of our future success.\nThe JioFinance app, our primary digital storefront for retail customers, which is also embedded within the MyJio app, continued to gain traction over this period. In Q1 FY26, we served an average 8.1 million Monthly Active Users across all our digital properties.\nOur app has seen significant traction in user engagement, especially with new products like JioBlackRock’s mutual funds and features such as tax filing and planning going live.\nAlongside our in-house product suite, we have also entered into tie-ups with trusted partner brands to bring our customers a range of solutions, including digital gold, life and general insurance, and tax filing and planning, which are complementary to our offerings.\nOver the coming months, you’ll see us entering more such strategic tie-ups with leading financial services providers to further expand our portfolio with new products, designed to cater to the financial needs of our customers holistically.\nAugust 28, 2025 15:15\nStock market live news: Dev Information Technology has secured a significant work order from RajCOMP Info Services Ltd., a Government of Rajasthan undertaking; Shares zoom 7% on the NSE to Rs 44.41.\nAugust 28, 2025 15:14\nStock market live updates today: Protean awarded UIDAI mandate to strengthen Aadhaar services across 188 districts in India\nProtean eGov Technologies Ltd. (formerly NSDL e-Governance Infrastructure Ltd.) has been awarded a landmark contract to establish and operate Aadhaar Seva Kendras (ASKs) across 188 districts in the country, by the Unique Identification Authority of India (UIDAI), the statutory authority for Aadhaar, under the Ministry of Electronics and Information Technology (MeitY). This work order is valued at approx. ₹1160 Cr (exclusive of taxes) and the total deal size amounting to approx. ₹1370 Cr crores (inclusive of taxes).\nUnder this mandate, Protean will set up dedicated infrastructure and provide end-to-end managed services for Aadhaar enrolment, demographic/biometric updates, and other walk-in citizen services. This project covers manpower, infrastructure, and hardware deployment, reinforcing Protean’s pivotal role in scaling India’s digital identity ecosystem.\nAugust 28, 2025 15:14\nShare market live news: Manappuram Finance shares traded at Rs 263.45 on the NSE, down 1%. The company signed a deal worth over Rs 4,384 crore with BC Asia Investments and a promoter group.\nAugust 28, 2025 15:13\nStock market live updates: Aimtron Electronics Limited receives an order of 50,000 IIoT and AI devices from Vanix Technologies\nAimtron Electronics Limited, one of India’s fastest-growing Electronics System Design and Manufacturing (ESDM) companies, has received an order of 50,000 Industrial Internet of Things (IIoT) and Artificial Intelligence (AI) devices from Vanix Technologies under the Memorandum of Understanding (MoU) signed in December 2024. Over the next five years, Aimtron will manufacture between 250,000 and 2 million IoT devices, supporting India’s electronics self-reliance and accelerating the adoption of smart manufacturing solutions.\nAugust 28, 2025 15:05\nStock market live updates: Texmaco Rail & Engineering and RVNL partner on rail projects\nTexmaco Rail & Engineering had approved the incorporation of a JV with Rail Vikas Nigam Limited for rolling stock and rail infrastructure projects\nTexmaco Rail shares down 1% on the NSE to ₹136.70, and RVNL was down 1.60% to ₹307.70.\nAugust 28, 2025 15:01\nStock market live updates today: Humro Turns Tariff Challenge into Opportunity With Local Partnerships and Smart Pricing\nHumro (an ARAPL RaaS brand and subsidiary of Affordable Robotic and Automation Limited, BSE: 541402, NSE SYMBOL: AFFORDABLE), a leader in autonomous material handling and robotics solutions, today announced its comprehensive strategy to address recent tariff changes impacting imports into the United States. The announcement comes at a time when the US warehouse automation market is projected to grow at a 20.6% CAGR between 2025 and 2030, rising from USD 5.78 billion in 2024 to nearly USD 16.6 billion by the end of the decade. While acknowledging that the new tariffs translate into roughly seven percent of its topline, the company emphasized that proactive measures are already in place to protect customers and maintain its competitive edge.\nAugust 28, 2025 14:59\nStock market live updates: Ind-Swift Laboratories’ promoter group acquires 45.15 lakh shares\nInd-Swift Laboratories’ promoter group acquired 45,15,495 Equity Shares of face value of INR 10/- each of Ind-Swift Laboratories Limited pursuant to Scheme of arrangement for Amalgamation of Ind-Swift Limited with IndSwift Laboratories Limited .\nInd-Swift Laboratories stock traded flat on the NSE at ₹95.\nAugust 28, 2025 14:56\nShare market live news: Sanathan Textiles commences Commercial Production at its Green Manufacturing Facility in Punjab\nThe Management of Sanathan Textiles Limited is pleased to announce a significant milestone in the Company’s growth journey with the commencement of commercial production at its state-of-the-art manufacturing facility in Wazirabad, Punjab.\nPhase 1 has been commissioned today with the Continuous Polymerisation (CP) line, marking the first step in the Company’s geographical expansion. The facility has commenced production at 350 tonnes per day, which is expected to gradually ramp up to 700 tonnes per day, in the next 3-4 months.\nAfter implementation of Phase 2, the Punjab facility will contribute 950 tonnes per day, enhancing Sanathan Textiles’ total installed yarn- manufacturing capacity from 2,23,750 MTPA at Silvassa to 5,70,500 MTPA across both locations.\nWhile both plants are targeted to operate at optimal utilisation, their commercial focus will be strategically differentiated:\nPunjab will prioritise building a strong local ecosystem and focus on green manufacturing practices, primarily catering to North India’s textile market.\nSilvassa, with its proximity to India’s western ports, will focus on meeting both domestic and export demand, thereby strengthening the Company’s global footprint.\nAugust 28, 2025 14:56\nStock market live updates: Power Mech Projects bags ₹371 crore order from Adani Power arm Mahan Energen\nPower Mech Projects on Thursday said that it has secured an order worth ₹370.84 crore from Adani Power arm Mahan Energen for the execution of civil works at the Mahan Phase-III project in Singrauli, Madhya Pradesh.\nPower Mech Projects bags ₹371 crore order from Adani Power arm Mahan Energen\nMahan Energen Ltd awards Power Mech Projects a ₹370.84 crore order for civil works at Mahan Phase-III project.\nAugust 28, 2025 14:54\nShare market live today: Grip Invest rolls out next-gen ONDC Network-powered Mutual Fund stack, in collaboration with Cybrilla\nGrip Invest, India’s one-stop destination for fixed returns, has announced its successful integration with the Open Network for Digital Commerce (ONDC) Network, powered by Cybrilla Technologies. Grip Invest was able to go live on the network in under 2 months.\n“Financial Services” on ONDC network is designed to simplify and reduce the cost of mutual fund investing, while making it accessible to every Indian. In a major step towards democratizing fixed-income investing in India, Grip Invest has joined the ONDC (Open Network for Digital Commerce) to create a seamless, compliant, and scalable investment ecosystem.\nThis collaboration connects investor demand with a wide range of mutual funds via Cybrilla—making investing more affordable, inclusive, and accessible to all.\nAugust 28, 2025 14:50\nStock market live updates today: Sensex tumbles 720 pts\nAugust 28, 2025 14:50\nStock market live updates: Shrimp stocks on the BSE\nAvanti Feeds (-1.98%), Apex Frozen Foods (-5.49%), Waterbase (-2.62%), Zeal Aqua (-2.65%)\nAugust 28, 2025 14:43\nStock market live: All technologies contributing towards moving to net-zero should be incentivised: Maruti Chairman\nAll technologies contributing towards moving to net-zero should be incentivised: Maruti Chairman\nMaruti Suzuki India Chairman advocates for cleaner cars, reduction of pollution, and GST reduction on small cars for industry growth.\nAugust 28, 2025 14:36\nStock market live today: Adani Energy declines a little over 1% to ₹777.90 on the NSE\nAdani Energy Solutions declined a little over 1% to ₹777.90 on the NSE. The company had incorporated a wholly owned subsidiary named Adani Energy Solutions Step-Fifteen\nAugust 28, 2025 14:35\nStock market live today: Shakti Pumps secures first tranche order worth ₹268.88 cr from Maharashtra\nShakti Pumps informed that pursuant to the Letter of Empanelment from the Maharashtra State Electricity Distribution Company Limited for the supply and installation of 34,720 off-grid DC Solar Photovoltaic Water Pumping Systems under the Magel Tyala Saur Krushi Pump Yojana / PM KUSUM B, the portal was opened and selection completed for the company for the first tranche of 10,000 SPWPS amounting for approximately ₹268.88 Crore (inclusive of GST).\nAugust 28, 2025 14:11\nStock market live today: US tariffs: India must stand up to bullying, says Maruti Chairman RC Bhargava\nUS tariffs: India must stand up to bullying, says Maruti Chairman RC Bhargava\nIndia needs to come together to deal with the 50 per cent punitive US tariffs on Indian products and stand up to any kind of bullying, Maruti Suzuki India Chairman R C Bhargava said on Thursday.\nAugust 28, 2025 14:05\nStock market live updates: Shiv Texchem bags ₹10.72 cr contract from Gujarat Narmada Valley Fertilizers\nShiv Texchem has received Letter of Acceptance from Gujarat Narmada Valley Fertilizers & Chemicals for the Supply of Toluene. The cost of the contract is ₹10.72 crore\nAugust 28, 2025 14:04\nStock market live updates: Dalal Street slumps as 50% tariff shock triggers broad-based selloff; Realty & IT stocks lead the decline\nBenchmark indices witnessed maximum pressure, majorly triggered as the additional 25 per cent tariffs imposed by US President Donald Trump on India came into effect, weighing on investors’ sentiment The cautious mood was further amplified by volatile foreign fund flows and lingering worries about global growth and currency stability.\nCoupled with heavy promoter stake sales in frontline companies like IndiGo, profit booking in recent outperformers, and concerns over stretched valuations, the indices faced broad-based pressure. T\nSensex tumbled 615.39 pts or 0.76 per cent to 80,171.15 at 1.34 pm after hitting an intraday low of 80,093.52. Nifty 50 depreciated by 174.75 pts or 0.71 per cent to 24,537.30.\nSensex tanked nearly 693 pts against the previous close and Nifty dragged 204 pts in the mid-trading session on Thursday.\ntop gainers & losers today Aug 28: Sensex, Nifty 50 drag as broad-based selloff hit Dalal Street amid 50% tariff shock, realty & IT stocks drag the most\nBenchmark indices under pressure due to US tariffs, promoter stake sales, profit booking, stretched valuations, and global concerns.\nAugust 28, 2025 14:00\nStock market live updates: TVS Motor Company expands EV portfolio with TVS Orbiter\nTVS Motor Company launches new EV TVS Orbiter\nEnhancing its presence in the electric scooter segment, TVS Motor Company on Thursday launched its new electric offering, TVS Orbiter\nAugust 28, 2025 13:55\nStock market live updates: Sai Life Sciences completes construction of Phase II block in Bidar\nSai Life Sciences announced the completion of Phase II of its new Production Block at the company’s API manufacturing facility in Bidar, India.\nShares down 4% on the NSE to ₹824.70\nAugust 28, 2025 13:54\nStock market live updates: India’s product exports to the US could reduce to $49.6 billion in FY25: Colin Shah, MD, Kama Jewelry\nPerspective of Colin Shah, MD, Kama Jewelry, on Impact of Trump trade tariffs on gems and jewellery industry in India\n“India’s product exports to the US are at risk, with estimates indicating a possible reduction this year to $49.6 billion from close to $87 billion in 2024–25 since two-thirds of value exports to the US will be subject to 50 per cent tariffs. This threatens India’s gems and jewellery industry specially, as America is its largest market, worth over $10 billion driving almost 30 per cent of the industry’s entire global trade. Exports to America could drop by more than 50 per cent since these tariffs are put in effect, risking both revenues and jobs in major manufacturing clusters.\nA comprehensive urgent policy drive can mitigate the tariff shocks confronting India’s gems and jewellery sector, safeguard jobs and maintain its world leadership. USA tariff headwinds has threatened the Indian natural diamond, gold jewellery, and lab-grown segment demand, although collective reforms can dilute the effect and open up new growth. India is at a juncture to become a world, innovation-driven export destination, but there has to be immediate and definitive reforms to upheld this position. Some of the reforms and actions required are :\n* The labour laws need to be made simpler in order to ensure compliance, contract transparency, and better worker welfare which is the key to enhanced productivity and investments.\n* The pending amendment to the SEZ Act should be notified forthwith to make SEZ units survive and remain competitive especially reverse job work.\n* For e-commerce , India has to compete with international centres such as Dubai and Hong Kong on cost and speed so by lowering logistics compliance and streamlining payments modalities, returns, and freight rules.\n* GST should be simplified with one-stage model to lower compliance costs and blockage of working capital, particularly for exporters on input credits.\n* On the same lines, income tax policies have to be export-oriented with lower rates, simplified transfer pricing laws, and time-bound resolution of disputes. Also Quick refunds are critical for liquidity and competitiveness.\nInterest subvention on export credit, pre- and post-shipment needs to be assured for a minimum of five years to safeguard employment and assist MSMEs in handling the demand cycles.\n* Strategic BTAs with China, Brazil, South Africa, and the EU need to be expedited, emphasizing predictable rules of origin, reduced non-tariff barriers, and safeguards for high-value segments such as certified diamonds and branded jewellery.\n* Key sectors like diamond cutting, gold jewellery, synthetic gemstones, and parts need to be facilitated by finance access, traceability standards, and compliance with international trade regulations . This would stabilise orders and promote investment.\nIt is extremely important for India to position itself as a dependable, price-competitive, and policy-stable world export leader. These reforms if put to action can reduce the impact of Trade tariffs on the Indian Gems and Jewellery industry.”\nAugust 28, 2025 13:29\nStock market live updates today: Sensex, Nifty extend losses as US tariff impact weighs on export stocks\nBenchmark indices remained under pressure during midday trading on Thursday, with the Sensex down 446.01 points or 0.55 per cent at 80,340.53 and the Nifty 50 declining 120.90 points or 0.49 per cent to 24,591.15 as of 12.30 pm. The markets opened lower at 80,754.66 for the Sensex from the previous close of 80,786.54.\nSensex, Nifty extend losses as US tariff impact weighs on export stocks \nBenchmark indices remained under pressure during midday trading on Thursday, with the Sensex down 446.01 points or 0.55% at 80,340.53 and the Nifty 50 declining 120.90 points or 0.49% to 24,591.15 as of 12.30 pm.\nAugust 28, 2025 13:27\nStock market live updates today: Seamec Ltd’s vessel “SEAMEC SWORDFISH” off-hired due to breakdown, which is being rectified. Upon rectification of the defect, the vessel will go back on charter\nAugust 28, 2025 13:27\nStock market live updates today: Manorama Industries board approves execution of MoU with National Office for Major Projects of Burkina Faso; stock down on NSE\nManorama Industries board approves execution of MoU with the National Office for Major Projects of Burkina Faso (The Government of Burkina Faso) for a new factory focused on the processing plants of Shea Nuts & Mango Kernels. \nManorama Industries stock down 1.45% on the NSE to ₹1,352.\nAugust 28, 2025 13:22\nStock market live updates today: Sampre Nutritions enters manufacturing agreement with Tolaram Wellness Ltd for nutraceutical and food products\nAugust 28, 2025 13:22\nStock market live news: Schneider Electric Infrastructure board appoints Omkar Prasad as Chief Financial Officer w.e.f September 16, following the resignation of Suparna Banerjee Bhattacharyya\nAugust 28, 2025 13:21\nStock market live updates today: TVS Motor Company launches new electric offering, TVS Orbiter, at ₹99,900; shares flat on NSE\nTVS Motor Company (TVSM) launches its new electric offering, TVS Orbiter. Designed for everyday commutes, the TVS Orbiter combines several segment-first features such as a 158 km IDC range, cruise control, 34-litre boot space, hill hold assist, and advanced connected features. With an industry-first 14” front wheel, the scooter delivers unmatched comfort, convenience, and performance, at an attractive price of ₹99,900 (ex-showroom, inclusive of PM e-Drive scheme, Bengaluru).\nShares flat at ₹3,274.80 on the NSE.\nAugust 28, 2025 13:19\nStock market live news: United Breweries trades flat at ₹1,852.50 on NSE after opening at ₹1,891.50, against previous close of ₹1,853.80. Board approves ₹90-crore investment in its Telangana brewery\nAugust 28, 2025 13:16\nStock market live news: SBI Cards stock trades at ₹801.15 on NSE after opening at ₹809.65, against previous close of ₹815.70. Company and Flipkart have together launched ‘Flipkart SBI Credit Card’\nAugust 28, 2025 13:15\nStock market live updates today: Biocon shares flat on NSE; Biocon Pharma, a wholly-owned arm of Biocon, gets tentative USFDA approval for its ANDA for Sitagliptin Tablets USP\nBiocon shares flat on NSE at ₹359.30. Biocon Pharma Ltd, a wholly-owned arm of Biocon, receives tentative approval from US Food and Drug Administration for its ANDA for Sitagliptin Tablets USP, in 25 mg, 50 mg and 100 mg strengths.\nAugust 28, 2025 13:12\nStock market live updates today: Renisha Chainani, Head of Research at Augmont, on gold price movement\nAmid worries about the independence of the Federal Reserve following President Trump’s threats to fire Fed Governor Lisa Cook, gold prices remained close to their two-week high due to their safety appeal.\n· At the Fed’s policy meeting next month, markets are expecting a 25 basis point rate cut, which is more than 88% likely, according to the CME FedWatch Tool.\n· Markets seem to be confident that a new wave of U.S. tariffs might weaken global strength, making trade policy another crucial factor for gold. An additional factor supporting gold’s safe-haven bid could be ongoing geopolitical danger, such as Ukraine’s increased attacks on Russian energy infrastructure.\nTechnical Triggers\n· Gold Oct Futures are expected to continue their upside momentum towards $3485 (~Rs 102,500), if it sustains above $3445 (~Rs 101,500).\n· As Silver Sep Futures has broken its range and sustained above $38.80 (~Rs 116,000), upside momentum can swing prices towards a new high of $40 (~Rs 120,000) this week.\nAugust 28, 2025 13:11\nStock market live updates today: IndiGo Share Price LIVE: Gangwal family stake sale drags IndiGo shares by 5%\nHere’s what Nitant Darekar Research Analyst of Bonanza says on IndiGo stock following the block deal \nAugust 28, 2025 13:10\nStock market live updates today: Acme Solar Holdings stock rose 1.5% to ₹289.95, hitting an intraday high of ₹291.85. The board approves proposal to raise ₹3,000 crore in multiple tranches\nAugust 28, 2025 13:09\nStock market live updates today: Jaiprakash Power Ventures stock locked in upper circuit on NSE at ₹18.95, up 5%. It had announced plans to set up a ₹300-crore solar power project in Madhya Pradesh\nAugust 28, 2025 13:08\nStock market live news: HCLTech in tie-up with Pearson India and strategic advisory of MeitY Startup Hub, today launched ARISE FOR YOU, an initiative to ignite the entrepreneurial spirit of youth\nAugust 28, 2025 13:06\nStock market live updates today: Acme Solar Holdings stock rises 1.5% to ₹289.95, hitting intraday high of ₹291.85. Board approves proposal to raise ₹3,000 crore in multiple tranches\nAugust 28, 2025 13:05\nStock market live news: PFC shares flat on NSE at ₹385.85. Company inks performance evaluation pact with Power Ministry for annual target framework against which its FY26 achievement will be assessed\nAugust 28, 2025 13:04\nStock market live updates today: Ola Electric shares zoom 8% on the NSE to ₹54.80\nAugust 28, 2025 13:03\nStock market live updates today: IPO News Live Today: Mangal Electrical shares down to ₹545 level, Vikran Engineering IPO subscribed 3.91 times so far on Day 2, Anlon Healthcare booked 2.52 times\nMangal Electrical IPO listing today live, Vikran Engineering & Anlon Healthcare enters Day 2, Globtier Infotech, NIS Management IPO news live updates today: \nAugust 28, 2025 13:02\nStock market live updates today: PVP Ventures board approves acquisition of majority stake in 7Med India; stock down on NSE\nPVP Ventures board approves proposal for acquisition of a majority stake in 7Med India Pvt. Ltd, a healthcare enterprise headquartered in the Delhi NCR region.\nThe transaction will be a combination of both primary and secondary stake purchase amounting to an outlay of circa ₹127 crore for this majority shareholding.\nPVP Ventures stock traded at ₹20.35 on the NSE, down 2.77%.\nAugust 28, 2025 13:00\nStock market live updates today: Power & Instrumentation (Gujarat) bags ₹9.50-crore work order from Sadashiv Projects; shares edge down on NSE\nPower & Instrumentation (Gujarat) has received a work order for ₹9.50 crore from Sadashiv Projects India Private Ltd for Design, Engineering, Supply, Testing for 5.00 MWP Solar Ground Mounted, Including Material Supplies & Services, at locations in Gujarat\nPower & Instrumentation (Gujarat) shares traded at ₹147.05 on the NSE., down 1.97%.\nAugust 28, 2025 12:57\nStock market live updates today: Dr. Agarwal’s Health Care and Dr. Agarwal’s Eye Hospital announce merger; shares of both companies drop sharply\nDr. Agarwal’s Health Care (AHCL) and Dr. Agarwal’s Eye Hospital (AEHL) have announced their merger. \nA stock exchange filing said the merged entity inter-alia brings together significant complementarities that exist between both the entities and is poised to create meaningful value for various stakeholders, including respective patients, employees, and shareholders of both entities. The merger will consolidate the businesses of AHCL and AEHL into a single entity, enabling operational and financial efficiencies through streamlined functions and agile decision-making.\nDr. Agarwal’s Eye Hospital stock fell 12.35% on the BSE to ₹4,510.\nDr. Agarwal’s Health Care stock declined 5.38% to ₹434.90.\nAugust 28, 2025 12:54\nStock market live updates today: HDFC Bank allots bonus issue in the ratio of 1:1\nAugust 28, 2025 12:53\nStock market live updates today: 6 MW solar power plant fully operational at Andhra Cement’s manufacturing plant in Palnadu district of Andhra Pradesh; stock gains on NSE\nAndhra Cements said the implementation of a 6 MW Solar Power Plant has been successfully completed and is now fully operational at the company’s cement manufacturing plant at Gamalapadu village in Palnadu district of Andhra Pradesh as part of Green Energy initiative.\nAndhra Cements stock rose 2% on the NSE to 90.58\nAugust 28, 2025 12:50\nStock market live updates today: Ramco Systems to implement its aviation software at United Aerospace Maintenance Company, a provider of aircraft maintenance, repair and overhaul services.\nAugust 28, 2025 12:49\nStock market live updates today: Power Mech Projects secures ₹370.84-crore order from Mahan Energen, a subsidiary of Adani Power; shares down on NSE\nPower Mech Projects has secured a ₹370.84-crore order from Mahan Energen Ltd (MEL), one of the subsidiaries of Adani Power Ltd, for execution of civil works and erection of Prefabricated Structural Steel for BTG Unit 1 & 2 for Mahan Phase-III (2 x 800 MW), Mahan Energen Limited, Singrauli, Madhya Pradesh.\nPower Mech shares down 1.80% to ₹3,074 on the NSE\nAugust 28, 2025 12:29\nStock market live updates today: SAMHI Hotels signs lease deal for 260-room hotel in Hyderabad Financial District\nSAMHI Hotels Limited has signed an Agreement to Lease with Aurean Eskar and other lessors for a 260-room mid-scale hotel in Hyderabad’s Financial District. The hotel will be developed as part of a mixed-use project, with SAMHI’s estimated development cost ranging from ₹12.5 crore to ₹14.3 crore for fitouts and branding.\nSAMHI Hotels signs lease deal for 260-room hotel in Hyderabad Financial District \nSAMHI Hotels signs lease agreement for 260-room hotel in Hyderabad's Financial District, expanding presence in the market.\nAugust 28, 2025 12:28\nStock market live updates today: Auto stocks in focus on GST cut hopes despite tepid festival sales\nTata Motors shares fell 1.32 per cent to ₹672.65 on Wednesday as investors weighed mixed signals from the automotive sector amid speculation about potential goods and services tax (GST) cuts.\nAuto stocks in focus on GST cut hopes despite tepid festival sales \nTata Motors shares drop amid speculation of GST cuts, with Jefferies maintaining underperform rating and raising target price.\nAugust 28, 2025 12:27\nStock market live updates today: Piccadily Agro hits record single malt sales milestone\nPiccadily Agro Industries Limited shares traded at ₹591.50, down 0.73 per cent from Tuesday’s close of ₹595.85, despite announcing record-breaking sales figures for its flagship Indri single malt whisky brand.\nPiccadily Agro hits record single malt sales milestone \nPiccadily Agro Industries Limited stock price drops despite record-breaking sales for Indri single malt whisky brand.\nAugust 28, 2025 12:26\nStock market live updates today: TCS shares dip 1.18%, announces new Philippines pharma deal\nTata Consultancy Services (TCS) shares traded at ₹3,120 at 11:50 AM on Thursday, down 1.18 per cent from the previous close of ₹3,157.20, The company announced a strategic partnership with Philippines pharmaceutical major Unilab Inc.\nTCS shares down 1.18%, new Philippines pharma deal declared\nTata Consultancy Services shares traded at ₹3,120 at 11.50 AM on Thursday, down 1.18%. The company announced a strategic partnership with Philippines pharmaceutical major Unilab Inc.\nAugust 28, 2025 11:40\nStock market live updates today: Mangal Electrical shares trade at ₹550 level after muted debut\nShares of Mangal Electrical Industries Ltd made a muted debut on bourses, listing at a discount against the issue price of ₹561.\nMangal Electrical shares trade at ₹550 level after muted debut, lists below issue price of 561\nShares of Mangal Electrical Industries Ltd made a muted debut on bourses, listing at a discount against the issue price of ₹561.\nAugust 28, 2025 11:39\nStock market live updates today: IndiGo Share Price LIVE: Shares down over 4% after Gangwal family’s block deal\nTrack IndiGo share price movements live here\nAugust 28, 2025 11:34\nStock market live updates today: Commodity call. Copper: Range bound and unclear; wait for bearish breakdown to go short\nCopper prices are stuck in a sideways range for almost three months now. The Copper Futures contract traded on the Multi Commodity Exchange (MCX) has been oscillating between ₹860 and ₹906 per kg since the second week of June this year. Indeed, the range has narrowed down to ₹868 and ₹895 since the beginning of this month. Within this range, the contract is currently trading at ₹885 per kg.\nCopper: Range bound and unclear; wait for bearish breakdown to go short\nMCX Copper Futures contract has been oscillating between ₹860 and ₹906 per kg\nAugust 28, 2025 11:33\nStock market live updates today: Merchant association seeks EMI facility for gold jewellery purchase to boost retail biz\nThe All Kerala Gold & Silver Merchants Association has requested the Union Finance Ministry to enable EMI facility for gold jewellery purchase. This would empower middle-income households to plan their purchases and boost overall retail growth. they stated.\nMerchant association seeks EMI facility for gold jewellery purchase to boost retail biz\nAll Kerala Gold & Silver Merchants Association seeks EMI facility for gold purchases to boost retail growth and accessibility.\nAugust 28, 2025 11:19\nStock market live updates today: Adani Group portfolio companies’ EBITDA crosses ₹90,000 cr milestone for first time\nAnnouncing the financial performance of the companies in its portfolio, the Adani Group on Thursday said the EBITDA (short for earnings before interest, taxes, depreciation and amortization) for the companies crossed the ₹90,000 crore milestone on a Trailing-Twelve-Month (TTM) basis for the first time with the first quarter EBITDA for FY2026 reaching a record high. \nAdani Group portfolio EBITDA crosses ₹90,000 cr milestone for first time\nThe Adani Group on Thursday said the EBITDA for the companies crossed the Rs 90000 crore milestone for first time with first quarter EBITDA for FY 2026.\nAugust 28, 2025 11:11\nStock market live updates: Mahindra Holidays has appointed Vineet Bhardwaj as the Chief Technology Officer of the Company with effect from September 01, 2025.\nAugust 28, 2025 11:11\nShare market live news: TCS announces partnership with Unilab Inc.\nTata Consultancy Services (TCS) announced a partnership with Unilab, Inc., a leading pharmaceutical and healthcare company in the Philippines, to modernise its core business systems through a strategic cloud migration.\nShares dip 0.94% on the NSE to ₹3,127.60.\nAugust 28, 2025 11:10\nStock market live updates: Cipla trades flat on the NSE at ₹1,581.80\nCompany is recalling over 20,000 packs of a medication, used to treat asthma and certain types of chronic obstructive pulmonary disease in the US, according to the US health regulator.\nAugust 28, 2025 10:52\nStock market live updates today: Nifty Bank Prediction Today – August 28, 2025: Nifty Bank futures: Index might see a corrective rally\nNifty Bank index opened today’s session lower at 54,256 compared to Tuesday’s close of 54,450. It slipped further after opening and is currently hovering around 54,100, down 0.6 per cent.\nNifty Bank Prediction Today – August 28, 2025: Nifty Bank futures: Index might see a corrective rally\nNifty Bank index opened today’s session lower at 54,256 compared to Tuesday’s close of 54,450. It slipped further after opening and is currently hovering around 54,100, down 0.6 per cent.\nAugust 28, 2025 10:52\nStock market live updates today: RateGain and Profitroom in strategic partnership to strengthen MEA Hotels distribution capabilities; RateGain shares rise nearly 2% on the NSE to ₹521.85\nAugust 28, 2025 10:51\nStock market live updates today: Dr Reddy’s Labs trades flat on NSE; the company has has received an interim stay on tax reassessment proceedings related to its merger with Dr. Reddy’s Holding\nDr Reddy’s Laboratories traded flat on the NSE at ₹1,253.70. It had received an interim stay from the Telangana High Court on income tax reassessment proceedings related to its merger with Dr. Reddy’s Holding Ltd. Dr Reddy’s Laboratories on Saturday said it had received a show cause notice from the income tax authority, with a proposed demand of over ₹2,395 crore related to the merger of Dr Reddy’s Holding Ltd (DRHL) with itself.\nAugust 28, 2025 10:49\nStock market live updates today: BSE shares traded flat on the NSE at ₹2,220.30. BSE Ltd arms, BSE Investments & BSE Administration and Supervision, to merge with BSE Technologies\nAugust 28, 2025 10:45\nStock market live updates today: Nifty Prediction Today – August 28, 2025: Nifty 50 Futures: Breaks a key support. Go short now and on a rise\nNifty 50 continues to get beaten down. The index has declined further and is currently trading at 24,590, down 0.49 per cent. The advances/declines ratio is at 17:33. This is clearly negative and indicates the danger of seeing more fall.\nNifty Prediction Today – August 28, 2025: Nifty 50 Futures: Breaks a key support. Go short now and on a rise\nNifty 50 continues to get beaten down. The index has declined further and is currently trading at 24,590, down 0.49 per cent. The advances/declines ratio is at 17:33. This is clearly negative and indicates the danger of seeing more fall.\nAugust 28, 2025 10:44\nStock market live updates today: Sundararaman Ramamurthy, MD & CEO, BSE, on the impact of the US tariff\n“India has successfully weathered past global shocks, from COVID-19 to supply chain disruptions, and continues to stand resilient as the world’s fourth-largest economy. The recent U.S. tariff hikes are expected to have minimal impact, with most Indian trade safeguarded by diversification and key exemptions in areas like pharmaceuticals, smartphones, electronics, and renewable energy. Strong domestic demand, ‘Make in India’ initiatives, and fresh trade agreements are reinforcing investor confidence, while rising household and institutional participation keeps India’s capital markets attractive. The country’s robust fundamentals and policy measures will ensure that FPI and FDI inflows remain steady, limiting any long-term effect from the tariff move. These strengths together underpin India’s journey towards Viksit Bharat by 2047, strengthening its position as a global economic leader.”\nAugust 28, 2025 10:43\nStock market live updates today: Valiant Communications board to consider bonus issue on September 3\nAugust 28, 2025 10:43\nStock market live updates today: ATV Projects India inks Memorandum of Understanding along with the Term sheet with Shri Vrinda Infracon to develop unutilised land at ATV Nagar Mathura\nAugust 28, 2025 10:41\nStock market live updates today: Textile stocks in focus: Welspun Living (-1.12%), Gokaldas Exports (+0.52%), Arvind (-1.06%), KPR Mill (-0.42%)\nAugust 28, 2025 10:29\nStock market live updates today: Rakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr; shares fall over 4%\nInterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for ₹7,027.7 crore through separate block deals on Thursday.\nRakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr; shares fall over 4%\nInterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for ₹7,027.7 crore through separate block deals on Thursday.\nAugust 28, 2025 10:28\nStock market live updates today: IPO News Live Today: Mangal Electrical makes muted debut at ₹556 on NSE, Vikran Engineering & Anlon Healthcare enter Day 2\nTrack post listing price movements of Mangal Electrical live here\nAugust 28, 2025 10:27\nStock market live updates today: Mangal Electrical Industries stock traded near ₹559 level after listing at ₹556 on the NSE, down 0.89% the IPO-price of ₹561. On the BSE, the stock debuted at ₹558\nAugust 28, 2025 10:23\nStock market live updates today: Crude oil futures fall as markets weigh US tariffs on India\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22\nCrude oil futures fall as markets weigh US tariffs on India\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22.\nAugust 28, 2025 10:23\nStock market live updates today: Markets open lower as 50% US tariffs on Indian goods take effect\nMarkets opened in negative territory on Thursday morning as the 50 per cent US tariff on Indian goods came into effect, with the Nifty 50 starting at 24,711.50 from its previous close of 24,712.05 and trading at 24,586.80, down 125.25 points or 0.51 per cent, at 9.55 am. The Sensex opened at 80,754.66 against its previous close of 80,786.54 and was at 80,378.10, lower by 408.44 points or 0.51 per cent, at the same time.\nMarkets open lower as 50% US tariffs on Indian goods take effect \nMarkets open negatively as US tariffs on Indian goods take effect, with sectors facing pressure and certain stocks showing resilience.\nAugust 28, 2025 10:22\nStock market live updates today: Rupee rises 10 paise to 87.59 against US dollar in early trade\nThe rupee rose 10 paise to 87.59 against the US dollar in early trade on Thursday, supported by a weaker dollar index and easing Brent crude prices.\nRupee rises 10 paise to 87.59 against US dollar in early trade\nRupee strengthens against US dollar due to weaker dollar index, easing Brent crude prices, RBI intervention, and FII outflows.\nAugust 28, 2025 10:02\nStock market live updates today: InterGlobe Aviation shares are down 4% on the NSE to ₹5,787 following block deal.\nAugust 28, 2025 09:35\nStock market live updates today: Brokerage view\nJefferies on Auto Sector\nA potential GST cut should provide a boost to auto demand, especially in 2Ws and small PVs\nRaise FY26-28E 2W & PV industry volumes by 2-6%, driving 2-8% EPS upgrades for TVSL, HMCL, MSIL and HYUNDAI\nExpect TVSL & MM to deliver highest 27% & 19% FY25-28E EPS CAGR respectively\nHero Moto - Upgrade to Hold from Underperform; Hike TP to Rs 5,200 from Rs 3,800\nTVS Motor - Maintain Buy; Hike TP to Rs 4,250 from Rs 3,500\nMaruti - Maintain Buy; Hike TP to Rs 17,500 from Rs 14,750\nHyundai - Maintain Underperform; Hike TP to Rs 2,000 from Rs 1,700\nBajaj Auto - Maintain Hold; Hike TP to Rs 9,000 from Rs 8,000\nEicher - Maintain Buy; Hike TP to Rs 6,925 from Rs 6,500\nM&M - Maintain Buy; Hike TP to Rs 4,200 from Rs 4,000\nTata Motors - Maintain Underperform; Hike TP to Rs 575 from Rs 550\nAshok Leyland - Maintain Hold with TP of Rs 120\nNuvama on Maruti\nTarget price - Rs 14300 (maintain Buy)\nMSIL’s first EV: eVitara production kicks off\nSMG plant capacity of 0.75mn is being expanded to 1mn in FY27E with the new line being fungible across powertrains\neVitara is being rolled out at SMG at investment of Rs 2,200cr, and shall be sold in 100-plus countries including Europe, Japan and India\nProduction planned at 70,000-plus units in the first 12 months\nSuzuki group company TDSG has invested Rs 4,270cr, and has capacity of 18mn cells for hybrids, which is being expanded to 30mn cells\nElara Securities | Auto Dealer Checks (Ganesh Chaturthi Day 1)\n2W: Low-single digit growth YoY; postponements in many regions on GST cut hopes\nRural: GST impact awareness low → steady buying continues\nRoyal Enfield: Outperformed (low base + GST confusion benefit)\nPV: More postponements (big-ticket buyers more sensitive to GST news)\nElara: Even small growth for 2W is a positive signal\nMacquarie on Telecom Sector\nReliance Jio’s pivot to ‘value over volume’ drives a stronger EBITDA growth outlook relative to Bharti\nEBITDA growth driven by ARPU improvements in stealth and operating leverage; Jio > Bharti\nCapex intensity to moderate for both Jio, Bharti; VI spend requires external financing\nROIC improvement highest for Tata Comm\nBharti Hexacom – Maintain Underperform; Cut TP to Rs 1,380 from Rs 1,480\nVodafone Idea – Maintain Underperform; Cut TP to Rs 5 from Rs 6.5\nReliance - Maintain Outperform; Hike TP to Rs 1,650 from Rs 1,580\nAirtel - Maintain Outperform with TP of Rs 2,050\nTata Communications - Maintain Outperform with TP of Rs 2,210\nIndus Towers – Maintain Underperform with TP of Rs 300\nAvendus on Aluminium\nTariff led Metal fever to break & Scrap market tightness to deepen –Dual headwinds\nPotential decline in metal price & recycling margins are 2 key risks\nReiterate -ve stance\n1)Hindalco- SELL; TP Rs 615; at CMP stk fully prices in continuation of superior margins in India ops & margin reversal in Novelis to$500/tn (vs$430/tn in Q1’26) Benefits of BayMinette expansion is atleast 15M away\nb) Nalco- REDUCE; TP Rs 185)– metal price decline to weigh on earnings trajectory; attach low probability of meaningful recovery in Alumina prices led by rising global supply\nMS on NBFCs\nSince March 2025, have been flagging downside risks to consensus estimates\nThis has started playing out visibly in 1QF26 results\nThink investors should stay selective and look for margin of safety\nIn large caps, are OW on BAF, PFC, REC, SHMF and Muthoot & EW on Chola\nIn small / mid-caps, OW on Aptus, Home First, AB Cap and Can Fin Homes\nRetained OW on PNBHF on fundamentals; however, uncertain outlook is likely to weigh on stock in near term\nJPM on OMCs\nStocks are cheap on FY27 earnings projections that build in a http://c.Rs.3-4 per liter increase in petrol/diesel excise duties (lower OMC margins).\nThere should be little downside even if taxes on these companies are raised.\nHowever, longer Gov’t stays away, more cash flow these cos accrue.\nThis should help drive stocks up near term; Prefer BPCL\nCLSA on OMCs\nBenefit from Russian oil imports way less than exaggerated media numbers\nIndia gets 36% of oil imports from Russia, which supplies c.5% of global demand\nOil prices could rise to US$90-100/bbl if India stops importing Russian oil\nBelieve issue of Russian crude oil imports has now become a political one with India reiterating its freedom to choose its trade partners within purview of global trade rules\nHSBC On OMCs\nGiven lower oil prices and reduced LPG losses, expect strong earnings; any pay-outs for under-recoveries a positive\n1Q earnings lower than estimated due to higher inventory losses; marketing margins strong, while LPG losses reduced\nMaintain Buy ratings on BPCL – TP Rs 420, HPCL – TP Rs 520, & IOC – TP Rs 190\nAntique on Textiles\nHigher tariffs to impact US textile exports\nEnforcement of reciprocal tariffs will lead to potential tariff burden of ~62%-65% on textile and apparel exports\nLower tariffs on competing countries-China (30%), Bangladesh (20%), Pakistan (19%), and Vietnam (20%)\nIndia at a relative disadvantage to key competitors\nWe expect Indian exports to remain impacted unless the country concludes a trade deal with the US\nArvind and Welspun Living have US exposure of 38% and 60% respectively\nWe downgrade Arvind to Hold with a revised target price of Rs 330 (previously Rs 453)\nContinue to maintain Hold on Welspun Living, target price Rs 132 (vs Rs 155 earlier) and KPR Rs 1,055\nMOSL on Adani Ports\nRecommendation Buy\nTarget Price ₹1,700\nCharting a transformational journey\nBuilding scale and market leadership in ports\nLogistics business - growing exponentially\nMarine services: A fast-growing, capital-efficient growth engine\nMorgan Stanley on Real Estate\nResidential Sales Robust in July\nPropequity data shows good sales growth, despite fewer new launches, leading to a slight dip in inventory\nPrice growth moderated vs. last two quarters but stayed strong\nMumbai and Bangalore were stronger than other cities\nJefferies on ICICI Bank\nRecommendation Buy\nTarget Price ₹1,760\nFY25 annual report and 20F show that risk profile of assets has risen\nSee a rise in share of lower-rated loans (SME) & RWA/ assets, but quality has held up and credit costs stay low\nNPLs highest in 5 years\nPSL is improving and will limit drag from compliance cost\nJefferies on Polycab\nBuy, TP Rs 8180\nOver past 12 qtrs, Co has consistently delivered double-digit C&W sales growth, with steady 12-15% EBIT margin\nDiverse sales stream (B2G (eg: power, mobility) est 30%; B2B private capex: 35%; Housing 20%, Exports 6%; FMEG 10%), market share gains (27% now; +10% in 5Y), power capex, FMEG margin turnaround & strong order books in RDSS & Bharat Net are key drivers\nEst FY25-28e EPS CAGR at +26%; FY27e PE now at 32x, inline with its hist 5Y avg\nJefferies on Consumer Fin\nFor Jul-25, industry credit card spending growth moderated MoM to 12% YoY (15%, Jun-25), lowest since Mar-25; card vol growth was stable at 7% YoY\nSBI Cards, spending grew 21% YoY (stable MoM) & its spending market share was steady at 17%\nIts card volume growth was steady at 10% YoY as it stays cautious towards new card additions.\nAmong key players, spending share of ICICI rose MoM, while that of HDFCB and Axis fell slightly MoM\nRetain Hold on SBI Cards\nInvestec on RBL BK\nBuy, TP Rs 300\nNDR Takeaways\nManagement highlighted RoA should trend upwards to 1% by Q4, primarily aided by normalisation of NIMs (which at 4.5% in 1Q have largely bottomed unless there are further repo rate cuts, per management)\nBank expects loan growth in FY26 to trend 3-4ppts higher than industry (ie 13-14%)\nOn asset quality, it sees trends in both MFI & cards (85% of net slippages) improving through course of year (< 2% FY26 credit cost guidance vs 1.9% in 1Q)\nOn capital front (CET1 at 14%), bank will be taking an enabling board resolution for potential raise in FY26 – it intends to improve RoA delivery 1st before any potential dilution\nMOSL On Coforge\nBuy, TP Rs 2240\nManagement meet key takeaways\nCo highlighted that while industry-wide demand remains mixed, budgets are opening up for vendors that can deliver outcome-driven solutions\nCoforge aiming to sign at least 20 deals above $20m in FY26 (five done so far)\nCo ’s FY26 EBIT margin guidance stands at 14%\nManagement also expects cash flow conversion to improve meaningfully going fwd\nSBI Research on Tariffs\nUS imposes 50% tariff on ~$45 Bn of Indian exports\nSectors hit most: Textiles, gems & jewellery, seafood; pharma & smartphones exempt\nWorst scenario India’s trade surplus will convert to trade deficit\nHowever, we believe trade negotiations will restore confidence and improve export to US\nTextiles impact: With 50% tariff, India loses competitiveness vs China (30%), Vietnam (20%), Indonesia (19%), Japan (15%)\nGems & jewellery: $10 Bn exports hit; US = ~⅓rd of sector’s $28.5 Bn shipments\nSeafood (esp. shrimp): Over half exports to US, now face cancellations, rivals (Ecuador) benefit\nWe believe that US tariffs is likely to affect US GDP by 40-50 bps and higher input cost inflation\nAugust 28, 2025 09:34\nStock market live updates today: Top gainers and losers on Nifty 50\nTop gainers: Hero Motocorp (+1.51%), Eternal (+1.05%), Asian Paints (+0.63%), Eicher Motors (+0.55%), HUL (+0.42%)\nTop losers: HCL Tech (-2.12%), Shriram Finance (-2.02%), HDFC Bank (-1.80%), Jio Financial (-1.38%), Power Grid (-1.32%)\nAugust 28, 2025 09:34\nStock market live updates today: Highway Infrastructure Ltd launches project under the name ‘Neww York City – Phase-4’ Opposite SAGE University, Indore; shares down on NSE\nAugust 28, 2025 09:32\nStock market live updates today: Power Grid Corporation declared bidder under tariff-based bidding for Inter-State Transmission System; shares down on NSE\nPower Grid Corporation of India has been declared as bidder under tariff-based competitive bidding to establish an Inter-State Transmission System for a project for “Transmission system strengthening at Davanagere for Integration of RE generation” under Build, Own, Operate and Transfer (BOOT) basis.\nPower Grid Corporation of India shares down 1% to ₹276.90 on the NSE.\nAugust 28, 2025 09:29\nStock market live news: Shilpa Medicare arms inks pact with Pharma Pharmaceutical Industries & Biological Products for joint venture pharma facility in Saudi Arabia; Shilpa Medicare shares up\nKoanna International FZ LLC, UAE (‘Koanna), a wholly-owned subsidiary of Shilpa Medicare Ltd, has entered into a definitive agreement with Pharma Pharmaceutical Industries & Biological Products (PPI), a prominent Saudi enterprise, to form a new joint venture company based in Saudi Arabia to build a new pharma manufacturing facility in Saudi Arabia.\nShilpa Medicare shares up 1% on the NSE to ₹825.\nAugust 28, 2025 09:24\nStock market live updates today: SAMHI Hotels, through wholly-owned arm, inks lease agreement for mid-scale hotel in Hyderabad’s financial district; shares flat on NSE\nSAMHI Hotels, through its wholly-owned subsidiary Barque Hotels Private Ltd, announced the signing of an Agreement to Lease (“ATL”) with Mrs. P Pramoda, Mrs. P Harika, and Aurean Eskar (collectively the “Lessors”) for a ~260-room Mid-scale hotel to be developed as part of a mixed-use project in Hyderabad’s financial district. \nShares flat on the NSE at ₹208.19\nAugust 28, 2025 09:22\nStock market live: Sensex tanked 483.82 points or 0.60% to 80,302.72 at 9.17 am, after opening flat at 80,754.66 against previous close of 80,786.54. Nifty 50 fell 118.10 points (0.48%) to 24,593.95\nAugust 28, 2025 09:17\nStock market live updates today: Crude oil futures trade lower\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22. At 9.13 am on Thursday, November Brent oil futures were at $66.97, down by 0.36 per cent, and October crude oil futures on WTI (West Texas Intermediate) were at $63.63, down by 0.81 per cent. September crude oil futures were trading at ₹5584 on Multi Commodity Exchange (MCX) during the initial hour of trading on Thursday against the previous close of ₹5618, down by 0.61 per cent, and October futures were trading at ₹5555 against the previous close of ₹5589, down by 0.61 per cent.\nAugust 28, 2025 09:17\nStock market live updates today: Import duty exemption on cotton extended till December 31, 2025\nNews Update: Government extends import duty exemption on cotton (HS 5201) till December 31, 2025. Exemption was earlier valid from August 19 to September 30, now extended till year-end. (Decision important for textile and yarn companies)\nShilp Medi Arm in JV agmt with Pharma Pharmaceutical Industries & Biological Products, Saudi to build a new pharma manufacturing facility in Saudi Arabia (Supportive for stock prices)\nAugust 28, 2025 09:04\nStock market live updates today: Global bits\nUnited States (US): Stocks hit record highs, Powell pivot in focus, tariffs on India weighing on trade, housing demand weak, yields volatile as Trump targets Fed.\nIndia: Growth likely slowed to 6.7% in Apr–Jun; hit by steep US tariff hikes on exports; gold demand resilient.\nChina: Stocks at decade high with strong hedge fund inflows; industrial profits continue to decline; solar sector faces heavy losses.\nSouth Korea: Central bank holds rates citing debt risks; export growth threatened by US tariffs; seeks non-binding US trade deal.\nJapan: Government drafts record debt-servicing budget; remains alarmed over yen volatility; high debt costs a concern; seafood inflation worsens with warming seas.\nHong Kong: July home prices edge up 0.4% m/m; Meituan profit slips under fierce competition.\nAustralia: Inflation tops forecasts due to power prices; RBA signals more rate cuts ahead.\nCanada: Central bank rules out review of 2% inflation target next year.\nGermany: Consumer sentiment dips on job fears; exports hit by US tariffs; industry sheds 250k jobs; business sentiment improves despite downturn.\nUK: Retail downturn extends to 11 months; shop prices rise sharply; producer inflation at 2-year high.\nRussia: Gazprom Neft profit falls 54% amid weak energy markets.\nSingapore: Core inflation up 0.5% y/y in July, below expectations.\nMiddle East (Dubai): Gold demand rises as prices hit two-week high on Fed tensions.\nSource: Reuters\nAugust 28, 2025 09:04\nStock market live updates today: NVIDIA\n- Adj EPS $1.05 (est $1.01)\n- Rev. $46.7B (est $46.23B)\n- Data Center Revenue $41.1B (est $41.29B)\n- Gaming REV. $4.3B (est $3.82B)\n- Sees Q3 Revenue $54B Plus Or Minus 2% (est $53.46B)\n- Approves Additional $60B To Share Buyback\n- Has Not Assumed Any H20 Shipments To China In Outlook\n- No H20 Sales To China-Based Customers In Q2\n(Numbers and guidance seen in line with the estimates)\nAugust 28, 2025 09:03\nStock market live updates today: Nvidia beat earnings, again, but the stock was down 4%.\n■Sales hit $46.7B (up 56% YoY)\n■EPS: $1.05 vs $1.01 est\n■Data center missed slightly at $41.1B\n■Networking flat at $5.1B\nFor next quarter, Nvidia is guiding for $54B in sales and 74% margins. They also approved a $60B buyback.\nhttps://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-second-quarter-fiscal-2026\nAugust 28, 2025 09:03\nStock market live updates today: Macro and market update\nIndia - States’ capex likely rose 19% in April-July\nStates’ capex grew 19% YoY in April-July FY26 (30% Apr-June) to Rs 1.36 lakh crore, aided by Centre’s interest-free loans, though July saw moderation due to monsoon. States maintained their revenue expenditure at a comparable level. They reported an 11% increase in revenue expenditure in April-July 2025 at Rs 11.43 lakh crore.\nPrices of pulses rule below MSP amid cheap imports\nPulses prices in mandis are ruling below MSP as cheap imports from Myanmar, Mozambique, Tanzania and Canada flood the market. Traders warn this may hurt rabi sowing of chana and masoor, urging the government to raise import duties. Tur, masoor and moong market prices of imported pulses prices are ruling 10% to 20% below the MSP of respective varieties.\nOil imports from Russia steady in August\nIndia’s Russian crude imports held steady at 1.6 mbpd in August despite U.S. sanctions talk. While volumes eased from June highs, refiners continue to buy on discounts, even as diversification to Middle East, U.S. and Africa gains pace to balance energy security and costs.\nEU Considers Secondary Sanctions to Hit Russia’s War Effort\nThe European Union is mulling introducing secondary sanctions in an effort to prevent third countries from helping Russia circumvent the bloc’s existing punitive measures against Moscow, as per Bloomberg. The ministers are also considering further sanctions that target Russia’s oil and gas and financial sectors, as well as further restrictions of import and export of Russian goods. \nUK retailers suffer 11th month of downturn\nA downturn in British retail sales entered its 11th consecutive month in August and shops raised their prices by the most since late 2023. The CBI’s monthly gauge of how retail sales compared with a year earlier was little changed at -32 from July’s -34 but better than a dip to -46 in June. The outlook for September improved to -16. \nChina’s industrial profits extend decline\nChina’s industrial profits fell for a third consecutive month in July. Profits at China’s industrial firms fell 1.5% in July from a year earlier, following a 4.3% slump in June, while a 1.8% profit drop in the first half eased slightly to a 1.7% slide in the January-July period. \nBrazil might challenge tariffs in US courts: FinMin\nBrazil Finance Minister Fernando Haddad said on Wednesday that the South American country might challenge in U.S. courts the steep tariffs imposed by the Trump administration on U.S. imports of Brazilian goods. “We will go to court if needed,” Haddad told local news outlet UOL, adding that Brazil would not engage in lobbying efforts. Brazil faces 50% tariffs.\nAsian markets\nAsian markets opened on a positive note following gains in US and softer USD. \nBrent 67.12, USD 98.12, US 10y 4.239%, Gift Nifty -0.2%\nAugust 28, 2025 09:02\nStock market live updates today: Fund House Recommendations \nJefferies on Polycab: Maintain Buy on Company, target price at Rs 8180/Sh (Positive)\nMOSL on Coforge: Maintain Buy on Company, target price at Rs 2240/Sh (Positive)\nNuvama on Maruti: Maintain Buy on Company, target price at Rs 14300/Sh (Positive)\nInvestec on RBL Bank: Maintain Buy on Bank, target price at Rs 300/Sh (Positive)\nHSBC on BPCL: Maintain Buy on Company, target price at Rs 420/Sh (Positive)\nHSBC on HPCL: Maintain Buy on Company, target price at Rs 520/Sh (Positive)\nHSBC on IOC: Maintain Buy on Company, target price at Rs 190/Sh (Positive)\nSBI Research on Tariffs: US imposes 50% tariff on ~$45 Bn of Indian exports; Sectors hit most: Textiles, gems & jewellery, seafood; pharma & smartphones exempt (Neutral)\nAugust 28, 2025 08:53\nStock market live updates today: SBI Securities Research Morning Update – 28th August 2025\nGift Nifty indicates negative opening ahead of monthly expiry\n* Nifty 50 down 1%, Nifty Smallcap down 2% on Tuesday\n* Wall Street ends in the green, S&P 500 at record high\n* Asian indices trading mixed\nAugust 28, 2025 08:53\nStock market live updates today: Devarsh Vakil, Head of Prime Research, HDFC Securities views on today’s market outlook:\nMarkets Eye Lower Opening Amid US Tariff Blow; Nvidia Miss Weighs on Global Sentiments.\nThe S&P 500 closed at a record high of 6,481 as optimism swelled ahead of Nvidia’s highly anticipated earnings. The Nasdaq and Dow Jones also closed positively, driven by strength in the tech and energy sectors.\nNvidia beat expectations on top and bottom-line results, but its data centre revenue missed estimates due to China sales restrictions, and its future outlook disappointed. Shares fell by more than 3% in after-hours trading, sparking a pullback in U.S. equity futures and raising concerns about the elevated AI companies.\nOn Friday, the Commerce Department is scheduled to release its report on personal income and spending for July, which includes the Federal Reserve’s preferred measure of consumer price inflation.\nEnergy stocks rose 1.15% as oil prices remained volatile, reflecting geopolitical trade risks and shifts in global inventory levels. Gold edged down to $3,388/oz, as markets digested political pressure on the Fed after President Trump attempted to remove Fed Governor Lisa Cook, stoking talk of accelerated rate cuts.\nThe Trump administration doubled tariffs to 50% on Indian imports in retaliation for Russian oil purchases, which raises risks for major Indian exporters and potentially dampens global trade.\nNifty ended Tuesday’s session with a sharp fall of 255 points or 1.02%, to close at 24712, its lowest level since August 14th. Nifty has breached the crucial 20 and 50-day DEMA supports. The Nifty is close to filling the entire upward gap that was formed between 24673 and 24852. If it falls below 24600, it could be dragged down to the next support level near 24340. On the upside, 24900 is expected to offer short-term resistance.\nDespite positive cues from Asian markets over the past two sessions, domestic markets are expected to open lower as sentiment has been dampened by the US imposing 50% duties on India.\nWhile markets are expected to decline at the open, support is likely to be found near the 24600-24650 band, given the significant put writing activity, particularly in light of today’s monthly derivative contracts expiry.\nAugust 28, 2025 08:52\nStock market live updates today: Key highlights from the SBI Securities Daily Technical & Derivative Podcast*\n🌍 Global Market Pulse\n* US Markets: All 3 indices gained; S&P 500 hit fresh all-time high. Likely to test 6530; support at 6440–6420.\n* Brent Oil: Closed at $67.16 (+0.67%); support at $66–65.70, resistance at $68.50–68.70.\n* Dollar Index (DXY): Volatile, trading below moving averages. Resistance 99.20–99.40; Support 97.80–97.50.\n💹 Nifty Technical View\n* Trigger: Trump’s 25% tariff on Indian imports → sharp sell-off.\n* Close: Near 24,700, down >1%, bearish daily candle.\n* Trend: Broke 20 & 50-day EMA; RSI bearish crossover = downside bias.\n* Levels:\nSupport: 24,640–24,600 (100-day EMA), break → 24,400.\nResistance: 24,830–24,850 (20 & 50-day EMA).\n* Derivatives:\nFutures down 1.03%, OI up 4.29% = short build-up.\n24800CE & 24900CE heavy OI; 24700PE & 24600PE strong OI.\nOI PCR = 0.56.\n* Participation: 5 long build-up, 3 short covering, 20 short build-up, 22 long unwinding.\n💹 Bank Nifty Technical View\n* Bank Nifty: Weak, below swing low & 100-day EMA. Likely to test 54,000 → 53,500; hurdle at 54,900–55,000.\n💹 Sensex Technical View\n* Ended below 80,800, down 1.04%, under 100-day EMA. RSI bearish crossover.\n* Levels: Support 80,400–80,300; Resistance 81,100–81,200.\n* Derivatives: Futures down 0.97%, OI up 237%.\n* Options: Heavy OI at 81,000CE & 81,500CE; 80,500PE & 80,000PE strong support.\n* OI PCR = 1.18.\n🔑 Sectoral Sentiment\n* Likely Outperformers: Nifty Auto, FMCG.\n* Likely Underperformers: Defence, Pvt Banks, Financials, CPSE, PSE, Oil & Gas, Capital Market, Media.\nAugust 28, 2025 08:52\nStock market live updates today: Anlon Healthcare subscribed 1.7 times at end of Day 1\nThe initial public offering of Anlon Healthcare Ltd, a chemical manufacturing company engaged in producing high purity advanced pharmaceutical intermediates, enters Day 2 with retail investors showing keen interest. The IPO that will close on Friday, is priced in a band of ₹86-₹91 The total issue size is ₹121.03 crore, entirely a fresh issue of 1.33 crore shares. The issue has so far been subscribed 1.69 times. The market lot is 164 shares.\nAnlon Healthcare subscribed 1.7 times at end of Day 1\nAnlon Healthcare Ltd IPO Day 2: High purity pharmaceutical intermediates manufacturer sees strong retail investor interest, priced at ₹86-₹91.\nAugust 28, 2025 08:50\nStock market live updates today: Vikran Engineering enters Day 2 on strong note\nThe initial public offering of Vikran Engineering received a strong response from investors on Day 1, being subscribed 2.38 times.\nThe Wealth Company, backed by Ashish Kacholia and Mukul Aggarwal, -backed Vikran Engineering has received bids for 13.98 crore shares, against 5.87 crore shares on offer.\nVikran Engineering raises ₹231.60 cr IPO opens today\nVikran Engineering IPO subscribed 2.38 times on Day 1, backed by The Wealth Company and marquee investors.\nAugust 28, 2025 08:27\nStock market live updates today: oday’s Stock Recommendation: August 28, 2025\nAugust 28, 2025 08:26\nStock market live updates today: Fund Houses Recommendations \nJefferies on Hero Motocorp: Upgrade to Hold on Company, raise target price at Rs 5200/Sh (Positive)\nJefferies on TVS Motors: Maintain Buy on Company, raise target price at Rs 4250/Sh (Positive)\nJefferies on Maruti: Maintain Buy on Company, raise target price at Rs 17500/Sh (Positive)\nJefferies on Eicher Motors: Maintain Buy on Company, raise target price at Rs 6925/Sh (Positive)\nJefferies on Bajaj Auto: Maintain Hold on Company, raise target price at Rs 9000/Sh (Positive)\nJefferies on M&M: Maintain Buy on Company, raise target price at Rs 4200/Sh (Positive)\nMacquarie on Tata Comm: Maintain Outperform on Company, target price at Rs 2210/Sh (Positive)\nMacquarie on Reliance Ind: Maintain Outperform on Company, raise target price at Rs 1650/Sh (Positive)\nMacquarie on Bharti Airtel: Maintain Outperform on Company, target price at Rs 2050/Sh (Positive)\nJefferies on ICICI Bank: Maintain Buy on Bank, target price at Rs 1760/Sh (Positive)\nMOSL on Adani Ports: Maintain Buy on Company, target price at Rs 1700/Sh (Positive)\nMS on Real Estate: Mumbai and Bangalore were stronger than other cities in real estate market in July (Positive)\nMacquarie on Bharti Hexacom: Maintain Underperform on Company, cut target price at Rs 1380/Sh (Neutral)\nMacquarie on Vodafone: Maintain Underperform on Company, cut target price at Rs 5.0/Sh (Neutral)\nMacquarie on Indus Tower: Maintain Underperform on Company, target price at Rs 300/Sh (Neutral)\nJefferies on Hyundai: Maintain Underperform on Company, raise target price at Rs 2000/Sh (Neutral)\nJefferies on Tata Motors: Maintain Underperform on Company, raise target price at Rs 575/Sh (Neutral)\nJefferies on Ashok Ley: Maintain Hold on Company, target price at Rs 120/Sh (Neutral)\nAugust 28, 2025 07:49\nStock market live updates today: India Daybook – Stocks in News\nWockhardt Ltd: ICRA Limited upgraded Company’s credit ratings, revising outlook from ‘stable’ to ‘positive’. (Positive)\nNLC India: Company commissions first phase of 300 MW solar power plant in Rajasthan’s Bikaner (Positive)\nAuro Impex & Chemicals Ltd: Company announced its foray into stainless-steel pipe manufacturing, expanding its business segments. (Positive)\n*Khaitan Chemicals & Fertilizers:*Company’s Promoter Majestic Packaging Raises Stake To 22.75% (Positive)\nMRC Agrotech: Company signed a MoU with Khushi Sansaar on 26th August 2025 for exclusive distribution of nano-agrochemical products in India. (Positive)\nSMS Pharma: Company Receives USFDA EIR with “No Action Indicated” For Central Laboratory Analytical Services, Hyderabad. (Positive)\nEscorts Kubota Ltd: Company launched a new Kubota MU4201 tractor, entering the 41-44 HP market. (Positive)\nOIL India: Company & BPCL Ink Joint Venture Agreement To Establish City Gas Distribution Network In Arunachal Pradesh. (Positive)\nAptech: Company Secures Letter Of Intent from Autonomous Government Body To Conduct Computer-Based Online Examinations For Higher Educational Institutions. (Positive)\nSBI Card: Company and Flipkart Form Strategic Alliance; Launch Flipkart SBI Cobranded Credit Card (Positive)\nUnited Breweries: Company to Add 0.4 MHL Capacity with New Canning Line at Nizam Brewery, Telangana; Rs 90 Cr Investment Approved. (Positive)\nZaggle: Company signs five-year referral agreement with Standard Chartered Bank (Positive)\nTCS: Company appoints Amit Kapoor as Chief AI & Services Transformation Officer to lead new global unit (Positive)\nBiocon: Company received USFDA tentative nod for its ANDA Sitagliptin tablets. The drug is indicated for Type-2 diabetes. (Positive)\nOIL India: Company and BPCL Execute JV Agreement for City Gas distribution in Arunachal Pradesh (Positive)\nNewgen software: Company secured Rs 73 cr order for Judicial Digitization project. (Positive)\nVIP Industries: CCI approved acquisition of certain shareholding in V.I.P. Industries Ltd. Promoter and promoter group of the Company (Positive)\nSanathan Textiles: Company has commenced commercial production at its new green manufacturing facility in Punjab. (Positive)\nJaiprakash Associates: CCI approved the acquisition of Jaiprakash Associates by Adani Group entities. (Positive)\nHG Infra: Company’s arm has achieved financial closure for a road upgradation project in Gujarat valued at Rs 781.11 crore. (Positive)\nManappuram Finance: Company has signed a deal worth over Rs 4,384 crore with BC Asia Investments and a promoter group (Positive)\nDr. Reddy’s: Company Gets Interim Stay from Telangana High Court on Income Tax Reassessment Proceedings Related to DRHL Merger. (Neutral)\nNavin Fluorine: Company Subsidiary NFASL Allots Rs 200 Cr Preference Shares to Parent for Debt Repayment & Consolidated Leverage Reduction (Neutral) \nGraphite India: Company Increases Stake In Godi India Pvt. Ltd. To 45.76% via Rs 18.65 Cr Rights Issue Subscription. (Neutral)\nNRB Bearings: Company Acquires 8.5% Stake In Amplus Ampere Pvt Ltd For Rs 4.8 Cr to Source 15 MWP Solar Power in Maharashtra. (Neutral) \nSpicejet: Company Launches Paperless Boarding At Shillong Airport; To Expand To Other Places –PTI. (Neutral)\nBSE Ltd: BSE Investments, BSE Administration and Supervision to Merge With BSE Technologies (Neutral)\nJSW Steel: Company Incorporates JV “Apjsw Private Limited” With APMDC For Konijedu Marlapadu Iron Ore Project In Andhra Pradesh. (Neutral)\nTata Steel: Company acquires stakes worth ₹3,100 crore in Singapore subsidiary, T Steel Holdings Pte. Ltd (Neutral)\nIndigo: Rakesh Gangwal Family likely to sell up to 3.1% stake in Interglobe Aviation via Block Deals. (Neutral)\nPB Fintech: Board approves Re-appointment of Yashish Dahiyaas Chairman, Executive Director & Chief Executive Officer till July 2031. (Neutral)\nCohance: MD V Prasada Raju sold 6lk shares to repay loan for ESOPs.(Neutral)\nHubtown: Board approved the amalgamation of Distinctive Realty with Amazia Developers and approved the amalgamation of Nitant Real Estate & Amazia Developers with the company. (Neutral)\nJana Small Finance Bank: Company received a Goods and Services Tax demand of Rs 28.5 crore including a penalty from the Karnataka Tax Body. (Neutral)\nRatnamani Metals: Company incorporated the arm Ratnamani Middle East company in the Kingdom of Saudi Arabia. (Neutral)\nMahanagar Gas: Company received Goods and Services Tax demand of Rs 54 crore from Mumbai tax body. (Neutral)\nTexmaco Rail & Engineering: Company has approved the incorporation of a JV with Rail Vikas Nigam Limited for rolling stock and rail infrastructure projects. (Neutral)\nAdani Energy Solutions: Company has incorporated a wholly owned subsidiary named Adani Energy Solutions Step-Fifteen. (Neutral)\nList of securities included in short-term ASM Stage 1: Apollo Micro Systems, Zinka Logistics Solutions, HLE Glascoat. (Neutral)\nAsian Hotels: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nAlfred Herbert: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral) \nBlack Box: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nBikaji Foods: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nCovance Softsol: Ex-Date Tomorrow, Right Issue of Equity Shares (Neutral)\nEngineers India: Ex-Date Tomorrow, Dividend Rs 2.0/Sh (Neutral)\nGanesh Housing: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral)\nHarsha Engineers: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nNitin Spinners: Ex-Date Tomorrow, Dividend Rs 3.0/Sh (Neutral)\nProtean eGov: Ex-Date Tomorrow, Dividend Rs 10.0/Sh (Neutral)\nRoyal Orchid: Ex-Date Tomorrow, Dividend Rs 2.5/Sh (Neutral)\nSalzer: Ex-Date Tomorrow, Dividend Rs 2.5/Sh (Neutral)\nShetron: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nShilp Gravures: Ex-Date Thursday, Dividend Rs 2.1/Sh (Neutral)\nSteelcast Ltd: Ex-Date Tomorrow, Stock Split from Rs.5/- to Rs.1/- (Neutral) \nSuyog Telematics: Ex-Date Tomorrow, Dividend Rs 1.8/Sh (Neutral)\nVijaya Diagnostic: Ex-Date Tomorrow, Dividend Rs 2.0/Sh (Neutral)\nWhirlpool of India: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral)\nYuken India: Ex-Date Tomorrow, Dividend Rs 1.5/Sh (Neutral)\nZee Ent: Ex-Date Tomorrow, Dividend Rs 2.43/Sh (Neutral)\nAAA Technologies: Ex-Date Today, Dividend Rs 1.5/Sh (Neutral)\nAster DM: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral)\nDiamines & Chemicals: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral) \nDMR Hydro engineering: Ex-Date Today, Bonus issue 8:5 (Neutral)\nGujarat Pipavav Port: Ex-Date Today, Dividend Rs 4.2/Sh (Neutral) \nJyothy Labs: Ex-Date Today, Dividend Rs 3.5/Sh (Neutral)\nMagna Electro: Ex-Date Today, Dividend Rs 6.0/Sh (Neutral)\nVedant Fashions: Ex-Date Today, Dividend Rs 8.0/Sh (Neutral)\nProcter & Gamble Hygiene: Ex-Date Today, Dividend Rs 65.0/Sh (Neutral)\nRoute Mobile: Ex-Date Today, Dividend Rs 2.0/Sh (Neutral) \nSpeciality Restaurants: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral)\nLotus Dev: Revenue down 49% at Rs 61cr vs Rs 121cr YoY, Net Profit down 35% at Rs 26cr vs Rs 40cr. (Negative) \nGOCL Corporation: Promoter Hinduja Capital Limited sold 24.79 lakh shares. (Negative) \nFilatex Fashions: Promoter Prabhat Sethia sold 1 crore shares. (Negative) \nRama Steel Tubes: Promoter Tarun Dhir sold 20 lakh shares, Promoter Arun Dhir sold 15.54 lakh shares, Promoter Charanjit Lal Dhir sold 6 lakh shares (Negative)\nAugust 28, 2025 07:48\nStock market live updates today: IndiGo - One company where the promoter kept selling from Rs 765 levels and stock keeps rising\nNov 10, 2015 (IPO)\\Promoters incl. Rakesh Gangwal\\OFS as part of \nIPO\\765 issue price; promoters divested part of stake.\nSep 7–8, 2022\\Rakesh & Shobha Gangwal\\~2.74%\\u0009~1,919\\u0009 Block deal on worth ₹2,005 crore; first major sale post-2022 exit plan.\nFeb 16, 2023\\Shobha Gangwal\\~4%\\1,875 (floor)\\Block deal via term sheet; floor price set at ₹1,875.\nAug 16, 2023\\Gangwal family\\~4–5%\\2,400 (floor)\\Planned block deal with floor at ₹2,400.\nar 11, 2024\\Rakesh Gangwal\\~5.8% (22.5m shares)\\u00093,015–3,016 (executed)\\Actual trade execution range reported.\nAug 29, 2024\\Chinkerpoo Family Trust (Gangwal family trust)\\~5.2–6%\\4,760 (executed); 4,593 (floor)\\Floor set at ₹4,593; trades executed ~₹4,760; deal size ~₹9,500–11,000 cr.\nMay 27, 2025\\Rakesh Gangwal & Chinkerpoo Family Trust\\~5.7%\\5,230.5 (executed)\\Large block worth ~$1.36B; priced at ~3–4.5% discount to prior close.\nAug 26, 2025 (planned)\\Gangwal family\\up to 3.1%\\5,808 (floor) \\Fresh block deal announced; execution pending.\nAugust 28, 2025 07:45\nStock market live updates today: Economic Calendar – 28.08.2025\n16:00 INDIA Industrial Production y/y (Expected: 2.0% versus Previous: 1.5%)\n18:00 U.S. Unemployment Claims (Expected: 231k versus Previous: 235K)\n18:00 U.S. Prelim GDP q/q (Expected: 3.1% versus Previous: 3.0%)\n19:30 U.S. Pending Home Sales m/m (Expected: -0.3% versus Previous: -0.8%)\nAugust 28, 2025 07:39\nStock market live updates today: Major U.S. listed stocks result calendar 28.08.2025\nLi Auto Inc (Pre market) (Sector- Automobile)\nDollar General Corporation (Pre market) (Sector- Retail)\nDick’s Sporting Goods Inc (Pre market) (Sector- Retailers)\nBurlington Stores, Inc (Pre market) (Sector- Retailers)\nHormel Foods Corporation (Pre market) (Sector- FMCG)\nBest Buy Co., Inc (Pre market) (Sector- Retailers)\nBrown Forman Corporation (Pre market) (Sector- FMCG)\nHarmony Gold Mining Company Limited (Pre market) (Sector- Metals)\nDell Technologies Inc (Post Market) (Sector- Technology)\nMarvell Technology, Inc (Post Market) (Sector- Technology)\nAutodesk, Inc (Post Market) (Sector- Technology)\nAffirm Holdings, Inc (Post Market) (Sector- Technology)\nUlta Beauty, Inc (Post Market) (Sector- Retailers)\nAugust 28, 2025 07:37\nStock market live updates today: Nifty stares at 200 points decline at open\nDomestic markets are likely to remain volatile amid a doubling of tariffs by the US. Besides, the settlement of monthly contracts on the NSE will add to volatility, said marketmen. \nAditi Nayar, Chief Economist, Head - Research & Outreach, ICRA Ltd, said the persisting global uncertainty is likely to further delay the domestic private capex cycle in India. “However, certain sectors such as electronics, semi-conductors and segments like electric vehicles will continue to see a scale-up in investments, in ICRA’s view.”\nNifty stares at 200 points decline at open\nDomestic markets volatile due to US tariffs, NSE contracts settlement; certain sectors to see investments despite global uncertainty.\nAugust 28, 2025 07:23\nStock market live updates today: Watch out for these dozen stocks including TCS, Tata Steel, IndiGo, Texmaco, RVNL, United Breweries in August 28, 2025 trades\nWatch out for these dozen stocks including TCS, Tata Steel, IndiGo, Texmaco, RVNL, United Breweries in August 28, 2025 trades\nInterGlobe Aviation promoter to divest stake, Texmaco Rail forms JV, TCS appoints new AI officer, Tata Steel invests in subsidiary.\nAugust 28, 2025 07:00\nStock market live updates today: Key triggers for these three pharma stocks - Dr Reddy’s Lab, Cipla, Biocon\nRecalling medicines, court stay and USFDA approval to impact these stocks today\nKey triggers for these three pharma stocks - Dr Reddy’s Lab, Cipla, Biocon\nDr Reddy's Labs gets stay on tax reassessment, Cipla recalls asthma medication, Biocon gets FDA approval for Sitagliptin tablets.\nAugust 28, 2025 06:52\nStock market live updates today: Six power and energy to stocks to remain in focus on Thursday, August 28, 2025\nOil India-BPCL deal, PFC’s new pact, Acme Solar’s fund raising plans, JP Power Ventures’ expansion, SAEL Industries solar foray\nSix power and energy to stocks to remain in focus on Thursday, August 28, 2025\nPFC signs performance evaluation agreement, Oil India and BPCL form joint venture, Acme Solar to raise ₹3,000 crore.\nAugust 28, 2025 06:39\nStock market live updates today: Stock to buy today: Craftsman Automation (₹7,197.50) – BUY\nThe short-term outlook is bullish for Craftsman Automation. The stock had surged over 5 per cent on Tuesday when the broader markets were beaten down badly. This rise has happened after forming a strong base between ₹7,000 and ₹6,750. This ₹7,000-6,750 will act as a strong support zone and limit the downside.\nStock to buy today: Craftsman Automation (₹7,197.50) – BUY\nCraftsman Automation stock outlook is bullish with strong support at ₹7,000-6,750, potential rise to ₹7,800-7,850. Trading recommendations included.\nCOMMENTS\nPublished on August 28, 2025", "timestamp": "2025-08-28T18:10:28.251233"}, {"title": "IndiGo Share Price Highlights: Gangwal family stake sale drags IndiGo shares by 5%", "sub_heading": "IndiGo stocks today, IndiGo share price LIVE news & updates: Catch live updates", "publisher": "By Team BL\nUpdated - August 28, 2025 at 04:22 PM.", "story": "FILE PHOTO: Workers adjust the screen at an event by Indian airline IndiGo in New Delhi, India, August 5, 2024. REUTERS/Priyanshu Singh/File Photo | Photo Credit: PRIYANSHU SINGH\nIndiGo stocks today, IndiGo share price, InterGlobe Aviation share price live today news & updates: Shares of IndiGo or InterGlobe Aviation Ltd are in focus today. \nHere’s Why: InterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for Rs 7,027.7 crore through separate block deals on Thursday.\nScroll down for more\nIndiGo share price live today: Rakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr\nGangwal, the co-founder of IndiGo, has been selling his equity in a phased manner, following a bitter fallout with co-founder Rahul Bhatia.\nApart from Rakesh Gangwal, the Chinkerpoo Family Trust, whose trustees are Shobha Gangwal and JP Morgan Trust Company of Delaware, have collectively divested up to 3.1 per cent holding in IndiGo, the country’s largest carrier, according to the term sheet accessed by PTI.\nREAD MORE\nAugust 28, 2025 16:22\nThis live blog has ended.\nFollow businessline for more\nAugust 28, 2025 16:21\nIndiGo share price live today: Closing figures \nShares of Interglobe Aviation ended 5.30% lower at ₹5,724.55 on the BSE, hitting an intraday low of ₹5,708. \nOn the NSE, the stock declined 5.34 per cent to ₹5,727. \nAugust 28, 2025 15:54\nStock market today: Sensex, Nifty 50 end lower \nSensex ended 705.97 pts or 0.87% lower at 80,080.57 (close to intraday low of 80,013.02). Nifty 50 fell 211.15 pts or 0.85 per cent to 24,500.90 after hitting a low of 24,481.60. Most sectors, including Auto, IT, FMCG, and Metals, ended in negative range as investors turned to profit booking from recent gains. Consumer Durables staged resilience. \nHERE ARE SOME TOP MOVERS\ntop gainers & losers today Aug 28: Sensex, Nifty 50 drag as broad-based selloff hit Dalal Street amid 50% tariff shock, realty & IT stocks drag the most\nBenchmark indices under pressure due to US tariffs, promoter stake sales, profit booking, stretched valuations, and global concerns.\nAugust 28, 2025 15:16\nIndiGo share price live: Shares down over 5%\nShares of IndiGo/ Interglobe Aviation traded 5.25% lower at ₹5,732.50 on the NSE, a few minutes away from market close.\nAugust 28, 2025 14:32\nIndiGo share price live today: Shares sink\nIndiGo stock dragged 4–5% today, largely driven by a block sale of roughly 3.1% stake by the Gangwal family, valued at an estimated ₹7,000 crore—part of a long-term phased exit plan. \nAugust 28, 2025 13:56\nIndiGo share price live today: MCAP stood at 2,22,398.69 cr\nAugust 28, 2025 13:10\nIndiGo share price live today: Shares down 5% \nShares fell 5% to ₹5,748.50 on the NSE at 1.10 pm after hitting a low of ₹5,711.\nAugust 28, 2025 12:28\nIndiGo share price live today: Expert view following block deal | View from Nitant Darekar Research Analyst at Bonanza\nThe Gangwal family’s latest Rs 7,028 crore divestment (3.1% stake) continues their multi-year exit strategy, having steadily reduced promoter shareholding from 67.8% to 43.5% since 2022. In my opinion this is a pure liquidity-driven selling rather than concerns over IndiGo’s business fundamentals. Today’s 5% decline appears overdone, driven by immediate supply pressure and weak Q2 operating metrics affected by geopolitical disruptions and yield compression. \nThe sharp selloff, however, presents a compelling accumulation opportunity for long-term investors. Management’s constructive outlook for H2FY26 recovery appears credible, with double-digit capacity expansion resuming in Q3-Q4, backed by international route additions to London and Copenhagen. \nThe anticipated A321XLR deliveries will provide additional growth prospects until CY26. \nDespite short-term headwinds from seasonal domestic weakness and fleet optimisation problems, IndiGo’s strong market position, large orderbook, and secured slots at major airports (Jewar, Navi Mumbai) position the company well for the medium term.\n- Nitant Darekar Research Analyst at Bonanza\nAugust 28, 2025 11:54\nIndiGo share price live today: Shares down nearly 5% \nShares of Interglobe Aviation declined 4.74% to ₹5763.50 on the NSE at 11.53 am.\nAugust 28, 2025 11:37\nIndiGo share price today live: Shares down  \nIndiGo shares fell 4.31% on the NSE to ₹5,789.50 as at 11.36 am. The stock opened lower at ₹5,875 against the previous close of ₹6050 and hit an intraday low of ₹5755 on the NSE. \nCOMMENTS\nPublished on August 28, 2025", "timestamp": "2025-08-28T18:10:29.816009"}, {"title": "IPO News Highlights: Mangal Electrical shares sink 5% on listing day, Vikran Engineering IPO subscribed over 5x on Day 2, Anlon Healthcare booked 3x", "sub_heading": "Mangal Electrical IPO listing today live, Vikran Engineering & Anlon Healthcare enters Day 2, Globtier Infotech, NIS Management IPO news live updates today: Follow live updates here", "publisher": "By Team BL\nUpdated - August 28, 2025 at 04:34 PM.", "story": "Businessman use tablet and smart phone for Stock Market | Photo Credit: Orientfootage\nMangal Electrical IPO listing today live, Vikran Engineering & Anlon Healthcare enters Day 2, Globtier Infotech, NIS Management IPO news live updates today: \nKey highlights\nShares of Mangal Electrical Industries’ list on NSE, BSE today.\nVikran Engineering IPO: subscribed to 2.38 times on day 1. \nAnlon Healthcare IPO: subscribed to 1.69 times on day 1.\nAugust 28, 2025 16:33\nThis live has ended.\nFollow businessline for more\nAugust 28, 2025 16:32\nMangal Electrical share price live today: Shares sink 5%\nShares of Mangal Electrical Industries Ltd made a muted debut on bourses, listing at a discount against the issue price of ₹561.\nHere’s what experts say: READ HERE\nAugust 28, 2025 16:31\nANLON HEALTHCARE IPO Live: 3.15 times booked.\nAugust 28, 2025 16:30\nVikran Engineering IPO Live today: Subscribed 5.11 times  \nVikran Engineering IPO has been subscribed 5.11 times as at 4.24 pm on August 28. \nQIBs: 0.87 times \nNIIs: 10.72 times \nRetail: 5.13 times \nTotal: 5.11 times \nAugust 28, 2025 15:53\nStock market today: Sensex, Nifty 50 end lower\nSensex ended 705.97 pts or 0.87% lower at 80,080.57 (close to intraday low of 80,013.02). Nifty 50 fell 211.15 pts or 0.85 per cent to 24,500.90 after hitting a low of 24,481.60. Most sectors, including Auto, IT, FMCG, and Metals, ended in negative range as investors turned to profit booking from recent gains. Consumer Durables staged resilience.\nHERE ARE SOME TOP MOVERS\ntop gainers & losers today Aug 28: Sensex, Nifty 50 drag as broad-based selloff hit Dalal Street amid 50% tariff shock, realty & IT stocks drag the most\nBenchmark indices under pressure due to US tariffs, promoter stake sales, profit booking, stretched valuations, and global concerns.\nAugust 28, 2025 15:12\nIPO News live today: Abril Paper Tech sets IPO price at Rs 61/share; Rs 13.42-cr offer to open on Friday - PTI\nAugust 28, 2025 13:58\nMangal Electrical share price listing live today: Shares sink 5%\nAugust 28, 2025 13:55\nVikran Engineering IPO Live today: Subscribed 4.32 times \nVikran Engineering IPO has been subscribed 4.32 times as at 1.51 pm on August 28. \nQIBs: 0.67 times\nNIIs: 8.90 times\nRetail: 4.44 times\nTotal: 4.32 times \nAugust 28, 2025 13:54\nAnlon Healthcare IPO Live today: Subscribed 2.75 times \nAnlon Healthcare IPO has been subscribed 2.75 times as at 1.48 pm on August 28. \nQIBs: 0.92 times\nNIIs: 1.54 times\nRetail: 18.29 times\nTotal: 2.75 times \nAugust 28, 2025 13:11\nMangal Electrical share price live today: Shares down 5% \nShares fell to ₹533 level at 1.11 pm.\nAugust 28, 2025 12:19\nAnlon Healthcare IPO Live today: Subscribed 2.52 times\nAnlon Healthcare IPO has been subscribed 2.52 times as at 12.15 pm on August 28.\nQIBs: 0.91 times\nNIIs: 1.37 times\nRetail: 16.30 times\nTotal: 2.52 times\nAugust 28, 2025 12:17\nVikran Engineering IPO Live Updates: Subscribed 3.91 times \nVikran Engineering IPO has been subscribed 3.91 times as at 12.15 pm on August 28. \nQIBs: 0.63 times, NIIs: 8.14 times, retail: 3.98 times \nAugust 28, 2025 12:15\nMangal Electrical IPO listing share price live today: Shares down\nMangal Electrical stock traded at ₹545 as at 12.15 pm after listing at ₹556 on the NSE\nAugust 28, 2025 11:15\nAnlon Healthcare IPO Live today: Booked 2.33 times\nAnlon Healthcare has been subscribed 2.33 times as at 11.12 am on August 28. QIBs: 0.91 times, NIIs: 1.25 times, retail: 14.55 times.\nAugust 28, 2025 10:38\nVikran Engineering IPO Live Updates: Subscribed 3.25 times\nVikran Engineering IPO has been subscribed 3.25 times as at 10.36 am on August 28.\nQIBs: 0.62 times, NIIs: 6.85 times, retail: 3.20 times\nAugust 28, 2025 10:15\nMangal Electrical share price listing live today: Muted debut \nMangal Electrical Industries stock traded near ₹559 level after listing at ₹556 on the NSE, down 0.89% the IPO-price of ₹561. On the BSE, the stock debuted at ₹558. \nAugust 28, 2025 09:55\nVikran Engineering IPO Live Today: enters Day 2 on strong note\nThe initial public offering of Vikran Engineering received a strong response from investors on Day 1, being subscribed 2.38 times.\nThe Wealth Company, backed by Ashish Kacholia and Mukul Aggarwal, has received bids for 13.98 crore shares, against 5.87 crore shares on offer.\nKNOW MORE\nAugust 28, 2025 09:53\nVikran Engineering IPO Live Today: Garners 2.38 times subscription on Day 1\nThe initial public offering of Vikran Engineering, an infrastructure EPC company, garnered 2.38 times subscription on the first day of bidding on Tuesday.\nThe initial share sale received bids for 13,97,19,696 shares against 5,87,39,128 shares on offer, according to data available with the NSE.\nAugust 28, 2025 09:52\nAnlon Healthcare IPO Live Today: subscribed 1.7 times at end of Day 1\nThe initial public offering of Anlon Healthcare Ltd, a chemical manufacturing company engaged in producing high purity advanced pharmaceutical intermediates, enters Day 2 with retail investors showing keen interest. The IPO that will close on Friday, is priced in a band of ₹86-₹91. The total issue size is ₹121.03 crore, entirely a fresh issue of 1.33 crore shares. The issue has so far been subscribed 1.69 times. The market lot is 164 shares.\nCOMMENTS\nPublished on August 28, 2025", "timestamp": "2025-08-28T18:10:30.969342"}, {"title": "Sensex, Nifty extend losses as US tariff impact weighs on export stocks ", "sub_heading": "The decline came as the 50 per cent US tariff on Indian goods took effect, creating broad-based weakness across export-dependent sectors", "publisher": "By Anupama Ghosh\nUpdated - August 28, 2025 at 01:02 PM.", "story": "Benchmark indices remained under pressure during midday trading on Thursday, with the Sensex down 446.01 points or 0.55 per cent at 80,340.53 and the Nifty 50 declining 120.90 points or 0.49 per cent to 24,591.15 as of 12.30 pm. The markets opened lower at 80,754.66 for the Sensex from the previous close of 80,786.54.\nThe decline came as the 50 per cent US tariff on Indian goods took effect, creating broad-based weakness across export-dependent sectors. Market breadth remained negative with 2,275 stocks declining against 1,618 advancing on the BSE, while 188 stocks remained unchanged. A total of 4,081 stocks were traded during the session.\nAmong sectoral indices, the Nifty Next 50 fell 410.75 points or 0.61 per cent to 66,389.60, while the Nifty Financial Services dropped 144.65 points or 0.56 per cent to 25,808.90. The Nifty Bank declined 317.95 points or 0.58 per cent to 54,129.80, and the Nifty Midcap 100 slipped 363.40 points or 0.64 per cent to 56,402.80.\nREAD MORE", "timestamp": "2025-08-28T18:10:32.146004"}, {"title": "Rakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr; shares fall over 4%", "sub_heading": "After the latest transaction, Rakesh Gangwal and his family trust’s holding in IndiGo has come down to 4.71% from 7.81%", "publisher": "By PTI\nUpdated - August 28, 2025 at 10:28 AM. | New Delhi, Aug 28", "story": "InterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for ₹7,027.7 crore through separate block deals on Thursday.\nAfter the stake sale, InterGlobe Aviation's shares were trading 4.44 per cent lower at ₹5,781 apiece on the NSE and the scrip of the company went down 4.16 per cent to ₹5,793 each on the BSE.\nAfter the latest transaction, Rakesh Gangwal and his family trust's holding in IndiGo has come down to 4.71 per cent from 7.81 per cent.\nREAD MORE", "timestamp": "2025-08-28T18:10:32.998053"}, {"title": "Stock Market Highlights 28 August 2025: Sensex tanks 706 points, Nifty falls to 24,500 as steep 50% US tariffs dent investor sentiment", "sub_heading": "Sensex, Nifty, Share Prices Highlights: Benchmark indices tumbled on Thursday, with the Sensex cracking 706 points, as the additional 25 per cent tariff imposed by US President Donald Trump on India for its purchases of Russian oil came into effect. Besides this, persistent foreign fund outflows also dented investors’ sentiment. The additional 25 per cent tariff imposed by the US on India came into effect on Wednesday, bringing the total amount of levies imposed on New Delhi to 50 per cent. The 30-share BSE Sensex tanked 705.97 points or 0.87 per cent to settle at 80,080.57. During the day, it dropped 773.52 points or 0.95 per cent to 80,013.02. The 50-share NSE Nifty dived 211.15 points or 0.85 per cent to 24,500.90. From the Sensex firms, HCL Tech, Infosys, Power Grid, Tata Consultancy Services, HDFC Bank, Hindustan Unilever, Bharti Airtel and ICICI Bank were among the major laggards. However, Titan, Larsen & Toubro, Maruti and Axis Bank were among the gainers.", "publisher": "By Team BLKS Badri Narayanan\nUpdated - August 28, 2025 at 04:12 PM.", "story": "Stock Market today | Share Market Highlights - Find here all the highlights related to Sensex, Nifty, BSE, NSE, share prices and Indian stock markets for 28 Aug 2025 \nAugust 28, 2025 16:07\nClosing bell: Reeling from the sudden imposition of 25% extra US tariffs, benchmark indices ended lower today, says Vaibhav Vidwani, Research Analyst at Bonanza\nView from Vaibhav Vidwani, Research Analyst at Bonanza:\n“Today, Indian stock markets ended lower, with the Nifty 50 falling 0.85% to 24,500 and the Sensex declining 0.87% to 80,080, marking a negative close after a day of widespread selling pressure. The principal reason for today’s downturn was the sudden imposition of an additional 25% tariff by the US on Indian exports—taking the total to 50%—which rattled investor sentiment and led to sharp early losses across indices. Looking forward, the sentiment is expected to remain cautious with markets likely to remain rangebound as participants wait for more clarity on the India–US trade standoff and the global interest rate outlook. Any signs of resolution in tariffs or positive developments in global markets could lend support, but further FII outflows and pressure on bank stocks may cap near-term gains.”\nAugust 28, 2025 16:05\nClosing bell: Kansai Nerolac Paints has opened a sales depot at Nanded, Maharashtra\nAugust 28, 2025 16:05\nClosing bell: Rupee rises 6 paise to close at 87.63 against US dollar\nThe rupee rose by 6 paise to close at 87.63 (provisional) against the US dollar on Thursday aided by a weaker greenback and a decline in crude oil prices.\nHowever, concerns over additional US tariffs on Indian products, which kicked in on Wednesday, and a decline in domestic equity markets capped gains in the local unit, according to forex traders.\nThe US government has imposed a total of 50 per cent tariffs on Indian exports to America, barring a few sectors.\nRupee rises 6 paise to close at 87.63 against US dollar\nThe rupee rose by 6 paise to close at 87.63 (provisional) against the US dollar on Thursday aided by a weaker greenback and a decline in crude oil prices.\nAugust 28, 2025 15:51\nCurrency update: Rupee rises 6 paise to close at 87.63 (provisional) against US dollar.\nAugust 28, 2025 15:47\nStock market live: Sensex ended 705.97 pts or 0.87% lower at 80,080.57; Nifty 50 fell 211.15 pts or 0.85% to 24,500.90\nSensex ended 705.97 pts or 0.87 per cent lower at 80,080.57 (close to intraday low of 80,013.02). Nifty 50 fell 211.15 pts or 0.85 per cent to 24,500.90 after hitting a low of 24,481.60. Most sectors, including Auto, IT, FMCG, and Metals, ended in negative range as investors turned to profit booking from recent gains. Consumer Durables staged resilience.\nAugust 28, 2025 15:37\nStock markets live today: Mastercard and Infosys collaborate to scale cross-border payments\nAugust 28, 2025 15:36\nStock market live today: Dr Agarwal’s Eye Hospitals to merge with parent Dr Agarwal’s Health Care\nListed healthcare services provider Dr Agarwal’s Eye Hospital (AEHL) is merging with its listed parent Dr Agarwal’s Health Care Ltd (AHCL) by way of a merger by way of absorption as a going concern.\nThe Boards of Directors of AHCL and AEHL at their respective board meetings held on August 27 approved the scheme of amalgamation of the two independently listed companies under the Dr Agarwal’s Group. The merger is subject to the requisite approvals from respective shareholders of AHCL and AEHL and the applicable regulatory approvals.\nDr Agarwal’s Eye Hospitals to merge with parent Dr Agarwal’s Health Care\nDr Agarwal’s Eye Hospital (AEHL) merging with Dr Agarwal’s Health Care Ltd (AHCL) to create a stronger entity.\nAugust 28, 2025 15:35\nStock market live: Mumbai-based SFC Environmental Technologies files DRHP for IPO\nMumbai-based environmental technology company involved in wastewater treatment and solid waste treatment company; SFC Environmental Technologies has filed its Draft Red Herring Prospectus (DRHP) with capital markets regulator, Securities and Exchange Board of India (SEBI) for its Initial Public Offering (IPO).\nThe offer, with a face value of ₹2, is a mix of fresh issue of shares up to ₹150 crore and an offer-for-sale up to 12,307,500 shares by promoters and other selling shareholders. The promoters selling shares are Sandeep Sudhakar Asolkar and Saketchandrasingh Pratapsingh Dhandoriya. Other selling shareholders are Sarvesh Kumar Garg, Sandeep Sambhaji Parab, Rajesh Kesavan Nambisan, Veera Venkata Satyanarayana Yannamani, Jaya Chandrakant Gogri, Jayshree Harit Shah, Hardik Suresh Matalia, Parag Bipinchandra Shah and Kumaraguru Madurakavi.\nThe offer also includes a subscription reservation by eligible employees, and a discount is being offered to eligible employees bidding in the employee reservation portion.\nAugust 28, 2025 15:20\nShare market live updates: Patel Engineering Ltd raises ₹90 crore from Non-Convertible Debenture issue of private placement\nPatel Engineering Ltd has raised ₹90 crore from Non-Convertible Debenture issue of private placement.\nThe fundraise will be utilised to support working capital requirements for ongoing EPC projects, repayment/prepayment of debt, and mobilization for new projects. This strategic step reflects Patel Engineering’s commitment to maintaining a resilient balance sheet while scaling operations across its growing infrastructure portfolio.\nAugust 28, 2025 15:19\nStock market live updates: Jio Financial Services Limited (JFSL) held its second Annual General Meeting post listing today\nThe meeting was addressed by Mr. K.V. Kamath, Chairman, JFSL; and Mr. Hitesh Sethia, MD & CEO, JFSL.\nExcerpts from the address of Mr. K.V. Kamath, Chairman, JFSL\nIndia is on the threshold of an extraordinary decade. With a young population, rising income levels, policy-led reforms, a strong infrastructure push, and digital adoption at scale, our economy is well-placed to sustain a GDP growth of around 6.5-7%, making it the fastest growing major economy in the world.\nOne of the most remarkable achievements in recent years has been the creation of a robust digital public infrastructure. These platforms are helping bridge the rural–urban divide, bringing millions of first-time users into the fold of the formal economy, and enabling a new age digital ecosystem that is inclusive and equitable.\nFY25 was a pivotal year for our Company. During this period, we scaled our existing businesses, successfully operationalized new ventures, secured key regulatory approvals for new businesses to come, and implemented a sophisticated data intelligence engine, which will form the backbone of our personalised and intelligent financial services offerings for customers.\nExcerpts from the address of Mr. Hitesh Sethia, MD & CEO, JFSL\nOur businesses such as the NBFC, the asset management JV with BlackRock, the payments bank, the payment solutions vertical, and the insurance broking arm are off to a robust start and continue to scale up…even as we firm up our go-to-market plans for our other proposed ventures, including the JVs with BlackRock for wealth management and broking, as well as our recently announced partnership with Allianz for insurance.\nWe have ambitious plans of becoming a leading, full-stack financial services institution with significant market share. The Company is in a strategic build-out phase at the moment, with diverse businesses which are either being scaled up or newly incubated.\nOur business model is uniquely structured to fund its expansion directly from the return on our shareholders’ capital, even as the core capital base itself provides us sufficient cushion. This approach allows us to grow sustainably, with disciplined allocation of resources. At this juncture of our growth journey, conventional valuation metrics may not fully capture the intrinsic value of our model.\nA key monitorable for us is the steady increase in income from business operations (~40% of consolidated total net income in Q1 FY26, up from ~12% in Q1FY 25), which highlights the growing strength of our core activities, and will be a key driver of our future success.\nThe JioFinance app, our primary digital storefront for retail customers, which is also embedded within the MyJio app, continued to gain traction over this period. In Q1 FY26, we served an average 8.1 million Monthly Active Users across all our digital properties.\nOur app has seen significant traction in user engagement, especially with new products like JioBlackRock’s mutual funds and features such as tax filing and planning going live.\nAlongside our in-house product suite, we have also entered into tie-ups with trusted partner brands to bring our customers a range of solutions, including digital gold, life and general insurance, and tax filing and planning, which are complementary to our offerings.\nOver the coming months, you’ll see us entering more such strategic tie-ups with leading financial services providers to further expand our portfolio with new products, designed to cater to the financial needs of our customers holistically.\nAugust 28, 2025 15:15\nStock market live news: Dev Information Technology has secured a significant work order from RajCOMP Info Services Ltd., a Government of Rajasthan undertaking; Shares zoom 7% on the NSE to Rs 44.41.\nAugust 28, 2025 15:14\nStock market live updates today: Protean awarded UIDAI mandate to strengthen Aadhaar services across 188 districts in India\nProtean eGov Technologies Ltd. (formerly NSDL e-Governance Infrastructure Ltd.) has been awarded a landmark contract to establish and operate Aadhaar Seva Kendras (ASKs) across 188 districts in the country, by the Unique Identification Authority of India (UIDAI), the statutory authority for Aadhaar, under the Ministry of Electronics and Information Technology (MeitY). This work order is valued at approx. ₹1160 Cr (exclusive of taxes) and the total deal size amounting to approx. ₹1370 Cr crores (inclusive of taxes).\nUnder this mandate, Protean will set up dedicated infrastructure and provide end-to-end managed services for Aadhaar enrolment, demographic/biometric updates, and other walk-in citizen services. This project covers manpower, infrastructure, and hardware deployment, reinforcing Protean’s pivotal role in scaling India’s digital identity ecosystem.\nAugust 28, 2025 15:14\nShare market live news: Manappuram Finance shares traded at Rs 263.45 on the NSE, down 1%. The company signed a deal worth over Rs 4,384 crore with BC Asia Investments and a promoter group.\nAugust 28, 2025 15:13\nStock market live updates: Aimtron Electronics Limited receives an order of 50,000 IIoT and AI devices from Vanix Technologies\nAimtron Electronics Limited, one of India’s fastest-growing Electronics System Design and Manufacturing (ESDM) companies, has received an order of 50,000 Industrial Internet of Things (IIoT) and Artificial Intelligence (AI) devices from Vanix Technologies under the Memorandum of Understanding (MoU) signed in December 2024. Over the next five years, Aimtron will manufacture between 250,000 and 2 million IoT devices, supporting India’s electronics self-reliance and accelerating the adoption of smart manufacturing solutions.\nAugust 28, 2025 15:05\nStock market live updates: Texmaco Rail & Engineering and RVNL partner on rail projects\nTexmaco Rail & Engineering had approved the incorporation of a JV with Rail Vikas Nigam Limited for rolling stock and rail infrastructure projects\nTexmaco Rail shares down 1% on the NSE to ₹136.70, and RVNL was down 1.60% to ₹307.70.\nAugust 28, 2025 15:01\nStock market live updates today: Humro Turns Tariff Challenge into Opportunity With Local Partnerships and Smart Pricing\nHumro (an ARAPL RaaS brand and subsidiary of Affordable Robotic and Automation Limited, BSE: 541402, NSE SYMBOL: AFFORDABLE), a leader in autonomous material handling and robotics solutions, today announced its comprehensive strategy to address recent tariff changes impacting imports into the United States. The announcement comes at a time when the US warehouse automation market is projected to grow at a 20.6% CAGR between 2025 and 2030, rising from USD 5.78 billion in 2024 to nearly USD 16.6 billion by the end of the decade. While acknowledging that the new tariffs translate into roughly seven percent of its topline, the company emphasized that proactive measures are already in place to protect customers and maintain its competitive edge.\nAugust 28, 2025 14:59\nStock market live updates: Ind-Swift Laboratories’ promoter group acquires 45.15 lakh shares\nInd-Swift Laboratories’ promoter group acquired 45,15,495 Equity Shares of face value of INR 10/- each of Ind-Swift Laboratories Limited pursuant to Scheme of arrangement for Amalgamation of Ind-Swift Limited with IndSwift Laboratories Limited .\nInd-Swift Laboratories stock traded flat on the NSE at ₹95.\nAugust 28, 2025 14:56\nShare market live news: Sanathan Textiles commences Commercial Production at its Green Manufacturing Facility in Punjab\nThe Management of Sanathan Textiles Limited is pleased to announce a significant milestone in the Company’s growth journey with the commencement of commercial production at its state-of-the-art manufacturing facility in Wazirabad, Punjab.\nPhase 1 has been commissioned today with the Continuous Polymerisation (CP) line, marking the first step in the Company’s geographical expansion. The facility has commenced production at 350 tonnes per day, which is expected to gradually ramp up to 700 tonnes per day, in the next 3-4 months.\nAfter implementation of Phase 2, the Punjab facility will contribute 950 tonnes per day, enhancing Sanathan Textiles’ total installed yarn- manufacturing capacity from 2,23,750 MTPA at Silvassa to 5,70,500 MTPA across both locations.\nWhile both plants are targeted to operate at optimal utilisation, their commercial focus will be strategically differentiated:\nPunjab will prioritise building a strong local ecosystem and focus on green manufacturing practices, primarily catering to North India’s textile market.\nSilvassa, with its proximity to India’s western ports, will focus on meeting both domestic and export demand, thereby strengthening the Company’s global footprint.\nAugust 28, 2025 14:56\nStock market live updates: Power Mech Projects bags ₹371 crore order from Adani Power arm Mahan Energen\nPower Mech Projects on Thursday said that it has secured an order worth ₹370.84 crore from Adani Power arm Mahan Energen for the execution of civil works at the Mahan Phase-III project in Singrauli, Madhya Pradesh.\nPower Mech Projects bags ₹371 crore order from Adani Power arm Mahan Energen\nMahan Energen Ltd awards Power Mech Projects a ₹370.84 crore order for civil works at Mahan Phase-III project.\nAugust 28, 2025 14:54\nShare market live today: Grip Invest rolls out next-gen ONDC Network-powered Mutual Fund stack, in collaboration with Cybrilla\nGrip Invest, India’s one-stop destination for fixed returns, has announced its successful integration with the Open Network for Digital Commerce (ONDC) Network, powered by Cybrilla Technologies. Grip Invest was able to go live on the network in under 2 months.\n“Financial Services” on ONDC network is designed to simplify and reduce the cost of mutual fund investing, while making it accessible to every Indian. In a major step towards democratizing fixed-income investing in India, Grip Invest has joined the ONDC (Open Network for Digital Commerce) to create a seamless, compliant, and scalable investment ecosystem.\nThis collaboration connects investor demand with a wide range of mutual funds via Cybrilla—making investing more affordable, inclusive, and accessible to all.\nAugust 28, 2025 14:50\nStock market live updates today: Sensex tumbles 720 pts\nAugust 28, 2025 14:50\nStock market live updates: Shrimp stocks on the BSE\nAvanti Feeds (-1.98%), Apex Frozen Foods (-5.49%), Waterbase (-2.62%), Zeal Aqua (-2.65%)\nAugust 28, 2025 14:43\nStock market live: All technologies contributing towards moving to net-zero should be incentivised: Maruti Chairman\nAll technologies contributing towards moving to net-zero should be incentivised: Maruti Chairman\nMaruti Suzuki India Chairman advocates for cleaner cars, reduction of pollution, and GST reduction on small cars for industry growth.\nAugust 28, 2025 14:36\nStock market live today: Adani Energy declines a little over 1% to ₹777.90 on the NSE\nAdani Energy Solutions declined a little over 1% to ₹777.90 on the NSE. The company had incorporated a wholly owned subsidiary named Adani Energy Solutions Step-Fifteen\nAugust 28, 2025 14:35\nStock market live today: Shakti Pumps secures first tranche order worth ₹268.88 cr from Maharashtra\nShakti Pumps informed that pursuant to the Letter of Empanelment from the Maharashtra State Electricity Distribution Company Limited for the supply and installation of 34,720 off-grid DC Solar Photovoltaic Water Pumping Systems under the Magel Tyala Saur Krushi Pump Yojana / PM KUSUM B, the portal was opened and selection completed for the company for the first tranche of 10,000 SPWPS amounting for approximately ₹268.88 Crore (inclusive of GST).\nAugust 28, 2025 14:11\nStock market live today: US tariffs: India must stand up to bullying, says Maruti Chairman RC Bhargava\nUS tariffs: India must stand up to bullying, says Maruti Chairman RC Bhargava\nIndia needs to come together to deal with the 50 per cent punitive US tariffs on Indian products and stand up to any kind of bullying, Maruti Suzuki India Chairman R C Bhargava said on Thursday.\nAugust 28, 2025 14:05\nStock market live updates: Shiv Texchem bags ₹10.72 cr contract from Gujarat Narmada Valley Fertilizers\nShiv Texchem has received Letter of Acceptance from Gujarat Narmada Valley Fertilizers & Chemicals for the Supply of Toluene. The cost of the contract is ₹10.72 crore\nAugust 28, 2025 14:04\nStock market live updates: Dalal Street slumps as 50% tariff shock triggers broad-based selloff; Realty & IT stocks lead the decline\nBenchmark indices witnessed maximum pressure, majorly triggered as the additional 25 per cent tariffs imposed by US President Donald Trump on India came into effect, weighing on investors’ sentiment The cautious mood was further amplified by volatile foreign fund flows and lingering worries about global growth and currency stability.\nCoupled with heavy promoter stake sales in frontline companies like IndiGo, profit booking in recent outperformers, and concerns over stretched valuations, the indices faced broad-based pressure. T\nSensex tumbled 615.39 pts or 0.76 per cent to 80,171.15 at 1.34 pm after hitting an intraday low of 80,093.52. Nifty 50 depreciated by 174.75 pts or 0.71 per cent to 24,537.30.\nSensex tanked nearly 693 pts against the previous close and Nifty dragged 204 pts in the mid-trading session on Thursday.\ntop gainers & losers today Aug 28: Sensex, Nifty 50 drag as broad-based selloff hit Dalal Street amid 50% tariff shock, realty & IT stocks drag the most\nBenchmark indices under pressure due to US tariffs, promoter stake sales, profit booking, stretched valuations, and global concerns.\nAugust 28, 2025 14:00\nStock market live updates: TVS Motor Company expands EV portfolio with TVS Orbiter\nTVS Motor Company launches new EV TVS Orbiter\nEnhancing its presence in the electric scooter segment, TVS Motor Company on Thursday launched its new electric offering, TVS Orbiter\nAugust 28, 2025 13:55\nStock market live updates: Sai Life Sciences completes construction of Phase II block in Bidar\nSai Life Sciences announced the completion of Phase II of its new Production Block at the company’s API manufacturing facility in Bidar, India.\nShares down 4% on the NSE to ₹824.70\nAugust 28, 2025 13:54\nStock market live updates: India’s product exports to the US could reduce to $49.6 billion in FY25: Colin Shah, MD, Kama Jewelry\nPerspective of Colin Shah, MD, Kama Jewelry, on Impact of Trump trade tariffs on gems and jewellery industry in India\n“India’s product exports to the US are at risk, with estimates indicating a possible reduction this year to $49.6 billion from close to $87 billion in 2024–25 since two-thirds of value exports to the US will be subject to 50 per cent tariffs. This threatens India’s gems and jewellery industry specially, as America is its largest market, worth over $10 billion driving almost 30 per cent of the industry’s entire global trade. Exports to America could drop by more than 50 per cent since these tariffs are put in effect, risking both revenues and jobs in major manufacturing clusters.\nA comprehensive urgent policy drive can mitigate the tariff shocks confronting India’s gems and jewellery sector, safeguard jobs and maintain its world leadership. USA tariff headwinds has threatened the Indian natural diamond, gold jewellery, and lab-grown segment demand, although collective reforms can dilute the effect and open up new growth. India is at a juncture to become a world, innovation-driven export destination, but there has to be immediate and definitive reforms to upheld this position. Some of the reforms and actions required are :\n* The labour laws need to be made simpler in order to ensure compliance, contract transparency, and better worker welfare which is the key to enhanced productivity and investments.\n* The pending amendment to the SEZ Act should be notified forthwith to make SEZ units survive and remain competitive especially reverse job work.\n* For e-commerce , India has to compete with international centres such as Dubai and Hong Kong on cost and speed so by lowering logistics compliance and streamlining payments modalities, returns, and freight rules.\n* GST should be simplified with one-stage model to lower compliance costs and blockage of working capital, particularly for exporters on input credits.\n* On the same lines, income tax policies have to be export-oriented with lower rates, simplified transfer pricing laws, and time-bound resolution of disputes. Also Quick refunds are critical for liquidity and competitiveness.\nInterest subvention on export credit, pre- and post-shipment needs to be assured for a minimum of five years to safeguard employment and assist MSMEs in handling the demand cycles.\n* Strategic BTAs with China, Brazil, South Africa, and the EU need to be expedited, emphasizing predictable rules of origin, reduced non-tariff barriers, and safeguards for high-value segments such as certified diamonds and branded jewellery.\n* Key sectors like diamond cutting, gold jewellery, synthetic gemstones, and parts need to be facilitated by finance access, traceability standards, and compliance with international trade regulations . This would stabilise orders and promote investment.\nIt is extremely important for India to position itself as a dependable, price-competitive, and policy-stable world export leader. These reforms if put to action can reduce the impact of Trade tariffs on the Indian Gems and Jewellery industry.”\nAugust 28, 2025 13:29\nStock market live updates today: Sensex, Nifty extend losses as US tariff impact weighs on export stocks\nBenchmark indices remained under pressure during midday trading on Thursday, with the Sensex down 446.01 points or 0.55 per cent at 80,340.53 and the Nifty 50 declining 120.90 points or 0.49 per cent to 24,591.15 as of 12.30 pm. The markets opened lower at 80,754.66 for the Sensex from the previous close of 80,786.54.\nSensex, Nifty extend losses as US tariff impact weighs on export stocks \nBenchmark indices remained under pressure during midday trading on Thursday, with the Sensex down 446.01 points or 0.55% at 80,340.53 and the Nifty 50 declining 120.90 points or 0.49% to 24,591.15 as of 12.30 pm.\nAugust 28, 2025 13:27\nStock market live updates today: Seamec Ltd’s vessel “SEAMEC SWORDFISH” off-hired due to breakdown, which is being rectified. Upon rectification of the defect, the vessel will go back on charter\nAugust 28, 2025 13:27\nStock market live updates today: Manorama Industries board approves execution of MoU with National Office for Major Projects of Burkina Faso; stock down on NSE\nManorama Industries board approves execution of MoU with the National Office for Major Projects of Burkina Faso (The Government of Burkina Faso) for a new factory focused on the processing plants of Shea Nuts & Mango Kernels. \nManorama Industries stock down 1.45% on the NSE to ₹1,352.\nAugust 28, 2025 13:22\nStock market live updates today: Sampre Nutritions enters manufacturing agreement with Tolaram Wellness Ltd for nutraceutical and food products\nAugust 28, 2025 13:22\nStock market live news: Schneider Electric Infrastructure board appoints Omkar Prasad as Chief Financial Officer w.e.f September 16, following the resignation of Suparna Banerjee Bhattacharyya\nAugust 28, 2025 13:21\nStock market live updates today: TVS Motor Company launches new electric offering, TVS Orbiter, at ₹99,900; shares flat on NSE\nTVS Motor Company (TVSM) launches its new electric offering, TVS Orbiter. Designed for everyday commutes, the TVS Orbiter combines several segment-first features such as a 158 km IDC range, cruise control, 34-litre boot space, hill hold assist, and advanced connected features. With an industry-first 14” front wheel, the scooter delivers unmatched comfort, convenience, and performance, at an attractive price of ₹99,900 (ex-showroom, inclusive of PM e-Drive scheme, Bengaluru).\nShares flat at ₹3,274.80 on the NSE.\nAugust 28, 2025 13:19\nStock market live news: United Breweries trades flat at ₹1,852.50 on NSE after opening at ₹1,891.50, against previous close of ₹1,853.80. Board approves ₹90-crore investment in its Telangana brewery\nAugust 28, 2025 13:16\nStock market live news: SBI Cards stock trades at ₹801.15 on NSE after opening at ₹809.65, against previous close of ₹815.70. Company and Flipkart have together launched ‘Flipkart SBI Credit Card’\nAugust 28, 2025 13:15\nStock market live updates today: Biocon shares flat on NSE; Biocon Pharma, a wholly-owned arm of Biocon, gets tentative USFDA approval for its ANDA for Sitagliptin Tablets USP\nBiocon shares flat on NSE at ₹359.30. Biocon Pharma Ltd, a wholly-owned arm of Biocon, receives tentative approval from US Food and Drug Administration for its ANDA for Sitagliptin Tablets USP, in 25 mg, 50 mg and 100 mg strengths.\nAugust 28, 2025 13:12\nStock market live updates today: Renisha Chainani, Head of Research at Augmont, on gold price movement\nAmid worries about the independence of the Federal Reserve following President Trump’s threats to fire Fed Governor Lisa Cook, gold prices remained close to their two-week high due to their safety appeal.\n· At the Fed’s policy meeting next month, markets are expecting a 25 basis point rate cut, which is more than 88% likely, according to the CME FedWatch Tool.\n· Markets seem to be confident that a new wave of U.S. tariffs might weaken global strength, making trade policy another crucial factor for gold. An additional factor supporting gold’s safe-haven bid could be ongoing geopolitical danger, such as Ukraine’s increased attacks on Russian energy infrastructure.\nTechnical Triggers\n· Gold Oct Futures are expected to continue their upside momentum towards $3485 (~Rs 102,500), if it sustains above $3445 (~Rs 101,500).\n· As Silver Sep Futures has broken its range and sustained above $38.80 (~Rs 116,000), upside momentum can swing prices towards a new high of $40 (~Rs 120,000) this week.\nAugust 28, 2025 13:11\nStock market live updates today: IndiGo Share Price LIVE: Gangwal family stake sale drags IndiGo shares by 5%\nHere’s what Nitant Darekar Research Analyst of Bonanza says on IndiGo stock following the block deal \nAugust 28, 2025 13:10\nStock market live updates today: Acme Solar Holdings stock rose 1.5% to ₹289.95, hitting an intraday high of ₹291.85. The board approves proposal to raise ₹3,000 crore in multiple tranches\nAugust 28, 2025 13:09\nStock market live updates today: Jaiprakash Power Ventures stock locked in upper circuit on NSE at ₹18.95, up 5%. It had announced plans to set up a ₹300-crore solar power project in Madhya Pradesh\nAugust 28, 2025 13:08\nStock market live news: HCLTech in tie-up with Pearson India and strategic advisory of MeitY Startup Hub, today launched ARISE FOR YOU, an initiative to ignite the entrepreneurial spirit of youth\nAugust 28, 2025 13:06\nStock market live updates today: Acme Solar Holdings stock rises 1.5% to ₹289.95, hitting intraday high of ₹291.85. Board approves proposal to raise ₹3,000 crore in multiple tranches\nAugust 28, 2025 13:05\nStock market live news: PFC shares flat on NSE at ₹385.85. Company inks performance evaluation pact with Power Ministry for annual target framework against which its FY26 achievement will be assessed\nAugust 28, 2025 13:04\nStock market live updates today: Ola Electric shares zoom 8% on the NSE to ₹54.80\nAugust 28, 2025 13:03\nStock market live updates today: IPO News Live Today: Mangal Electrical shares down to ₹545 level, Vikran Engineering IPO subscribed 3.91 times so far on Day 2, Anlon Healthcare booked 2.52 times\nMangal Electrical IPO listing today live, Vikran Engineering & Anlon Healthcare enters Day 2, Globtier Infotech, NIS Management IPO news live updates today: \nAugust 28, 2025 13:02\nStock market live updates today: PVP Ventures board approves acquisition of majority stake in 7Med India; stock down on NSE\nPVP Ventures board approves proposal for acquisition of a majority stake in 7Med India Pvt. Ltd, a healthcare enterprise headquartered in the Delhi NCR region.\nThe transaction will be a combination of both primary and secondary stake purchase amounting to an outlay of circa ₹127 crore for this majority shareholding.\nPVP Ventures stock traded at ₹20.35 on the NSE, down 2.77%.\nAugust 28, 2025 13:00\nStock market live updates today: Power & Instrumentation (Gujarat) bags ₹9.50-crore work order from Sadashiv Projects; shares edge down on NSE\nPower & Instrumentation (Gujarat) has received a work order for ₹9.50 crore from Sadashiv Projects India Private Ltd for Design, Engineering, Supply, Testing for 5.00 MWP Solar Ground Mounted, Including Material Supplies & Services, at locations in Gujarat\nPower & Instrumentation (Gujarat) shares traded at ₹147.05 on the NSE., down 1.97%.\nAugust 28, 2025 12:57\nStock market live updates today: Dr. Agarwal’s Health Care and Dr. Agarwal’s Eye Hospital announce merger; shares of both companies drop sharply\nDr. Agarwal’s Health Care (AHCL) and Dr. Agarwal’s Eye Hospital (AEHL) have announced their merger. \nA stock exchange filing said the merged entity inter-alia brings together significant complementarities that exist between both the entities and is poised to create meaningful value for various stakeholders, including respective patients, employees, and shareholders of both entities. The merger will consolidate the businesses of AHCL and AEHL into a single entity, enabling operational and financial efficiencies through streamlined functions and agile decision-making.\nDr. Agarwal’s Eye Hospital stock fell 12.35% on the BSE to ₹4,510.\nDr. Agarwal’s Health Care stock declined 5.38% to ₹434.90.\nAugust 28, 2025 12:54\nStock market live updates today: HDFC Bank allots bonus issue in the ratio of 1:1\nAugust 28, 2025 12:53\nStock market live updates today: 6 MW solar power plant fully operational at Andhra Cement’s manufacturing plant in Palnadu district of Andhra Pradesh; stock gains on NSE\nAndhra Cements said the implementation of a 6 MW Solar Power Plant has been successfully completed and is now fully operational at the company’s cement manufacturing plant at Gamalapadu village in Palnadu district of Andhra Pradesh as part of Green Energy initiative.\nAndhra Cements stock rose 2% on the NSE to 90.58\nAugust 28, 2025 12:50\nStock market live updates today: Ramco Systems to implement its aviation software at United Aerospace Maintenance Company, a provider of aircraft maintenance, repair and overhaul services.\nAugust 28, 2025 12:49\nStock market live updates today: Power Mech Projects secures ₹370.84-crore order from Mahan Energen, a subsidiary of Adani Power; shares down on NSE\nPower Mech Projects has secured a ₹370.84-crore order from Mahan Energen Ltd (MEL), one of the subsidiaries of Adani Power Ltd, for execution of civil works and erection of Prefabricated Structural Steel for BTG Unit 1 & 2 for Mahan Phase-III (2 x 800 MW), Mahan Energen Limited, Singrauli, Madhya Pradesh.\nPower Mech shares down 1.80% to ₹3,074 on the NSE\nAugust 28, 2025 12:29\nStock market live updates today: SAMHI Hotels signs lease deal for 260-room hotel in Hyderabad Financial District\nSAMHI Hotels Limited has signed an Agreement to Lease with Aurean Eskar and other lessors for a 260-room mid-scale hotel in Hyderabad’s Financial District. The hotel will be developed as part of a mixed-use project, with SAMHI’s estimated development cost ranging from ₹12.5 crore to ₹14.3 crore for fitouts and branding.\nSAMHI Hotels signs lease deal for 260-room hotel in Hyderabad Financial District \nSAMHI Hotels signs lease agreement for 260-room hotel in Hyderabad's Financial District, expanding presence in the market.\nAugust 28, 2025 12:28\nStock market live updates today: Auto stocks in focus on GST cut hopes despite tepid festival sales\nTata Motors shares fell 1.32 per cent to ₹672.65 on Wednesday as investors weighed mixed signals from the automotive sector amid speculation about potential goods and services tax (GST) cuts.\nAuto stocks in focus on GST cut hopes despite tepid festival sales \nTata Motors shares drop amid speculation of GST cuts, with Jefferies maintaining underperform rating and raising target price.\nAugust 28, 2025 12:27\nStock market live updates today: Piccadily Agro hits record single malt sales milestone\nPiccadily Agro Industries Limited shares traded at ₹591.50, down 0.73 per cent from Tuesday’s close of ₹595.85, despite announcing record-breaking sales figures for its flagship Indri single malt whisky brand.\nPiccadily Agro hits record single malt sales milestone \nPiccadily Agro Industries Limited stock price drops despite record-breaking sales for Indri single malt whisky brand.\nAugust 28, 2025 12:26\nStock market live updates today: TCS shares dip 1.18%, announces new Philippines pharma deal\nTata Consultancy Services (TCS) shares traded at ₹3,120 at 11:50 AM on Thursday, down 1.18 per cent from the previous close of ₹3,157.20, The company announced a strategic partnership with Philippines pharmaceutical major Unilab Inc.\nTCS shares down 1.18%, new Philippines pharma deal declared\nTata Consultancy Services shares traded at ₹3,120 at 11.50 AM on Thursday, down 1.18%. The company announced a strategic partnership with Philippines pharmaceutical major Unilab Inc.\nAugust 28, 2025 11:40\nStock market live updates today: Mangal Electrical shares trade at ₹550 level after muted debut\nShares of Mangal Electrical Industries Ltd made a muted debut on bourses, listing at a discount against the issue price of ₹561.\nMangal Electrical shares trade at ₹550 level after muted debut, lists below issue price of 561\nShares of Mangal Electrical Industries Ltd made a muted debut on bourses, listing at a discount against the issue price of ₹561.\nAugust 28, 2025 11:39\nStock market live updates today: IndiGo Share Price LIVE: Shares down over 4% after Gangwal family’s block deal\nTrack IndiGo share price movements live here\nAugust 28, 2025 11:34\nStock market live updates today: Commodity call. Copper: Range bound and unclear; wait for bearish breakdown to go short\nCopper prices are stuck in a sideways range for almost three months now. The Copper Futures contract traded on the Multi Commodity Exchange (MCX) has been oscillating between ₹860 and ₹906 per kg since the second week of June this year. Indeed, the range has narrowed down to ₹868 and ₹895 since the beginning of this month. Within this range, the contract is currently trading at ₹885 per kg.\nCopper: Range bound and unclear; wait for bearish breakdown to go short\nMCX Copper Futures contract has been oscillating between ₹860 and ₹906 per kg\nAugust 28, 2025 11:33\nStock market live updates today: Merchant association seeks EMI facility for gold jewellery purchase to boost retail biz\nThe All Kerala Gold & Silver Merchants Association has requested the Union Finance Ministry to enable EMI facility for gold jewellery purchase. This would empower middle-income households to plan their purchases and boost overall retail growth. they stated.\nMerchant association seeks EMI facility for gold jewellery purchase to boost retail biz\nAll Kerala Gold & Silver Merchants Association seeks EMI facility for gold purchases to boost retail growth and accessibility.\nAugust 28, 2025 11:19\nStock market live updates today: Adani Group portfolio companies’ EBITDA crosses ₹90,000 cr milestone for first time\nAnnouncing the financial performance of the companies in its portfolio, the Adani Group on Thursday said the EBITDA (short for earnings before interest, taxes, depreciation and amortization) for the companies crossed the ₹90,000 crore milestone on a Trailing-Twelve-Month (TTM) basis for the first time with the first quarter EBITDA for FY2026 reaching a record high. \nAdani Group portfolio EBITDA crosses ₹90,000 cr milestone for first time\nThe Adani Group on Thursday said the EBITDA for the companies crossed the Rs 90000 crore milestone for first time with first quarter EBITDA for FY 2026.\nAugust 28, 2025 11:11\nStock market live updates: Mahindra Holidays has appointed Vineet Bhardwaj as the Chief Technology Officer of the Company with effect from September 01, 2025.\nAugust 28, 2025 11:11\nShare market live news: TCS announces partnership with Unilab Inc.\nTata Consultancy Services (TCS) announced a partnership with Unilab, Inc., a leading pharmaceutical and healthcare company in the Philippines, to modernise its core business systems through a strategic cloud migration.\nShares dip 0.94% on the NSE to ₹3,127.60.\nAugust 28, 2025 11:10\nStock market live updates: Cipla trades flat on the NSE at ₹1,581.80\nCompany is recalling over 20,000 packs of a medication, used to treat asthma and certain types of chronic obstructive pulmonary disease in the US, according to the US health regulator.\nAugust 28, 2025 10:52\nStock market live updates today: Nifty Bank Prediction Today – August 28, 2025: Nifty Bank futures: Index might see a corrective rally\nNifty Bank index opened today’s session lower at 54,256 compared to Tuesday’s close of 54,450. It slipped further after opening and is currently hovering around 54,100, down 0.6 per cent.\nNifty Bank Prediction Today – August 28, 2025: Nifty Bank futures: Index might see a corrective rally\nNifty Bank index opened today’s session lower at 54,256 compared to Tuesday’s close of 54,450. It slipped further after opening and is currently hovering around 54,100, down 0.6 per cent.\nAugust 28, 2025 10:52\nStock market live updates today: RateGain and Profitroom in strategic partnership to strengthen MEA Hotels distribution capabilities; RateGain shares rise nearly 2% on the NSE to ₹521.85\nAugust 28, 2025 10:51\nStock market live updates today: Dr Reddy’s Labs trades flat on NSE; the company has has received an interim stay on tax reassessment proceedings related to its merger with Dr. Reddy’s Holding\nDr Reddy’s Laboratories traded flat on the NSE at ₹1,253.70. It had received an interim stay from the Telangana High Court on income tax reassessment proceedings related to its merger with Dr. Reddy’s Holding Ltd. Dr Reddy’s Laboratories on Saturday said it had received a show cause notice from the income tax authority, with a proposed demand of over ₹2,395 crore related to the merger of Dr Reddy’s Holding Ltd (DRHL) with itself.\nAugust 28, 2025 10:49\nStock market live updates today: BSE shares traded flat on the NSE at ₹2,220.30. BSE Ltd arms, BSE Investments & BSE Administration and Supervision, to merge with BSE Technologies\nAugust 28, 2025 10:45\nStock market live updates today: Nifty Prediction Today – August 28, 2025: Nifty 50 Futures: Breaks a key support. Go short now and on a rise\nNifty 50 continues to get beaten down. The index has declined further and is currently trading at 24,590, down 0.49 per cent. The advances/declines ratio is at 17:33. This is clearly negative and indicates the danger of seeing more fall.\nNifty Prediction Today – August 28, 2025: Nifty 50 Futures: Breaks a key support. Go short now and on a rise\nNifty 50 continues to get beaten down. The index has declined further and is currently trading at 24,590, down 0.49 per cent. The advances/declines ratio is at 17:33. This is clearly negative and indicates the danger of seeing more fall.\nAugust 28, 2025 10:44\nStock market live updates today: Sundararaman Ramamurthy, MD & CEO, BSE, on the impact of the US tariff\n“India has successfully weathered past global shocks, from COVID-19 to supply chain disruptions, and continues to stand resilient as the world’s fourth-largest economy. The recent U.S. tariff hikes are expected to have minimal impact, with most Indian trade safeguarded by diversification and key exemptions in areas like pharmaceuticals, smartphones, electronics, and renewable energy. Strong domestic demand, ‘Make in India’ initiatives, and fresh trade agreements are reinforcing investor confidence, while rising household and institutional participation keeps India’s capital markets attractive. The country’s robust fundamentals and policy measures will ensure that FPI and FDI inflows remain steady, limiting any long-term effect from the tariff move. These strengths together underpin India’s journey towards Viksit Bharat by 2047, strengthening its position as a global economic leader.”\nAugust 28, 2025 10:43\nStock market live updates today: Valiant Communications board to consider bonus issue on September 3\nAugust 28, 2025 10:43\nStock market live updates today: ATV Projects India inks Memorandum of Understanding along with the Term sheet with Shri Vrinda Infracon to develop unutilised land at ATV Nagar Mathura\nAugust 28, 2025 10:41\nStock market live updates today: Textile stocks in focus: Welspun Living (-1.12%), Gokaldas Exports (+0.52%), Arvind (-1.06%), KPR Mill (-0.42%)\nAugust 28, 2025 10:29\nStock market live updates today: Rakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr; shares fall over 4%\nInterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for ₹7,027.7 crore through separate block deals on Thursday.\nRakesh Gangwal, family trust sell 3.1% stake in IndiGo for ₹7,027 cr; shares fall over 4%\nInterGlobe Aviation promoter Rakesh Gangwal and his family trust divested up to a 3.1 per cent stake in IndiGo for ₹7,027.7 crore through separate block deals on Thursday.\nAugust 28, 2025 10:28\nStock market live updates today: IPO News Live Today: Mangal Electrical makes muted debut at ₹556 on NSE, Vikran Engineering & Anlon Healthcare enter Day 2\nTrack post listing price movements of Mangal Electrical live here\nAugust 28, 2025 10:27\nStock market live updates today: Mangal Electrical Industries stock traded near ₹559 level after listing at ₹556 on the NSE, down 0.89% the IPO-price of ₹561. On the BSE, the stock debuted at ₹558\nAugust 28, 2025 10:23\nStock market live updates today: Crude oil futures fall as markets weigh US tariffs on India\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22\nCrude oil futures fall as markets weigh US tariffs on India\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22.\nAugust 28, 2025 10:23\nStock market live updates today: Markets open lower as 50% US tariffs on Indian goods take effect\nMarkets opened in negative territory on Thursday morning as the 50 per cent US tariff on Indian goods came into effect, with the Nifty 50 starting at 24,711.50 from its previous close of 24,712.05 and trading at 24,586.80, down 125.25 points or 0.51 per cent, at 9.55 am. The Sensex opened at 80,754.66 against its previous close of 80,786.54 and was at 80,378.10, lower by 408.44 points or 0.51 per cent, at the same time.\nMarkets open lower as 50% US tariffs on Indian goods take effect \nMarkets open negatively as US tariffs on Indian goods take effect, with sectors facing pressure and certain stocks showing resilience.\nAugust 28, 2025 10:22\nStock market live updates today: Rupee rises 10 paise to 87.59 against US dollar in early trade\nThe rupee rose 10 paise to 87.59 against the US dollar in early trade on Thursday, supported by a weaker dollar index and easing Brent crude prices.\nRupee rises 10 paise to 87.59 against US dollar in early trade\nRupee strengthens against US dollar due to weaker dollar index, easing Brent crude prices, RBI intervention, and FII outflows.\nAugust 28, 2025 10:02\nStock market live updates today: InterGlobe Aviation shares are down 4% on the NSE to ₹5,787 following block deal.\nAugust 28, 2025 09:35\nStock market live updates today: Brokerage view\nJefferies on Auto Sector\nA potential GST cut should provide a boost to auto demand, especially in 2Ws and small PVs\nRaise FY26-28E 2W & PV industry volumes by 2-6%, driving 2-8% EPS upgrades for TVSL, HMCL, MSIL and HYUNDAI\nExpect TVSL & MM to deliver highest 27% & 19% FY25-28E EPS CAGR respectively\nHero Moto - Upgrade to Hold from Underperform; Hike TP to Rs 5,200 from Rs 3,800\nTVS Motor - Maintain Buy; Hike TP to Rs 4,250 from Rs 3,500\nMaruti - Maintain Buy; Hike TP to Rs 17,500 from Rs 14,750\nHyundai - Maintain Underperform; Hike TP to Rs 2,000 from Rs 1,700\nBajaj Auto - Maintain Hold; Hike TP to Rs 9,000 from Rs 8,000\nEicher - Maintain Buy; Hike TP to Rs 6,925 from Rs 6,500\nM&M - Maintain Buy; Hike TP to Rs 4,200 from Rs 4,000\nTata Motors - Maintain Underperform; Hike TP to Rs 575 from Rs 550\nAshok Leyland - Maintain Hold with TP of Rs 120\nNuvama on Maruti\nTarget price - Rs 14300 (maintain Buy)\nMSIL’s first EV: eVitara production kicks off\nSMG plant capacity of 0.75mn is being expanded to 1mn in FY27E with the new line being fungible across powertrains\neVitara is being rolled out at SMG at investment of Rs 2,200cr, and shall be sold in 100-plus countries including Europe, Japan and India\nProduction planned at 70,000-plus units in the first 12 months\nSuzuki group company TDSG has invested Rs 4,270cr, and has capacity of 18mn cells for hybrids, which is being expanded to 30mn cells\nElara Securities | Auto Dealer Checks (Ganesh Chaturthi Day 1)\n2W: Low-single digit growth YoY; postponements in many regions on GST cut hopes\nRural: GST impact awareness low → steady buying continues\nRoyal Enfield: Outperformed (low base + GST confusion benefit)\nPV: More postponements (big-ticket buyers more sensitive to GST news)\nElara: Even small growth for 2W is a positive signal\nMacquarie on Telecom Sector\nReliance Jio’s pivot to ‘value over volume’ drives a stronger EBITDA growth outlook relative to Bharti\nEBITDA growth driven by ARPU improvements in stealth and operating leverage; Jio > Bharti\nCapex intensity to moderate for both Jio, Bharti; VI spend requires external financing\nROIC improvement highest for Tata Comm\nBharti Hexacom – Maintain Underperform; Cut TP to Rs 1,380 from Rs 1,480\nVodafone Idea – Maintain Underperform; Cut TP to Rs 5 from Rs 6.5\nReliance - Maintain Outperform; Hike TP to Rs 1,650 from Rs 1,580\nAirtel - Maintain Outperform with TP of Rs 2,050\nTata Communications - Maintain Outperform with TP of Rs 2,210\nIndus Towers – Maintain Underperform with TP of Rs 300\nAvendus on Aluminium\nTariff led Metal fever to break & Scrap market tightness to deepen –Dual headwinds\nPotential decline in metal price & recycling margins are 2 key risks\nReiterate -ve stance\n1)Hindalco- SELL; TP Rs 615; at CMP stk fully prices in continuation of superior margins in India ops & margin reversal in Novelis to$500/tn (vs$430/tn in Q1’26) Benefits of BayMinette expansion is atleast 15M away\nb) Nalco- REDUCE; TP Rs 185)– metal price decline to weigh on earnings trajectory; attach low probability of meaningful recovery in Alumina prices led by rising global supply\nMS on NBFCs\nSince March 2025, have been flagging downside risks to consensus estimates\nThis has started playing out visibly in 1QF26 results\nThink investors should stay selective and look for margin of safety\nIn large caps, are OW on BAF, PFC, REC, SHMF and Muthoot & EW on Chola\nIn small / mid-caps, OW on Aptus, Home First, AB Cap and Can Fin Homes\nRetained OW on PNBHF on fundamentals; however, uncertain outlook is likely to weigh on stock in near term\nJPM on OMCs\nStocks are cheap on FY27 earnings projections that build in a http://c.Rs.3-4 per liter increase in petrol/diesel excise duties (lower OMC margins).\nThere should be little downside even if taxes on these companies are raised.\nHowever, longer Gov’t stays away, more cash flow these cos accrue.\nThis should help drive stocks up near term; Prefer BPCL\nCLSA on OMCs\nBenefit from Russian oil imports way less than exaggerated media numbers\nIndia gets 36% of oil imports from Russia, which supplies c.5% of global demand\nOil prices could rise to US$90-100/bbl if India stops importing Russian oil\nBelieve issue of Russian crude oil imports has now become a political one with India reiterating its freedom to choose its trade partners within purview of global trade rules\nHSBC On OMCs\nGiven lower oil prices and reduced LPG losses, expect strong earnings; any pay-outs for under-recoveries a positive\n1Q earnings lower than estimated due to higher inventory losses; marketing margins strong, while LPG losses reduced\nMaintain Buy ratings on BPCL – TP Rs 420, HPCL – TP Rs 520, & IOC – TP Rs 190\nAntique on Textiles\nHigher tariffs to impact US textile exports\nEnforcement of reciprocal tariffs will lead to potential tariff burden of ~62%-65% on textile and apparel exports\nLower tariffs on competing countries-China (30%), Bangladesh (20%), Pakistan (19%), and Vietnam (20%)\nIndia at a relative disadvantage to key competitors\nWe expect Indian exports to remain impacted unless the country concludes a trade deal with the US\nArvind and Welspun Living have US exposure of 38% and 60% respectively\nWe downgrade Arvind to Hold with a revised target price of Rs 330 (previously Rs 453)\nContinue to maintain Hold on Welspun Living, target price Rs 132 (vs Rs 155 earlier) and KPR Rs 1,055\nMOSL on Adani Ports\nRecommendation Buy\nTarget Price ₹1,700\nCharting a transformational journey\nBuilding scale and market leadership in ports\nLogistics business - growing exponentially\nMarine services: A fast-growing, capital-efficient growth engine\nMorgan Stanley on Real Estate\nResidential Sales Robust in July\nPropequity data shows good sales growth, despite fewer new launches, leading to a slight dip in inventory\nPrice growth moderated vs. last two quarters but stayed strong\nMumbai and Bangalore were stronger than other cities\nJefferies on ICICI Bank\nRecommendation Buy\nTarget Price ₹1,760\nFY25 annual report and 20F show that risk profile of assets has risen\nSee a rise in share of lower-rated loans (SME) & RWA/ assets, but quality has held up and credit costs stay low\nNPLs highest in 5 years\nPSL is improving and will limit drag from compliance cost\nJefferies on Polycab\nBuy, TP Rs 8180\nOver past 12 qtrs, Co has consistently delivered double-digit C&W sales growth, with steady 12-15% EBIT margin\nDiverse sales stream (B2G (eg: power, mobility) est 30%; B2B private capex: 35%; Housing 20%, Exports 6%; FMEG 10%), market share gains (27% now; +10% in 5Y), power capex, FMEG margin turnaround & strong order books in RDSS & Bharat Net are key drivers\nEst FY25-28e EPS CAGR at +26%; FY27e PE now at 32x, inline with its hist 5Y avg\nJefferies on Consumer Fin\nFor Jul-25, industry credit card spending growth moderated MoM to 12% YoY (15%, Jun-25), lowest since Mar-25; card vol growth was stable at 7% YoY\nSBI Cards, spending grew 21% YoY (stable MoM) & its spending market share was steady at 17%\nIts card volume growth was steady at 10% YoY as it stays cautious towards new card additions.\nAmong key players, spending share of ICICI rose MoM, while that of HDFCB and Axis fell slightly MoM\nRetain Hold on SBI Cards\nInvestec on RBL BK\nBuy, TP Rs 300\nNDR Takeaways\nManagement highlighted RoA should trend upwards to 1% by Q4, primarily aided by normalisation of NIMs (which at 4.5% in 1Q have largely bottomed unless there are further repo rate cuts, per management)\nBank expects loan growth in FY26 to trend 3-4ppts higher than industry (ie 13-14%)\nOn asset quality, it sees trends in both MFI & cards (85% of net slippages) improving through course of year (< 2% FY26 credit cost guidance vs 1.9% in 1Q)\nOn capital front (CET1 at 14%), bank will be taking an enabling board resolution for potential raise in FY26 – it intends to improve RoA delivery 1st before any potential dilution\nMOSL On Coforge\nBuy, TP Rs 2240\nManagement meet key takeaways\nCo highlighted that while industry-wide demand remains mixed, budgets are opening up for vendors that can deliver outcome-driven solutions\nCoforge aiming to sign at least 20 deals above $20m in FY26 (five done so far)\nCo ’s FY26 EBIT margin guidance stands at 14%\nManagement also expects cash flow conversion to improve meaningfully going fwd\nSBI Research on Tariffs\nUS imposes 50% tariff on ~$45 Bn of Indian exports\nSectors hit most: Textiles, gems & jewellery, seafood; pharma & smartphones exempt\nWorst scenario India’s trade surplus will convert to trade deficit\nHowever, we believe trade negotiations will restore confidence and improve export to US\nTextiles impact: With 50% tariff, India loses competitiveness vs China (30%), Vietnam (20%), Indonesia (19%), Japan (15%)\nGems & jewellery: $10 Bn exports hit; US = ~⅓rd of sector’s $28.5 Bn shipments\nSeafood (esp. shrimp): Over half exports to US, now face cancellations, rivals (Ecuador) benefit\nWe believe that US tariffs is likely to affect US GDP by 40-50 bps and higher input cost inflation\nAugust 28, 2025 09:34\nStock market live updates today: Top gainers and losers on Nifty 50\nTop gainers: Hero Motocorp (+1.51%), Eternal (+1.05%), Asian Paints (+0.63%), Eicher Motors (+0.55%), HUL (+0.42%)\nTop losers: HCL Tech (-2.12%), Shriram Finance (-2.02%), HDFC Bank (-1.80%), Jio Financial (-1.38%), Power Grid (-1.32%)\nAugust 28, 2025 09:34\nStock market live updates today: Highway Infrastructure Ltd launches project under the name ‘Neww York City – Phase-4’ Opposite SAGE University, Indore; shares down on NSE\nAugust 28, 2025 09:32\nStock market live updates today: Power Grid Corporation declared bidder under tariff-based bidding for Inter-State Transmission System; shares down on NSE\nPower Grid Corporation of India has been declared as bidder under tariff-based competitive bidding to establish an Inter-State Transmission System for a project for “Transmission system strengthening at Davanagere for Integration of RE generation” under Build, Own, Operate and Transfer (BOOT) basis.\nPower Grid Corporation of India shares down 1% to ₹276.90 on the NSE.\nAugust 28, 2025 09:29\nStock market live news: Shilpa Medicare arms inks pact with Pharma Pharmaceutical Industries & Biological Products for joint venture pharma facility in Saudi Arabia; Shilpa Medicare shares up\nKoanna International FZ LLC, UAE (‘Koanna), a wholly-owned subsidiary of Shilpa Medicare Ltd, has entered into a definitive agreement with Pharma Pharmaceutical Industries & Biological Products (PPI), a prominent Saudi enterprise, to form a new joint venture company based in Saudi Arabia to build a new pharma manufacturing facility in Saudi Arabia.\nShilpa Medicare shares up 1% on the NSE to ₹825.\nAugust 28, 2025 09:24\nStock market live updates today: SAMHI Hotels, through wholly-owned arm, inks lease agreement for mid-scale hotel in Hyderabad’s financial district; shares flat on NSE\nSAMHI Hotels, through its wholly-owned subsidiary Barque Hotels Private Ltd, announced the signing of an Agreement to Lease (“ATL”) with Mrs. P Pramoda, Mrs. P Harika, and Aurean Eskar (collectively the “Lessors”) for a ~260-room Mid-scale hotel to be developed as part of a mixed-use project in Hyderabad’s financial district. \nShares flat on the NSE at ₹208.19\nAugust 28, 2025 09:22\nStock market live: Sensex tanked 483.82 points or 0.60% to 80,302.72 at 9.17 am, after opening flat at 80,754.66 against previous close of 80,786.54. Nifty 50 fell 118.10 points (0.48%) to 24,593.95\nAugust 28, 2025 09:17\nStock market live updates today: Crude oil futures trade lower\nCrude oil futures traded lower on Thursday as markets assessed the impact of US secondary tariffs on India, despite a decline in US crude oil inventories for the week ending August 22. At 9.13 am on Thursday, November Brent oil futures were at $66.97, down by 0.36 per cent, and October crude oil futures on WTI (West Texas Intermediate) were at $63.63, down by 0.81 per cent. September crude oil futures were trading at ₹5584 on Multi Commodity Exchange (MCX) during the initial hour of trading on Thursday against the previous close of ₹5618, down by 0.61 per cent, and October futures were trading at ₹5555 against the previous close of ₹5589, down by 0.61 per cent.\nAugust 28, 2025 09:17\nStock market live updates today: Import duty exemption on cotton extended till December 31, 2025\nNews Update: Government extends import duty exemption on cotton (HS 5201) till December 31, 2025. Exemption was earlier valid from August 19 to September 30, now extended till year-end. (Decision important for textile and yarn companies)\nShilp Medi Arm in JV agmt with Pharma Pharmaceutical Industries & Biological Products, Saudi to build a new pharma manufacturing facility in Saudi Arabia (Supportive for stock prices)\nAugust 28, 2025 09:04\nStock market live updates today: Global bits\nUnited States (US): Stocks hit record highs, Powell pivot in focus, tariffs on India weighing on trade, housing demand weak, yields volatile as Trump targets Fed.\nIndia: Growth likely slowed to 6.7% in Apr–Jun; hit by steep US tariff hikes on exports; gold demand resilient.\nChina: Stocks at decade high with strong hedge fund inflows; industrial profits continue to decline; solar sector faces heavy losses.\nSouth Korea: Central bank holds rates citing debt risks; export growth threatened by US tariffs; seeks non-binding US trade deal.\nJapan: Government drafts record debt-servicing budget; remains alarmed over yen volatility; high debt costs a concern; seafood inflation worsens with warming seas.\nHong Kong: July home prices edge up 0.4% m/m; Meituan profit slips under fierce competition.\nAustralia: Inflation tops forecasts due to power prices; RBA signals more rate cuts ahead.\nCanada: Central bank rules out review of 2% inflation target next year.\nGermany: Consumer sentiment dips on job fears; exports hit by US tariffs; industry sheds 250k jobs; business sentiment improves despite downturn.\nUK: Retail downturn extends to 11 months; shop prices rise sharply; producer inflation at 2-year high.\nRussia: Gazprom Neft profit falls 54% amid weak energy markets.\nSingapore: Core inflation up 0.5% y/y in July, below expectations.\nMiddle East (Dubai): Gold demand rises as prices hit two-week high on Fed tensions.\nSource: Reuters\nAugust 28, 2025 09:04\nStock market live updates today: NVIDIA\n- Adj EPS $1.05 (est $1.01)\n- Rev. $46.7B (est $46.23B)\n- Data Center Revenue $41.1B (est $41.29B)\n- Gaming REV. $4.3B (est $3.82B)\n- Sees Q3 Revenue $54B Plus Or Minus 2% (est $53.46B)\n- Approves Additional $60B To Share Buyback\n- Has Not Assumed Any H20 Shipments To China In Outlook\n- No H20 Sales To China-Based Customers In Q2\n(Numbers and guidance seen in line with the estimates)\nAugust 28, 2025 09:03\nStock market live updates today: Nvidia beat earnings, again, but the stock was down 4%.\n■Sales hit $46.7B (up 56% YoY)\n■EPS: $1.05 vs $1.01 est\n■Data center missed slightly at $41.1B\n■Networking flat at $5.1B\nFor next quarter, Nvidia is guiding for $54B in sales and 74% margins. They also approved a $60B buyback.\nhttps://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-second-quarter-fiscal-2026\nAugust 28, 2025 09:03\nStock market live updates today: Macro and market update\nIndia - States’ capex likely rose 19% in April-July\nStates’ capex grew 19% YoY in April-July FY26 (30% Apr-June) to Rs 1.36 lakh crore, aided by Centre’s interest-free loans, though July saw moderation due to monsoon. States maintained their revenue expenditure at a comparable level. They reported an 11% increase in revenue expenditure in April-July 2025 at Rs 11.43 lakh crore.\nPrices of pulses rule below MSP amid cheap imports\nPulses prices in mandis are ruling below MSP as cheap imports from Myanmar, Mozambique, Tanzania and Canada flood the market. Traders warn this may hurt rabi sowing of chana and masoor, urging the government to raise import duties. Tur, masoor and moong market prices of imported pulses prices are ruling 10% to 20% below the MSP of respective varieties.\nOil imports from Russia steady in August\nIndia’s Russian crude imports held steady at 1.6 mbpd in August despite U.S. sanctions talk. While volumes eased from June highs, refiners continue to buy on discounts, even as diversification to Middle East, U.S. and Africa gains pace to balance energy security and costs.\nEU Considers Secondary Sanctions to Hit Russia’s War Effort\nThe European Union is mulling introducing secondary sanctions in an effort to prevent third countries from helping Russia circumvent the bloc’s existing punitive measures against Moscow, as per Bloomberg. The ministers are also considering further sanctions that target Russia’s oil and gas and financial sectors, as well as further restrictions of import and export of Russian goods. \nUK retailers suffer 11th month of downturn\nA downturn in British retail sales entered its 11th consecutive month in August and shops raised their prices by the most since late 2023. The CBI’s monthly gauge of how retail sales compared with a year earlier was little changed at -32 from July’s -34 but better than a dip to -46 in June. The outlook for September improved to -16. \nChina’s industrial profits extend decline\nChina’s industrial profits fell for a third consecutive month in July. Profits at China’s industrial firms fell 1.5% in July from a year earlier, following a 4.3% slump in June, while a 1.8% profit drop in the first half eased slightly to a 1.7% slide in the January-July period. \nBrazil might challenge tariffs in US courts: FinMin\nBrazil Finance Minister Fernando Haddad said on Wednesday that the South American country might challenge in U.S. courts the steep tariffs imposed by the Trump administration on U.S. imports of Brazilian goods. “We will go to court if needed,” Haddad told local news outlet UOL, adding that Brazil would not engage in lobbying efforts. Brazil faces 50% tariffs.\nAsian markets\nAsian markets opened on a positive note following gains in US and softer USD. \nBrent 67.12, USD 98.12, US 10y 4.239%, Gift Nifty -0.2%\nAugust 28, 2025 09:02\nStock market live updates today: Fund House Recommendations \nJefferies on Polycab: Maintain Buy on Company, target price at Rs 8180/Sh (Positive)\nMOSL on Coforge: Maintain Buy on Company, target price at Rs 2240/Sh (Positive)\nNuvama on Maruti: Maintain Buy on Company, target price at Rs 14300/Sh (Positive)\nInvestec on RBL Bank: Maintain Buy on Bank, target price at Rs 300/Sh (Positive)\nHSBC on BPCL: Maintain Buy on Company, target price at Rs 420/Sh (Positive)\nHSBC on HPCL: Maintain Buy on Company, target price at Rs 520/Sh (Positive)\nHSBC on IOC: Maintain Buy on Company, target price at Rs 190/Sh (Positive)\nSBI Research on Tariffs: US imposes 50% tariff on ~$45 Bn of Indian exports; Sectors hit most: Textiles, gems & jewellery, seafood; pharma & smartphones exempt (Neutral)\nAugust 28, 2025 08:53\nStock market live updates today: SBI Securities Research Morning Update – 28th August 2025\nGift Nifty indicates negative opening ahead of monthly expiry\n* Nifty 50 down 1%, Nifty Smallcap down 2% on Tuesday\n* Wall Street ends in the green, S&P 500 at record high\n* Asian indices trading mixed\nAugust 28, 2025 08:53\nStock market live updates today: Devarsh Vakil, Head of Prime Research, HDFC Securities views on today’s market outlook:\nMarkets Eye Lower Opening Amid US Tariff Blow; Nvidia Miss Weighs on Global Sentiments.\nThe S&P 500 closed at a record high of 6,481 as optimism swelled ahead of Nvidia’s highly anticipated earnings. The Nasdaq and Dow Jones also closed positively, driven by strength in the tech and energy sectors.\nNvidia beat expectations on top and bottom-line results, but its data centre revenue missed estimates due to China sales restrictions, and its future outlook disappointed. Shares fell by more than 3% in after-hours trading, sparking a pullback in U.S. equity futures and raising concerns about the elevated AI companies.\nOn Friday, the Commerce Department is scheduled to release its report on personal income and spending for July, which includes the Federal Reserve’s preferred measure of consumer price inflation.\nEnergy stocks rose 1.15% as oil prices remained volatile, reflecting geopolitical trade risks and shifts in global inventory levels. Gold edged down to $3,388/oz, as markets digested political pressure on the Fed after President Trump attempted to remove Fed Governor Lisa Cook, stoking talk of accelerated rate cuts.\nThe Trump administration doubled tariffs to 50% on Indian imports in retaliation for Russian oil purchases, which raises risks for major Indian exporters and potentially dampens global trade.\nNifty ended Tuesday’s session with a sharp fall of 255 points or 1.02%, to close at 24712, its lowest level since August 14th. Nifty has breached the crucial 20 and 50-day DEMA supports. The Nifty is close to filling the entire upward gap that was formed between 24673 and 24852. If it falls below 24600, it could be dragged down to the next support level near 24340. On the upside, 24900 is expected to offer short-term resistance.\nDespite positive cues from Asian markets over the past two sessions, domestic markets are expected to open lower as sentiment has been dampened by the US imposing 50% duties on India.\nWhile markets are expected to decline at the open, support is likely to be found near the 24600-24650 band, given the significant put writing activity, particularly in light of today’s monthly derivative contracts expiry.\nAugust 28, 2025 08:52\nStock market live updates today: Key highlights from the SBI Securities Daily Technical & Derivative Podcast*\n🌍 Global Market Pulse\n* US Markets: All 3 indices gained; S&P 500 hit fresh all-time high. Likely to test 6530; support at 6440–6420.\n* Brent Oil: Closed at $67.16 (+0.67%); support at $66–65.70, resistance at $68.50–68.70.\n* Dollar Index (DXY): Volatile, trading below moving averages. Resistance 99.20–99.40; Support 97.80–97.50.\n💹 Nifty Technical View\n* Trigger: Trump’s 25% tariff on Indian imports → sharp sell-off.\n* Close: Near 24,700, down >1%, bearish daily candle.\n* Trend: Broke 20 & 50-day EMA; RSI bearish crossover = downside bias.\n* Levels:\nSupport: 24,640–24,600 (100-day EMA), break → 24,400.\nResistance: 24,830–24,850 (20 & 50-day EMA).\n* Derivatives:\nFutures down 1.03%, OI up 4.29% = short build-up.\n24800CE & 24900CE heavy OI; 24700PE & 24600PE strong OI.\nOI PCR = 0.56.\n* Participation: 5 long build-up, 3 short covering, 20 short build-up, 22 long unwinding.\n💹 Bank Nifty Technical View\n* Bank Nifty: Weak, below swing low & 100-day EMA. Likely to test 54,000 → 53,500; hurdle at 54,900–55,000.\n💹 Sensex Technical View\n* Ended below 80,800, down 1.04%, under 100-day EMA. RSI bearish crossover.\n* Levels: Support 80,400–80,300; Resistance 81,100–81,200.\n* Derivatives: Futures down 0.97%, OI up 237%.\n* Options: Heavy OI at 81,000CE & 81,500CE; 80,500PE & 80,000PE strong support.\n* OI PCR = 1.18.\n🔑 Sectoral Sentiment\n* Likely Outperformers: Nifty Auto, FMCG.\n* Likely Underperformers: Defence, Pvt Banks, Financials, CPSE, PSE, Oil & Gas, Capital Market, Media.\nAugust 28, 2025 08:52\nStock market live updates today: Anlon Healthcare subscribed 1.7 times at end of Day 1\nThe initial public offering of Anlon Healthcare Ltd, a chemical manufacturing company engaged in producing high purity advanced pharmaceutical intermediates, enters Day 2 with retail investors showing keen interest. The IPO that will close on Friday, is priced in a band of ₹86-₹91 The total issue size is ₹121.03 crore, entirely a fresh issue of 1.33 crore shares. The issue has so far been subscribed 1.69 times. The market lot is 164 shares.\nAnlon Healthcare subscribed 1.7 times at end of Day 1\nAnlon Healthcare Ltd IPO Day 2: High purity pharmaceutical intermediates manufacturer sees strong retail investor interest, priced at ₹86-₹91.\nAugust 28, 2025 08:50\nStock market live updates today: Vikran Engineering enters Day 2 on strong note\nThe initial public offering of Vikran Engineering received a strong response from investors on Day 1, being subscribed 2.38 times.\nThe Wealth Company, backed by Ashish Kacholia and Mukul Aggarwal, -backed Vikran Engineering has received bids for 13.98 crore shares, against 5.87 crore shares on offer.\nVikran Engineering raises ₹231.60 cr IPO opens today\nVikran Engineering IPO subscribed 2.38 times on Day 1, backed by The Wealth Company and marquee investors.\nAugust 28, 2025 08:27\nStock market live updates today: oday’s Stock Recommendation: August 28, 2025\nAugust 28, 2025 08:26\nStock market live updates today: Fund Houses Recommendations \nJefferies on Hero Motocorp: Upgrade to Hold on Company, raise target price at Rs 5200/Sh (Positive)\nJefferies on TVS Motors: Maintain Buy on Company, raise target price at Rs 4250/Sh (Positive)\nJefferies on Maruti: Maintain Buy on Company, raise target price at Rs 17500/Sh (Positive)\nJefferies on Eicher Motors: Maintain Buy on Company, raise target price at Rs 6925/Sh (Positive)\nJefferies on Bajaj Auto: Maintain Hold on Company, raise target price at Rs 9000/Sh (Positive)\nJefferies on M&M: Maintain Buy on Company, raise target price at Rs 4200/Sh (Positive)\nMacquarie on Tata Comm: Maintain Outperform on Company, target price at Rs 2210/Sh (Positive)\nMacquarie on Reliance Ind: Maintain Outperform on Company, raise target price at Rs 1650/Sh (Positive)\nMacquarie on Bharti Airtel: Maintain Outperform on Company, target price at Rs 2050/Sh (Positive)\nJefferies on ICICI Bank: Maintain Buy on Bank, target price at Rs 1760/Sh (Positive)\nMOSL on Adani Ports: Maintain Buy on Company, target price at Rs 1700/Sh (Positive)\nMS on Real Estate: Mumbai and Bangalore were stronger than other cities in real estate market in July (Positive)\nMacquarie on Bharti Hexacom: Maintain Underperform on Company, cut target price at Rs 1380/Sh (Neutral)\nMacquarie on Vodafone: Maintain Underperform on Company, cut target price at Rs 5.0/Sh (Neutral)\nMacquarie on Indus Tower: Maintain Underperform on Company, target price at Rs 300/Sh (Neutral)\nJefferies on Hyundai: Maintain Underperform on Company, raise target price at Rs 2000/Sh (Neutral)\nJefferies on Tata Motors: Maintain Underperform on Company, raise target price at Rs 575/Sh (Neutral)\nJefferies on Ashok Ley: Maintain Hold on Company, target price at Rs 120/Sh (Neutral)\nAugust 28, 2025 07:49\nStock market live updates today: India Daybook – Stocks in News\nWockhardt Ltd: ICRA Limited upgraded Company’s credit ratings, revising outlook from ‘stable’ to ‘positive’. (Positive)\nNLC India: Company commissions first phase of 300 MW solar power plant in Rajasthan’s Bikaner (Positive)\nAuro Impex & Chemicals Ltd: Company announced its foray into stainless-steel pipe manufacturing, expanding its business segments. (Positive)\n*Khaitan Chemicals & Fertilizers:*Company’s Promoter Majestic Packaging Raises Stake To 22.75% (Positive)\nMRC Agrotech: Company signed a MoU with Khushi Sansaar on 26th August 2025 for exclusive distribution of nano-agrochemical products in India. (Positive)\nSMS Pharma: Company Receives USFDA EIR with “No Action Indicated” For Central Laboratory Analytical Services, Hyderabad. (Positive)\nEscorts Kubota Ltd: Company launched a new Kubota MU4201 tractor, entering the 41-44 HP market. (Positive)\nOIL India: Company & BPCL Ink Joint Venture Agreement To Establish City Gas Distribution Network In Arunachal Pradesh. (Positive)\nAptech: Company Secures Letter Of Intent from Autonomous Government Body To Conduct Computer-Based Online Examinations For Higher Educational Institutions. (Positive)\nSBI Card: Company and Flipkart Form Strategic Alliance; Launch Flipkart SBI Cobranded Credit Card (Positive)\nUnited Breweries: Company to Add 0.4 MHL Capacity with New Canning Line at Nizam Brewery, Telangana; Rs 90 Cr Investment Approved. (Positive)\nZaggle: Company signs five-year referral agreement with Standard Chartered Bank (Positive)\nTCS: Company appoints Amit Kapoor as Chief AI & Services Transformation Officer to lead new global unit (Positive)\nBiocon: Company received USFDA tentative nod for its ANDA Sitagliptin tablets. The drug is indicated for Type-2 diabetes. (Positive)\nOIL India: Company and BPCL Execute JV Agreement for City Gas distribution in Arunachal Pradesh (Positive)\nNewgen software: Company secured Rs 73 cr order for Judicial Digitization project. (Positive)\nVIP Industries: CCI approved acquisition of certain shareholding in V.I.P. Industries Ltd. Promoter and promoter group of the Company (Positive)\nSanathan Textiles: Company has commenced commercial production at its new green manufacturing facility in Punjab. (Positive)\nJaiprakash Associates: CCI approved the acquisition of Jaiprakash Associates by Adani Group entities. (Positive)\nHG Infra: Company’s arm has achieved financial closure for a road upgradation project in Gujarat valued at Rs 781.11 crore. (Positive)\nManappuram Finance: Company has signed a deal worth over Rs 4,384 crore with BC Asia Investments and a promoter group (Positive)\nDr. Reddy’s: Company Gets Interim Stay from Telangana High Court on Income Tax Reassessment Proceedings Related to DRHL Merger. (Neutral)\nNavin Fluorine: Company Subsidiary NFASL Allots Rs 200 Cr Preference Shares to Parent for Debt Repayment & Consolidated Leverage Reduction (Neutral) \nGraphite India: Company Increases Stake In Godi India Pvt. Ltd. To 45.76% via Rs 18.65 Cr Rights Issue Subscription. (Neutral)\nNRB Bearings: Company Acquires 8.5% Stake In Amplus Ampere Pvt Ltd For Rs 4.8 Cr to Source 15 MWP Solar Power in Maharashtra. (Neutral) \nSpicejet: Company Launches Paperless Boarding At Shillong Airport; To Expand To Other Places –PTI. (Neutral)\nBSE Ltd: BSE Investments, BSE Administration and Supervision to Merge With BSE Technologies (Neutral)\nJSW Steel: Company Incorporates JV “Apjsw Private Limited” With APMDC For Konijedu Marlapadu Iron Ore Project In Andhra Pradesh. (Neutral)\nTata Steel: Company acquires stakes worth ₹3,100 crore in Singapore subsidiary, T Steel Holdings Pte. Ltd (Neutral)\nIndigo: Rakesh Gangwal Family likely to sell up to 3.1% stake in Interglobe Aviation via Block Deals. (Neutral)\nPB Fintech: Board approves Re-appointment of Yashish Dahiyaas Chairman, Executive Director & Chief Executive Officer till July 2031. (Neutral)\nCohance: MD V Prasada Raju sold 6lk shares to repay loan for ESOPs.(Neutral)\nHubtown: Board approved the amalgamation of Distinctive Realty with Amazia Developers and approved the amalgamation of Nitant Real Estate & Amazia Developers with the company. (Neutral)\nJana Small Finance Bank: Company received a Goods and Services Tax demand of Rs 28.5 crore including a penalty from the Karnataka Tax Body. (Neutral)\nRatnamani Metals: Company incorporated the arm Ratnamani Middle East company in the Kingdom of Saudi Arabia. (Neutral)\nMahanagar Gas: Company received Goods and Services Tax demand of Rs 54 crore from Mumbai tax body. (Neutral)\nTexmaco Rail & Engineering: Company has approved the incorporation of a JV with Rail Vikas Nigam Limited for rolling stock and rail infrastructure projects. (Neutral)\nAdani Energy Solutions: Company has incorporated a wholly owned subsidiary named Adani Energy Solutions Step-Fifteen. (Neutral)\nList of securities included in short-term ASM Stage 1: Apollo Micro Systems, Zinka Logistics Solutions, HLE Glascoat. (Neutral)\nAsian Hotels: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nAlfred Herbert: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral) \nBlack Box: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nBikaji Foods: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nCovance Softsol: Ex-Date Tomorrow, Right Issue of Equity Shares (Neutral)\nEngineers India: Ex-Date Tomorrow, Dividend Rs 2.0/Sh (Neutral)\nGanesh Housing: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral)\nHarsha Engineers: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nNitin Spinners: Ex-Date Tomorrow, Dividend Rs 3.0/Sh (Neutral)\nProtean eGov: Ex-Date Tomorrow, Dividend Rs 10.0/Sh (Neutral)\nRoyal Orchid: Ex-Date Tomorrow, Dividend Rs 2.5/Sh (Neutral)\nSalzer: Ex-Date Tomorrow, Dividend Rs 2.5/Sh (Neutral)\nShetron: Ex-Date Tomorrow, Dividend Rs 1.0/Sh (Neutral)\nShilp Gravures: Ex-Date Thursday, Dividend Rs 2.1/Sh (Neutral)\nSteelcast Ltd: Ex-Date Tomorrow, Stock Split from Rs.5/- to Rs.1/- (Neutral) \nSuyog Telematics: Ex-Date Tomorrow, Dividend Rs 1.8/Sh (Neutral)\nVijaya Diagnostic: Ex-Date Tomorrow, Dividend Rs 2.0/Sh (Neutral)\nWhirlpool of India: Ex-Date Tomorrow, Dividend Rs 5.0/Sh (Neutral)\nYuken India: Ex-Date Tomorrow, Dividend Rs 1.5/Sh (Neutral)\nZee Ent: Ex-Date Tomorrow, Dividend Rs 2.43/Sh (Neutral)\nAAA Technologies: Ex-Date Today, Dividend Rs 1.5/Sh (Neutral)\nAster DM: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral)\nDiamines & Chemicals: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral) \nDMR Hydro engineering: Ex-Date Today, Bonus issue 8:5 (Neutral)\nGujarat Pipavav Port: Ex-Date Today, Dividend Rs 4.2/Sh (Neutral) \nJyothy Labs: Ex-Date Today, Dividend Rs 3.5/Sh (Neutral)\nMagna Electro: Ex-Date Today, Dividend Rs 6.0/Sh (Neutral)\nVedant Fashions: Ex-Date Today, Dividend Rs 8.0/Sh (Neutral)\nProcter & Gamble Hygiene: Ex-Date Today, Dividend Rs 65.0/Sh (Neutral)\nRoute Mobile: Ex-Date Today, Dividend Rs 2.0/Sh (Neutral) \nSpeciality Restaurants: Ex-Date Today, Dividend Rs 1.0/Sh (Neutral)\nLotus Dev: Revenue down 49% at Rs 61cr vs Rs 121cr YoY, Net Profit down 35% at Rs 26cr vs Rs 40cr. (Negative) \nGOCL Corporation: Promoter Hinduja Capital Limited sold 24.79 lakh shares. (Negative) \nFilatex Fashions: Promoter Prabhat Sethia sold 1 crore shares. (Negative) \nRama Steel Tubes: Promoter Tarun Dhir sold 20 lakh shares, Promoter Arun Dhir sold 15.54 lakh shares, Promoter Charanjit Lal Dhir sold 6 lakh shares (Negative)\nAugust 28, 2025 07:48\nStock market live updates today: IndiGo - One company where the promoter kept selling from Rs 765 levels and stock keeps rising\nNov 10, 2015 (IPO)\\Promoters incl. Rakesh Gangwal\\OFS as part of \nIPO\\765 issue price; promoters divested part of stake.\nSep 7–8, 2022\\Rakesh & Shobha Gangwal\\~2.74%\\u0009~1,919\\u0009 Block deal on worth ₹2,005 crore; first major sale post-2022 exit plan.\nFeb 16, 2023\\Shobha Gangwal\\~4%\\1,875 (floor)\\Block deal via term sheet; floor price set at ₹1,875.\nAug 16, 2023\\Gangwal family\\~4–5%\\2,400 (floor)\\Planned block deal with floor at ₹2,400.\nar 11, 2024\\Rakesh Gangwal\\~5.8% (22.5m shares)\\u00093,015–3,016 (executed)\\Actual trade execution range reported.\nAug 29, 2024\\Chinkerpoo Family Trust (Gangwal family trust)\\~5.2–6%\\4,760 (executed); 4,593 (floor)\\Floor set at ₹4,593; trades executed ~₹4,760; deal size ~₹9,500–11,000 cr.\nMay 27, 2025\\Rakesh Gangwal & Chinkerpoo Family Trust\\~5.7%\\5,230.5 (executed)\\Large block worth ~$1.36B; priced at ~3–4.5% discount to prior close.\nAug 26, 2025 (planned)\\Gangwal family\\up to 3.1%\\5,808 (floor) \\Fresh block deal announced; execution pending.\nAugust 28, 2025 07:45\nStock market live updates today: Economic Calendar – 28.08.2025\n16:00 INDIA Industrial Production y/y (Expected: 2.0% versus Previous: 1.5%)\n18:00 U.S. Unemployment Claims (Expected: 231k versus Previous: 235K)\n18:00 U.S. Prelim GDP q/q (Expected: 3.1% versus Previous: 3.0%)\n19:30 U.S. Pending Home Sales m/m (Expected: -0.3% versus Previous: -0.8%)\nAugust 28, 2025 07:39\nStock market live updates today: Major U.S. listed stocks result calendar 28.08.2025\nLi Auto Inc (Pre market) (Sector- Automobile)\nDollar General Corporation (Pre market) (Sector- Retail)\nDick’s Sporting Goods Inc (Pre market) (Sector- Retailers)\nBurlington Stores, Inc (Pre market) (Sector- Retailers)\nHormel Foods Corporation (Pre market) (Sector- FMCG)\nBest Buy Co., Inc (Pre market) (Sector- Retailers)\nBrown Forman Corporation (Pre market) (Sector- FMCG)\nHarmony Gold Mining Company Limited (Pre market) (Sector- Metals)\nDell Technologies Inc (Post Market) (Sector- Technology)\nMarvell Technology, Inc (Post Market) (Sector- Technology)\nAutodesk, Inc (Post Market) (Sector- Technology)\nAffirm Holdings, Inc (Post Market) (Sector- Technology)\nUlta Beauty, Inc (Post Market) (Sector- Retailers)\nAugust 28, 2025 07:37\nStock market live updates today: Nifty stares at 200 points decline at open\nDomestic markets are likely to remain volatile amid a doubling of tariffs by the US. Besides, the settlement of monthly contracts on the NSE will add to volatility, said marketmen. \nAditi Nayar, Chief Economist, Head - Research & Outreach, ICRA Ltd, said the persisting global uncertainty is likely to further delay the domestic private capex cycle in India. “However, certain sectors such as electronics, semi-conductors and segments like electric vehicles will continue to see a scale-up in investments, in ICRA’s view.”\nNifty stares at 200 points decline at open\nDomestic markets volatile due to US tariffs, NSE contracts settlement; certain sectors to see investments despite global uncertainty.\nAugust 28, 2025 07:23\nStock market live updates today: Watch out for these dozen stocks including TCS, Tata Steel, IndiGo, Texmaco, RVNL, United Breweries in August 28, 2025 trades\nWatch out for these dozen stocks including TCS, Tata Steel, IndiGo, Texmaco, RVNL, United Breweries in August 28, 2025 trades\nInterGlobe Aviation promoter to divest stake, Texmaco Rail forms JV, TCS appoints new AI officer, Tata Steel invests in subsidiary.\nAugust 28, 2025 07:00\nStock market live updates today: Key triggers for these three pharma stocks - Dr Reddy’s Lab, Cipla, Biocon\nRecalling medicines, court stay and USFDA approval to impact these stocks today\nKey triggers for these three pharma stocks - Dr Reddy’s Lab, Cipla, Biocon\nDr Reddy's Labs gets stay on tax reassessment, Cipla recalls asthma medication, Biocon gets FDA approval for Sitagliptin tablets.\nAugust 28, 2025 06:52\nStock market live updates today: Six power and energy to stocks to remain in focus on Thursday, August 28, 2025\nOil India-BPCL deal, PFC’s new pact, Acme Solar’s fund raising plans, JP Power Ventures’ expansion, SAEL Industries solar foray\nSix power and energy to stocks to remain in focus on Thursday, August 28, 2025\nPFC signs performance evaluation agreement, Oil India and BPCL form joint venture, Acme Solar to raise ₹3,000 crore.\nAugust 28, 2025 06:39\nStock market live updates today: Stock to buy today: Craftsman Automation (₹7,197.50) – BUY\nThe short-term outlook is bullish for Craftsman Automation. The stock had surged over 5 per cent on Tuesday when the broader markets were beaten down badly. This rise has happened after forming a strong base between ₹7,000 and ₹6,750. This ₹7,000-6,750 will act as a strong support zone and limit the downside.\nStock to buy today: Craftsman Automation (₹7,197.50) – BUY\nCraftsman Automation stock outlook is bullish with strong support at ₹7,000-6,750, potential rise to ₹7,800-7,850. Trading recommendations included.\nCOMMENTS\nPublished on August 28, 2025", "timestamp": "2025-08-28T18:10:39.689898"}, {"title": "India’s 25% tariffs can be off tomorrow if it stops buying Russian oil: White House advisor", "sub_heading": "Experts say India must not get swayed and weigh economic, diplomatic aspects of its actions", "publisher": "By Amiti Sen\nUpdated - August 28, 2025 at 02:30 PM. | New Delhi, August 29", "story": "White House trade advisor Peter Navarro | Photo Credit: REUTERS/NATHAN HOWARD\nFollowing the doubling of US tariffs on India to 50 per cent on Wednesday, White House advisor Peter Navarro has said the additional 25 per cent duties could be reversed if India stopped purchasing oil from Russia. \nNavarro further stepped up pressure on India to stop dealing with Moscow by dubbing the Russia-Ukraine conflict as “Modi’s war” and also asserted that both Russia and China were not New Delhi’s friend.\nInternational affairs experts advise that India must not be swayed by such comments and should step carefully by weighing its economic and diplomatic interests with all major economies.\nREAD MORE", "timestamp": "2025-08-28T18:10:40.918683"}, {"title": "India extends duty-free cotton imports until December 31", "sub_heading": "The decision will make Indian textile and garment exports competitive in other markets such as the UK and EU", "publisher": "By Vishwanath Kulkarni\nUpdated - August 28, 2025 at 05:34 PM. | Bengaluru", "story": "The government extended duty-free imports to support the Indian textile industry, particularly exporters who are facing a steep 50% tariff imposed by the US. | Photo Credit: REUTERS\nIndia on Thursday extended the duty-free import of cotton for three more until December 31, 2025, from September 30. The Indian government’s decision will ease the burden of the Indian textile industry, particularly mills in the south, which are under pressure due to the 50 per cent tariffs imposed by the US government. It will help Indian textiles and garments to be competitive in markets such as the United Kingdom (UK) and the European Union with who it has signed trade deals.\nThis decision will likely result in cotton imports during the first three months of the marketing year 2025-26, starting in October, doubling to around 20 lakh bales of 170 kg each. This is the second time the Goverment has come to the rescue of the textiles industry in 10 days. On August 19, the government had exempted the 11 per cent duty on cotton imports till September end.\nAtul Ganatra, President, Cotton Association of India (CAI), said the extension of duty exemption will provide relief to Indian textile mills, especially those in the South. They can now get access to cheaper cotton from countries like Brazil, the US, Africa and Australia. “It will give a lifeline to the mills in South,” Ganatra said, adding that CAI had recently urged the government to extend the duty-free imports for a few more months.\nGlobal prices ruling lower\nInternational prices are currently lower by about 20 per cent compared with Indian domestic prices. Cotton futures on the InterContinental Exchange (ICE), New York, are hovering at 67-68 cents per pound, equivalent to ₹46,000 per candy of 356 kg in the Indian rupee, while domestic prices are hovering around ₹55,000 per candy, Ganatra said.\nFor the current marketing year 2024-25 ending September, imports are expected to be between 40 and 42 lakh bales. “During the October-December, we believe 15-20 lakh bales will arrive, compared with 10 lakh bales in the corresponding period last year,” Ganatra said.\nAlso read\nMerchant association seeks EMI facility for gold jewellery purchase to boost retail biz\nICE futures are under pressure due to a bigger crop in Brazil, which is 7 per cent higher at 235 lakh bales, while their domestic consumption is only 30 lakh bales, he said. As Brazilian cotton is cheap, no one is buying US cotton. China, the biggest buyer, has not been buying US cotton over the past six months due to the tariff war. It has levied a 30 per cent tariff on US cotton. India’s cotton imports from Brazil have seen a 10-fold increase during the current 2024-25 season to over 6.5 lakh bales valued at over ₹1,620 crore till the end of May. \nGanatra said the Indian textile exports are linked to the yarn prices, which are linked to the ICE Futures. That is very important and in eight of the past 10 years, Indian mills had access to cheaper domestic cotton, he said.\nAlso read\nCentre sets up high level forum for regulatory coordination, development of pension products\nIndian cotton was cheaper than ICE Futures, but only over the past couple of years, it has become costlier due to the increase in MSP and increase in prices by the Cotton Corporation of India, he said. Though mills were able to manage over the past two years, the tariff is hurting the industry badly, he said.\nA trade analyst said the duty-free imports will help Indian textile exporters to take on competitors such as Vietnam, Bangladesh and Pakistan in the UK and European markets. “The duty-free facility will give them relief,” he said, adding that it will also aid Indian textile and garment exporters to further their advantage they gained after the unrest in Bangladesh.\nGanatra said the US decision will, however, provide an opportunity to look at over 200 other countries.\n(With inputs from Subramani Ra Mancombu, Chennai)\nCOMMENTS\nMore Like This\nTrump tariffs: Textile industry negotiates rates with customers as additional tariffs kick in\nUSDA projects India’s 2025-26 cotton output at 31.4 million bales\nIndia’s cotton crop hit by boll rot on excess rain in parts of AP & Telangana, raises concern over yield\nIn relief to textile industry, cotton import duty paused\nPublished on August 28, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:42.156267"}, {"title": "Tariffs have not torn through textile town of Tiruppur as lakhs of migrant workers go about their business as usual", "sub_heading": "Industry sources denied reports of factories being shut down and migrant workers being asked to leave", "publisher": "By TE Raja Simhan\nUpdated - August 28, 2025 at 12:07 PM.", "story": "Women workers at a textile manufacturing unit in Tiruppur, Tamil Nadu. | Photo Credit: PERIASAMY M\nA Sakthivel, Vice-Chairman, Apparel Export Promotion Council, who is considered the ‘Bhisma Pitha Maha’ of the Tiruppur textile industry, is one of the top industry officials camping in New Delhi for the last three-four days to find a solution to the crisis the industry is faced with due to US tariffs. He has been busy clarifying to the government on various issues, including rumours that migrant workers in the textile town were asked to leave for their hometowns due to closure of units.\nNo garment unit has been shut down at Tiruppur and lakhs of migrant workers are still working in the textile town, Sakthivel told businessline. “Everything is normal now. One can visit Tiruppur to see for themselves now,” he added.\nIt will take at least two weeks to understand the impact of the tariff that took effect from Wednesday, he added.\nREAD MORE", "timestamp": "2025-08-28T18:10:43.693748"}, {"title": "BL Explainer: Decoding the new income tax law", "sub_heading": "Updated rules on deductions, marginal relief, and pre-construction interest come into effect April 2026", "publisher": "By Nishanth Gopalakrishnan\nUpdated - August 28, 2025 at 12:00 PM.", "story": "The Income Tax Bill, 2025 — popularly known as the ‘new I-T Bill’ — has been passed by both houses of Parliament and received the President’s assent on August 21, officially making it an Act. It is all set to come into force from April 1, 2026.\nThis is the second draft of the Bill that has been passed, following the withdrawal of an earlier draft by the Finance Ministry to make changes recommended by a Select Committee of the Lok Sabha. Amidst the rigmarole, taxpayers seem to have certain questions in their mind regarding the new legislation. Here’s addressing a few.\nWhy was the initial draft of the I-T Bill withdrawn?\nAccording to Neeraj Agarwala, Partner, Nangia & Co LLP, “The new Income Tax Bill was initially withdrawn to correct drafting inconsistencies and to carefully consider the feedback received from various stakeholders. For example, in the first draft, taxpayers were required to file their return on or before the due date of original filing, in order to claim refund. While it did allow filing a belated return, this condition was considered restrictive when compared to the provisions under the existing Income Tax Act, 1961 (ITA). To address such issues, the draft was sent back for revision, and the Parliamentary Select Committee recommended several changes that were subsequently incorporated into the new version.”\nWhat are the key changes proposed in the revised version?\nAccording to Agarwala, “Among the important modifications was the treatment of pre-construction interest deduction. The earlier draft permitted this deduction only for self-occupied property, whereas the ITA extends the benefit to both self-occupied and let-out properties. The revised version has corrected this anomaly.”\nAnother important correction relates to the rebate under section 87A. Under the ITA, marginal relief is available to resident individuals under the new tax regime if their total income exceeds ₹12 lakh. This safeguard was missing in the initial draft but has been reinstated.\nSimilarly, the ITA provided taxpayers with the facility to obtain both lower TDS and nil-TDS certificates, albeit for specified receipts. The first draft of the bill failed to explicitly recognize nil-TDS certificates, which has now been addressed.\nHow does advance nil-TDS certification help?\n“An advance nil-TDS certificate helps a taxpayer by preventing unnecessary tax deductions at source when their income is either exempt from tax or their total tax liability is expected to be nil. Without such a certificate, the payers are obligated to withhold TDS, often creating a situation where the taxpayer has to claim a refund while filing the return, leading to cash flow issues.\nBy obtaining a nil-TDS certificate in advance, the taxpayer ensures that no tax is deducted at source, thereby improving liquidity, and aligning the actual tax deducted with their final liability”, says Agarwala.\nWhat are the changes proposed in commuted pensions or lumpsum pension payments received by some individuals?\nIn fact, there are no changes proposed in this regard. The new law just presents the earlier provisions in a table within section 19, for better comprehension.\nCommuted pension received by employees of the Central Government or government of the States or a corporation established by a Central Act or State Act remain exempt.\nFor other employees, such as employees serving a private organization, commuted pension remains taxable with a deduction from the actual amount, as earlier. For those who are in receipt of gratuity, the deduction is one-third of the commuted pension. For others, it is half of the commuted pension.\nFurther, commuted pension from a pension scheme with an IRDAI-approved insurer remains outside taxation ambit, as it has been earlier.\nWhat does clause 202(1) under the revised Income-tax Bill specify?\nClause 202(1) houses the provisions that relate to the new tax regime applicable to individuals and HUFs among others. Here, the provisions stay the same as contained in the extant section 115BAC of ITA. The new slabs that were introduced in Budget 2025 and provisions with respect to the restrictions on claiming deductions and exemptions under section 115BAC are all carried over and there are no notable changes.\nCOMMENTS\nPublished on August 28, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:44.848081"}, {"title": "Adani Group portfolio companies’ EBITDA crosses ₹90,000 cr milestone for first time", "sub_heading": "Adani Group portfolio companies’ Q1 FY26 EBITDA also rises to record high of ₹23,793 crore", "publisher": "By BL Ahmedabad Bureau\nUpdated - August 28, 2025 at 11:44 AM. | Ahmedabad", "story": "The EBITDA for AEL’s existing businesses declined by 18.7% year-on-year on a TTM basis, while those of AEL’s cements and infrastructure business grew by 39.6% and 11.2%, respectively.  | Photo Credit: VIJAY SONEJI\nAnnouncing the financial performance of the companies in its portfolio, the Adani Group on Thursday said the EBITDA (short for earnings before interest, taxes, depreciation and amortization) for the companies crossed the ₹90,000 crore milestone on a Trailing-Twelve-Month (TTM) basis for the first time with the first quarter EBITDA for FY2026 reaching a record high.\n“This strong performance was led by sustained growth in incubating businesses (notably Airports under AEL), along with Adani Green Energy, Adani Energy Solutions, Adani Ports & SEZ and Ambuja Cements. Robust contributions from these businesses more than offset the dip in AEL’s existing businesses,” the company stated in an official release here.\nEBITDA is an alternate measure of profitability to net income. On a TTM basis, the EBITDA for the Adani Portfolio grew by 9.8 per cent year-on-year to ₹90,572 crore while the first quarter EBITDA for FY2026 rose by 3.3 per cent to a record high of ₹23,793 crore.\nREAD MORE", "timestamp": "2025-08-28T18:10:45.989674"}, {"title": "Trump's tariffs must be a wake-up call for India: Amitabh Kant", "sub_heading": "India should use the situation to push through crucial reforms, the frmer NITI Aayog CEO and India’s ex-G20 Sherpa said", "publisher": "By ANI\nUpdated - August 28, 2025 at 12:24 PM. | New Delhi, August 28", "story": "File picture: Former NITI Aayog CEO and India’s ex-G20 Sherpa Amitabh Kant  | Photo Credit: Shailendra Bhojak\nFormer NITI Aayog CEO and India's ex-G20 Sherpa Amitabh Kant has said that the latest tariff measures by US President Donald Trump should serve as a \"wake-up call\" for India. Taking to social media, Kant wrote, \"Trump's tariffs must be a wake-up call for India. The irony is striking: the US is actively negotiating with Russia and China, the latter being the largest buyer of Russian oil, yet chooses to target India with tariffs instead. Let us be clear, this is not about Russian oil. It is about India's energy security and strategic autonomy, which we should never compromise.\"\nKant said that India must stay firm on protecting its strategic interests, while using the situation to push through crucial reforms. \"India has, on numerous occasions, refused to yield to global pressure. This moment should be no different. Rather than intimidate us, these global headwinds must galvanise India into bold, once-in-a-generation reforms, while also diversifying our export markets to secure long-term growth and resilience,\" he concluded.\nEarlier this month, speaking to ANI about India's trade relationship with China, Kant said that despite difficult political ties, India should aim at building joint ventures with Chinese companies, rather than depending heavily on imports from China. He explained, \"We do about 120 billion worth of imports from China. Despite having a very adverse relationship with Japan, China continued to maintain a very close economic relationship with Japan. China has a very adverse political relationship with Taiwan. Yet the biggest investors in China are Taiwan and the Taiwanese businessmen. To my mind, it is in our economic interest that instead of importing from China, we should get Chinese to do joint ventures with Indian companies on a minority stake and do manufacturing in India, and that will enable India to do both input manufacturing and component manufacturing and accelerate the process of Make in India and accelerate the process of Manufacture in India, and that to my mind is a long term answer to economic growth.\"\nOn India's growth ambitions, Kant pointed to the larger economic vision. \"The key is how do we take India from a $4 trillion to a $35 trillion economy by the time we become 100? That's the vision of the Prime Minister. We need to provide momentum for growth. We need to grow at 8 to 9 per cent per annum, year after year. Instead of importing, we should focus on manufacturing in India with China. That will create jobs in India,\" he said.\nCOMMENTS\nPublished on August 28, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:47.110122"}, {"title": "Are quality control orders really about quality?", "sub_heading": "While the aim is to build a robust manufacturing ecosystem, these orders often create supply chain disruptions", "publisher": "By Prerna Prabhakar\nUpdated - August 26, 2025 at 09:40 PM.", "story": "India’s protectionist approach has become more aggressive in recent years, particularly since 2018  | Photo Credit: mady70\nRecently announced US tariffs have led to considerable speculation regarding India’s risks and opportunities, with discussions emerging on India exploring alternatives to the US market. However, this debate has also brought to light some of the fundamental issues with India’s trade and competitiveness strategy. While the agriculture sector faces high tariffs in many countries, including the US, India maintains one of the highest tariff levels for its non-agriculture sector as well.\nIndia’s protectionist approach has become more aggressive in recent years, particularly since 2018, when tariffs began rising sharply. This trend was reinforced in 2020 with restrictions on Chinese investments, alongside the sustained implementation of anti-dumping duties targeted at preventing the inflow of cheap imports into India.\nIn parallel, the government has been issuing a series of Quality Control Orders (QCOs), with their number rising substantially since 2020. While these orders are designed by the respective line ministries, enforcement is undertaken by the Bureau of Indian Standards (BIS). QCOs apply to both domestic producers and importers, though some ministries exempt imports intended for exports. These orders prescribe specific product standards, with consignments subject to testing for compliance. Based on test results, BIS issues certificates to producers or importers.\nAlthough the stated aim of QCOs is to build a robust manufacturing ecosystem in India, they have also created supply chain disruptions. Delays in certificate issuance for certain importers, often suppliers of critical components, have increased lead times for both manufacturers and exporters. Lengthy testing procedures further worsen these constraints.\nAccording to BIS, the orders are issued on grounds including public interest, protection of human, animal, or plant health, environmental safety, prevention of unfair trade practices, and national security. While quality assurance is a valid and essential objective, pricing-related concerns are already addressed through other measures such as anti-dumping duties, many of which have been levied against China. Targeting price differences for curbing imports of key intermediate items can lead to severe supply chain disruptions.\nFor instance, Chinese exporters of cold rolled grain-oriented (CRGO) steel, primarily used in the production of power transformers, were not granted BIS certification under the QCO. This led to shortages in the domestic market, as India does not produce this specialised grade of steel in sufficient quantities. The shortage had a direct impact on the power sector, even creating bottlenecks in infrastructure projects that rely on transformers. Eventually, the government considered granting some early exemptions to the Chinese importers of CRGO steel.\nFor curbing cheaper imports?\nThe bigger question then arises, whether such QCOs are primarily intended to ensure quality or to restrict the inflow of cheaper imports into the country.\nFor instance, a microenterprise producing steel kitchenware noted that a QCO prescribed specific thickness requirements for steel bowls. Because these specifications differed from their existing production standards, significant retrofitting was needed to comply. However, this raised an important question — whether thickness is directly related to health or environmental concerns, or whether it simply enforces a manufacturing specification that may not be critical for consumer safety. In the same way, there is a QCO covering steel wire used for hand-sewing needles, which mandates compliance with testing requirements such as chemical composition, wire dimensions, etc.\nDirect link\nIt is often difficult to establish a direct link between such QCOs and broader safety or environmental outcomes, raising the question of the extent to which these measures genuinely contribute to improvements in these parameters. Ultimately, the basis for introducing QCOs — whether rooted in genuine quality, safety, or environmental needs, or serving as indirect trade restrictions — must be better understood.\nCatering to price differences without careful consideration of domestic supply chain dynamics can hurt the competitiveness of India’s manufacturing sector, which is already struggling and disadvantaged compared to its competitors.\nAt a time when countries are actively seeking alternative markets and striking trade deals with the US, India should focus on aligning its internal policies so that they are true to their stated objectives. Policies should avoid creating unintended hindrances for importers that ultimately restrict market access within the country and undermine the country’s ability to attract foreign investments. Ensuring this balance is critical for strengthening India’s manufacturing base and positioning it competitively in global trade.\nThe writer is an Associate Fellow at the Centre for Social and Economic Progress (CSEP). Views are personal\nCOMMENTS\nPublished on August 26, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:48.448796"}, {"title": "Editorial. A better FIT", "sub_heading": "Slight revisions in inflation target and range may work", "publisher": "Updated - August 26, 2025 at 09:38 PM.", "story": "The RBI paper is in favour of retaining the headline inflation for inflation targetiing given food’s dominance in the consumption basket | Photo Credit: SUSHIL KUMAR VERMA\nThe Reserve Bank of India (RBI) recently issued a discussion paper on whether the terms and conditions of ‘flexible inflation targeting’ (FIT) require a review. FIT, which began in 2016, comes up for a five-year extension in March 2026. The paper supports continuing with the point target of 4 per cent, but subtly favours reducing the range to 1.5 percentage points on either side from the present two percentage points. There is arguably room for raising the point target a bit. A higher target can take into account the outsized role of food prices in headline inflation in times of climate disruption.\nThe paper examines four broad questions, besides assessing the performance of FIT over nine years. These are: whether core inflation (non-food and non-fuel) should replace headline inflation as the target; the 4 per cent target should be persisted with; the tolerance band should be reduced; and a range should replace the point target. The paper is quite right in arguing that headline inflation (food and fuel inflation component exceeding 50 per cent) should remain the metric to reflect the common man’s experience. According to the Household Consumption Expenditure Survey (which points to a falling share of food consumption over time), 90 per cent of the lowest fractile rural households and 50 per cent of the lowest fractile urban households spend over half of their budget on food and fuel. Measuring food inflation becomes important, as food spills over to core inflation through costs and expectations. However, food weights should be adjusted periodically to reflect changing consumer preferences. The paper wryly observes that of the 48 countries practising FIT only Uganda has chosen to target core inflation. There may be a case for reducing the tolerance band by 0.5 percentage points on either side, provided the volatility and ‘noise’ in the food constituents of the retail price index is minimised. A narrower band would hold monetary authorities more to account.\nThe 4 per cent target seems to be the trend rate over nine years of FIT, besides being one that can be deduced through the Balassa-Samuelson effect – the sum of the inflation target of 2 per cent for advanced economies and a productivity differential between advanced and emerging economies. Out of 35 quarters, headline inflation was in the 2-4 per cent range in 11, 4-6 per cent in 14 and above six in nine, converging to an average rate of about 4 per cent. Covid and Russia-Ukraine shocks played a role in the deviations.", "timestamp": "2025-08-28T18:10:50.552618"}, {"title": "Massive pay-offs from Jan Dhan Yojana", "sub_heading": "11 years on, the scheme has democratised access to payments, enabled millions enter the digital economy", "publisher": "By V Anantha Nageswaran\nUpdated - August 27, 2025 at 06:05 AM.", "story": "With near-universal access to banking services now within reach, the challenge ahead lies in deepening financial inclusion | Photo Credit: -\nFinancial inclusion is the sine qua non of sustainable development. This is evident from the fact that seven of the 17 United Nations Sustainable Development Goals (SDGs) of 2030 identify it as a key enabler for achieving inclusive growth worldwide. The first step towards financial inclusion starts with banking the unbanked, as account ownership acts as a gateway to the formal banking system.\nFinancial inclusion, therefore, requires deliberate and structured policy interventions to extend banking services to those historically left out. To turn the principle into practice, Prime Minister Modi’s maiden address from the ramparts of Red Fort announced the Pradhan Mantri Jan Dhan Yojana (PMJDY), a scheme which was formally launched on August 28, 2014, under the National Mission on Financial Inclusion.\nThe vision of the mission was encapsulated in its slogan, “Mera Khaata, Bhagya Vidhata” (My Account, Fortune Maker). It sought to bring the poor and historically marginalised into the economic mainstream, enabling access to the formal banking system and ensuring they became stakeholders and beneficiaries of India’s growth story. Jan Dhan accounts allowed beneficiaries to open zero-balance and zero-charge accounts with minimal paperwork and simplified KYC/e-KYC requirements. They also provided additional features such as RuPay debit cards with in-built accident insurance cover of ₹2 lakh, and an overdraft facility of up to ₹10,000.\nREAD MORE", "timestamp": "2025-08-28T18:10:51.838530"}, {"title": "Decoding Trump’s stance on India", "sub_heading": "The Trump administration must understand that the Modi govt will never compromise on the interests of Indian farmers", "publisher": "By Subramani Ra Mancombu\nUpdated - August 27, 2025 at 09:10 PM.", "story": "US Soybean farmers are heavily reliant on Chinese imports | Photo Credit: CESAR OLMEDO\nIf you want to know why US President Donald Trump has taken a tough stance against India, you should be among the US farmers. It may not be the only reason, but it definitely is one of the reasons. It could also be because Trump and his advisors are waiting for China’s response with bated breath, which is the bull in Trump’s shop.\nLast week, at the Soy Connext 2025, organised by the US Soybean Export Council in Washington, the elephant in the room was China. For nearly two decades, until 2017, the US had become very reliant on China, particularly for the export of its agricultural produce — soybeans, wheat and corn. Beijing, too, was over-reliant on the US. But it acted quickly after its first trade dispute in 2017-18 with Washington.\nChina is yet to buy any soybeans in forward sales from the new crop that is due in less than a month. Traders and US farmers fear Beijing could even do the same with corn, which will be harvested from October, and wheat.\nAnalysts say China put the US on the ropes by banning the export of critical minerals in December 2024, in retaliation for the US ban on the semiconductor industry and magnets for electric vehicles. Beijing also barred shipments of dual-use items to 12 specific US companies. It has hurt the US industry badly.\nThese Chinese actions have forced the US to put off until November additional sanctions against Beijing. Trump has threatened China with a 200 per cent tariff, but it is unlikely he will go ahead. Analysts say they would not be surprised if Trump extends the deadline for the sanctions to come into force, giving more time for a trade deal.\nSoybean economics\nAfter lobbying for 15 years, the US started exporting soybeans to China in 1997. By 2014, it had peaked at $145 billion before plunging to one-tenth of it last year at $13.5 billion. According to the American Soybean Association, China bought 25 million tonnes (mt) of US soybean in the 2023-24 marketing season.\nThe Chinese significance makes it a must for others to keep it in good humour. Beijing accounts for over 60 per cent of the global soybean imports. If China does not buy US soybeans, its export will drop 48 per cent. This is even if all its other buyers were to meet 100 per cent of their demand from Washington.\nOn its part, China has helped Brazil improve its port infrastructure and logistics. A Panamax vessel now takes 60 days to load agricultural produce compared with 120 days before the first Sino-US trade dispute. It has helped Brazil to increase its production from 95.7 million tonnes in 2015-16 to 176 tonnes in 2025-26.\nEconomists say US inflation has increased only a tad until July. But from August, it could surge with the tariffs coming into play. That will create problems for Trump, apart from the need to find markets for US agricultural produce, such as soybeans.\nThese developments have probably forced the US to target India. Whether it is Trump’s decision or his advisors’ suggestions, they have failed to consider the compulsions of the Modi government. It has exposed Washington’s double standards, particularly in the case of targeting New Delhi for penal tariffs in buying Russian crude oil. At least twice, Modi has said he is willing to pay the price for protecting the interests of farmers and small traders. The Prime Minister knows how to cater to his electorate.\nIndian compulsions\nWhat Trump and his advisors have not taken into account is that any decision to permit imports of key crops will affect millions of small and marginal farmers, who make up over four-fifths of the total growers in India. Also, the Indian Supreme Court is still seized of the genetically modified (GM) crops issue. The ruling BJP’s arms, such as Bharat Kisan Sabha and Swadeshi Jagran Manch, are opposed to GM crops.\nAs a trade expert says, it will be political suicide for any Indian government to compromise on agriculture and reservations. Fully aware of this, the Modi government seems prepared for any repercussions.\nThis is something that Trump and his advisors ought to understand. Simply expecting India to back it when it is besieged with problems from China is unwise. Targeting and threatening India because it imports 15 million tonnes of cooking oil and forcing it to buy its soybeans will just not work. The US, unwisely, thinks it can strike at India to bring Russia and China around.\nBut what it forgets is that India’s agricultural trade with the US is on the rise. This oil season, ending in October, India has purchased 1.8 lakh tonnes of soybean oil so far, and this could increase in the coming years. India’s poultry feed needs could lead to higher imports of soymeal from the US. The rising number of soybean crushing units in the US should help cater to this need.\nChina’s ageing population is in contrast to India’s youth bulge. This means Beijing’s demand will flatten soon, and New Delhi’s will rise.\nIf Trump and his advisors think they can make India surrender meekly like its neighbours, they are wrong. India, just as Russia and China, has nothing to lose!\nNew Delhi recovered, albeit slowly, from the break up of the Soviet Union, which was its biggest buyer of tea. It can repeat it in the textiles and fisheries sectors that heavily rely on the US. Russia and China have lent a helping hand to India. Would Trump want to risk losing India? Caution and patience are the keys to bilateral relations. Time for the US administration to understand this.\nCOMMENTS\nPublished on August 27, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:53.121585"}, {"title": "Modernise shipping laws", "sub_heading": "The Bills of Lading Act, 2025 fails to give digital, transparency boost", "publisher": "By Shashank Patel\nUpdated - August 27, 2025 at 06:00 AM.", "story": "Electronic bill of lading can ensure cost efficiency, sustainability and transparency in global maritime trade | Photo Credit: Suphanat Khumsap\nThe Parliament enacted the Bills of Lading Act, 2025, during the monsoon session. This Act has replaced the Indian Bills of Lading Act, 1856, but apart from minor restructuring, no substantial changes have been made.\nAlthough the new legislation claims to modernise maritime trade, it surprisingly lacks any provision for electronic bill of lading (eBL), whose adoption is accelerating globally. A 2024 global survey conducted by the International Chamber of Commerce revealed that the share of dual-format users (using both paper and electronic BLs) has surged from 28 per cent in 2022 to 41.7 per cent in 2024. Between the same period, the overall adoption rate of eBL increased from 33 per cent to 49.2 per cent. Further, the use of eBL in place of traditional bill of lading (BL) results in approximately 94 per cent faster processing, enhances process efficiency by up to 89 per cent, improves data accuracy by up to 87 per cent, and enhances security by 89 per cent.\nCost savings\nAccording to a study by McKinsey, ocean carriers issue around 45 million BLs annually, and 100 per cent eBL adoption can annually save approximately 28,000 trees. Also, BL accounts for 10-30 per cent of total trade documentation cost, and adoption of eBL could save around $6.5 billion in direct costs for stakeholders, and boost annual global trade growth by $30-40 billion.\nThe study further reveals that at present, customs are able to physically inspect only 2 per cent of containers. An eBL will facilitate the accurate and timely delivery of data to customs officials, allowing them to inspect cargo data and identify potential targets for inspection even before the arrival of the shipment. This will reduce the illegal trade by 10-15 per cent globally.\nTherefore, eBL alone can ensure cost efficiency, sustainability and transparency in global maritime trade. The absence of such a mechanism undermines the Act’s objective of streamlining operations within the maritime sector.\nNewly inserted Section 5 grants unregulated powers to the Central Government to give directions for carrying out the provisions of the Act. Such unilateral power would leave no place for State governments, traders or industry stakeholders in policy matters. This provision will significantly hamper the federal arrangement of port management as provided under List I (27) and List III (31) of the Constitution of India.\nSection 4(1) provides that “Every bill of lading in the hands of a consignee or endorsee for valuable consideration.. shall be conclusive evidence.. against the master, notwithstanding that such goods may not have been so shipped.” Many believe that this will indirectly open the doors for fake bills, hawala transactions, and fraudulent trading since it allows a BL to be treated as valid even when goods have not been shipped. Such a provision undermines the Act’s objective of enhancing transparency within the maritime sector.\nThe legislation also ignores a significant problem in the modern shipping industry. Article III, Rule 3 of the Hague-Visby Rules and Articles 15(1) & 16 (1, 2) of the Hamburg Rules require the carrier to sign the BL stating the goods were ‘shipped in apparent good order and condition’, ensuring weight, quantity, etc., which becomes difficult especially in the case of gas tankers.\nIn order to avoid guaranteeing the accuracy of the weight or quantity, the masters started adding a “Weight/quantity unknown” clause in the BL. However, the applicability of this clause varies across the jurisdictions; for instance, non-common law countries do not recognise such a clause, whereas English law doesn’t consider the BL to be prima facie evidence of the weight or quantity.\nTherefore, for an equitable and sustainable shipping industry, we need to move away not only from the colonial Act but also from the colonial mindset. A more forward-looking approach is essential to truly modernise and future-proof India’s maritime trade.\nThe writer is an international trade lawyer\nCOMMENTS\nPublished on August 27, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:54.851779"}, {"title": "Trade war creating volatility in the bullion market | The Trending commodity podcast | Ep 01", "sub_heading": "Over the past 20-30 years, gold and silver have at least matched equity returns, proving to be reliable hedges against inflation, policy uncertainty, says Anindya Banerjee, Head-Commodity and Currency, Kotak Securities", "publisher": "By Subramani Ra MancombuShakthi H\nUpdated - August 23, 2025 at 03:12 PM.", "story": "In this episode of businessline’s Trending Commodities, host Subramani Ra Mancombu is joined by Anindya Banerjee, Head of Commodity and Currency, at Kotak Securities to talk about the current volatility in gold and silver markets. \nBanerjee discusses how global developments such as the US Customs proposed 39 per cent tariff on gold bars and its subsequent reversal by President Trump are impacting investor sentiment and price trends. The discussion also touches on the themes of de-dollarisation, the role of central banks, and how India’s gold and silver prices are hitting record highs despite international price ranges stabilising. \n(Host: Subramani Ra Mancombu, Producer: Shakthi H, Renil S Varghese)\nCOMMENTS\nPublished on August 21, 2025\nREAD MORE", "timestamp": "2025-08-28T18:10:59.711128"}, {"title": "Listen. Coal vs climate: Can India power up with cleaner alternatives? | Energonomics podcast with Richa Mishra | EP 01", "sub_heading": "The discussion uncovers critical insights on why sulphur might not be the real problem, and how India’s low-sulphur, high-ash coal is being misunderstood.", "publisher": "By Richa MishraSiddharth Mathew CherianRenil S Varghese\nUpdated - August 03, 2025 at 06:59 PM.", "story": "In this episode of Energonomics with Richa Mishra, we look into India’s sulphur emissions norms at thermal power plants with Professor R Srikanth, Dean at the School of Natural Sciences and Engineering, NIAS.\nThe discussion uncovers critical insights on why sulphur might not be the real problem, and how India’s low-sulphur, high-ash coal is being misunderstood.\nAre FGDs (Flue Gas Desulfurizers) necessary—or are they making things worse for climate and water use? Why isn’t more focus on particulate matter? And what role can nuclear energy play in India’s transition from coal?\nREAD MORE", "timestamp": "2025-08-28T18:11:01.790781"}, {"title": "The Marketing hangout with Shiv and Chitra | EP 01 | A new chapter in book promotions", "sub_heading": "“It’s younger children driving the next wave of reading, especially in early learning and education,” says Gaurav Shrinagesh, CEO, Penguin Random House India.", "publisher": "By Chitra NarayananPrethicshaa Gurumoorthy\nUpdated - August 20, 2025 at 10:39 AM.", "story": "Are bookstores dying or is reading making a comeback? Get the inside story on India’s book market trends in the debut episode of Businessline’s The Marketing Hangout with Shiv & Chitra.\nHosted by Chitra Narayanan and Shiv Shivakumar, this episode features Gaurav Shrinagesh, CEO at Penguin Random House India, who unpacks the revival of reading, why younger audiences are key to growth, how influencers are shaping sales, and what it really takes to make a book a bestseller.\nListen now and find out how the book world is turning the page.\nREAD MORE", "timestamp": "2025-08-28T18:11:05.322580"}, {"title": "State of the Economy. Are rising commodity prices eating into India’s food sector growth?", "sub_heading": "If fuel prices shoot up, the cascading impact on the economy becomes significant, even for the transfer of domestically produced food grains, says Sanjay Kumar, MD & CEO of Rassense Pvt Ltd ", "publisher": "By Subramani Ra MancombuPrethicshaa Gurumoorthy\nUpdated - July 23, 2025 at 04:00 PM.", "story": "In this episode of the State of Economy Podcast, businessline’s Subramani Ra Mancombu speaks with Sanjay Kumar, MD & CEO of Rassense Pvt Ltd, to decode how commodity prices are shaping the future of India’s fast-growing food services sector — currently valued at $80 billion and projected to reach $150 billion by 2030. \nKumar provides a clear-eyed view of inflation trends across key food commodities include pulses, dairy, vegetables, and edible oils and their impact on pricing and profitability. He highlights the double-edged nature of low inflation, questioning whether it reflects healthy supply or weak consumption in India’s largely rural economy. \nThe discussion covers everything from the effects of currency depreciation and global fuel trends to the risks of diverting food crops for fuel. Kumar also weighs in on the challenges posed by unpredictable import duties and the need for a stable policy to ensure better business forecasting. \nREAD MORE", "timestamp": "2025-08-28T18:11:10.501225"}, {"title": "Trade war creating volatility in the bullion market | The Trending commodity podcast | Ep 01", "sub_heading": "Over the past 20-30 years, gold and silver have at least matched equity returns, proving to be reliable hedges against inflation, policy uncertainty, says Anindya Banerjee, Head-Commodity and Currency, Kotak Securities", "publisher": "By Subramani Ra MancombuShakthi H\nUpdated - August 23, 2025 at 03:12 PM.", "story": "In this episode of businessline’s Trending Commodities, host Subramani Ra Mancombu is joined by Anindya Banerjee, Head of Commodity and Currency, at Kotak Securities to talk about the current volatility in gold and silver markets. \nBanerjee discusses how global developments such as the US Customs proposed 39 per cent tariff on gold bars and its subsequent reversal by President Trump are impacting investor sentiment and price trends. The discussion also touches on the themes of de-dollarisation, the role of central banks, and how India’s gold and silver prices are hitting record highs despite international price ranges stabilising. \n(Host: Subramani Ra Mancombu, Producer: Shakthi H, Renil S Varghese)\nREAD MORE", "timestamp": "2025-08-28T18:11:12.319761"}, {"title": "Listen. Coal vs climate: Can India power up with cleaner alternatives? | Energonomics podcast with Richa Mishra | EP 01", "sub_heading": "The discussion uncovers critical insights on why sulphur might not be the real problem, and how India’s low-sulphur, high-ash coal is being misunderstood.", "publisher": "By Richa MishraSiddharth Mathew CherianRenil S Varghese\nUpdated - August 03, 2025 at 06:59 PM.", "story": "In this episode of Energonomics with Richa Mishra, we look into India’s sulphur emissions norms at thermal power plants with Professor R Srikanth, Dean at the School of Natural Sciences and Engineering, NIAS.\nThe discussion uncovers critical insights on why sulphur might not be the real problem, and how India’s low-sulphur, high-ash coal is being misunderstood.\nAre FGDs (Flue Gas Desulfurizers) necessary—or are they making things worse for climate and water use? Why isn’t more focus on particulate matter? And what role can nuclear energy play in India’s transition from coal?\nREAD MORE", "timestamp": "2025-08-28T18:11:13.809008"}, {"title": "The Marketing hangout with Shiv and Chitra | EP 01 | A new chapter in book promotions", "sub_heading": "“It’s younger children driving the next wave of reading, especially in early learning and education,” says Gaurav Shrinagesh, CEO, Penguin Random House India.", "publisher": "By Chitra NarayananPrethicshaa Gurumoorthy\nUpdated - August 20, 2025 at 10:39 AM.", "story": "Are bookstores dying or is reading making a comeback? Get the inside story on India’s book market trends in the debut episode of Businessline’s The Marketing Hangout with Shiv & Chitra.\nHosted by Chitra Narayanan and Shiv Shivakumar, this episode features Gaurav Shrinagesh, CEO at Penguin Random House India, who unpacks the revival of reading, why younger audiences are key to growth, how influencers are shaping sales, and what it really takes to make a book a bestseller.\nListen now and find out how the book world is turning the page.\nREAD MORE", "timestamp": "2025-08-28T18:11:15.327186"}, {"title": "State of the Economy. Are rising commodity prices eating into India’s food sector growth?", "sub_heading": "If fuel prices shoot up, the cascading impact on the economy becomes significant, even for the transfer of domestically produced food grains, says Sanjay Kumar, MD & CEO of Rassense Pvt Ltd ", "publisher": "By Subramani Ra MancombuPrethicshaa Gurumoorthy\nUpdated - July 23, 2025 at 04:00 PM.", "story": "In this episode of the State of Economy Podcast, businessline’s Subramani Ra Mancombu speaks with Sanjay Kumar, MD & CEO of Rassense Pvt Ltd, to decode how commodity prices are shaping the future of India’s fast-growing food services sector — currently valued at $80 billion and projected to reach $150 billion by 2030. \nKumar provides a clear-eyed view of inflation trends across key food commodities include pulses, dairy, vegetables, and edible oils and their impact on pricing and profitability. He highlights the double-edged nature of low inflation, questioning whether it reflects healthy supply or weak consumption in India’s largely rural economy. \nThe discussion covers everything from the effects of currency depreciation and global fuel trends to the risks of diverting food crops for fuel. Kumar also weighs in on the challenges posed by unpredictable import duties and the need for a stable policy to ensure better business forecasting. \nREAD MORE", "timestamp": "2025-08-28T18:11:17.064079"}]